{"S8bsICWk_bk": {"title": "Israelis: Where should the borders of Israel be?", "top_level_comments": ["Your channel opened my eyes to all the different views in Israel. It has been a paradigm shift for me over the yearsThank you for what you do", "Toda raba, Corey. This was very interesting and a wide range of answers.", "This started really well then became depressing towards the end.", "It seems we have crazy people on both sides, when we finally have the courage to vote them out we will be able to achive a lasting peace within the current and realistic borders, this applies for both sides", "Question: Where should the borders of Israel be?Best Answer: Manhattan !!!", "5:00 lol even Corey was like \"whoa whoa whoa\"", "Interesting question, this shows that finding stable peace will take a loooooong time probably", "Really interesting watch! Thanks for making these videos!!", "The State of \" ISREAEL\"has no recognised border,nor Constitution submitted to or recognised  by the UNO , whoMidwifed her very birth.    ISRAEL has therefore granted to herself the privilege of  stretching  and expanding  her bordersto whatever extent and atwhatever point of the compass expediencydirected.", "The guy at 7:47 came from Ethiopia but wants Sinai to be part of Israel 😂", "This was a good question", "1:57 , his reaction is similar to mine During oral examination 🤣", "What is this border they speak of that stretches past Jordan to the Euphrates in Iraq? That's crazy.", "Very interesting question, but the reality is that whatever the solution, it seems like it is impossible for both sides to live together, either in the same country or as neighbors.  The Palestinians obviously are still obsessed with getting their land back, but why not just try to live together in peace?  People are willing to die for land, but no one will take that piece of land with them when they die.  As a human being, I would rather prefer to live in peace and happiness and enjoy my time on earth with happy memories.  That is the most important thing, and not whether a land belongs or does not belong to me.  When you die, you will not take the piece of land with you, but you will take your happy memories with you.", "God promised this land only for descendants of Abraham They are not descendants of Abraham by blood - too mixed with the Canaanites, little happlogroup J dna", "What about two borders between North and South Carolina?", "I'm a bit surprised by these answers. I thought all or majority would want to expand the current borders. Here they're talking about returning certain lands, wow", "Please ask the Palestinians what they think their part of our history was Do they think they have only been oppressed? Or do they take any responsibility for the massacres they committed when the country was a new born. Thanks.", "Thank god finally a good question.", "On my de'ad body..I will not allow any Isr'aeli to take control over our historical Levent (Lebanon, Syria, Jordan, Pale'stine) even though Isr'ael should be dislocated from our area because it's the mole here.", "Hosea 5:10:The princes of Judah were like those who remove the landmark(border); upon them will I pour My wrath like water.", "They are somewhere near the US Congress and Senate, I believe, around 1600 Pennsylvania avenue.", "What was really painful was all those people who can't wear their masks properly. Chin, mouth AND nose. Not that hard.", "the way the second guy spoke hebrew made it sound a lot like arabic! wow :)", "Beyond the temple mount!", "Why when I visited Jerusalem and talked to people, I didn’t get positive answers like this asking maybe because I’m an arab American or maybe you’re not showing everyone. Next time I’ll visit I’ll record myself", "An interesting historical experiment that should be analyzed. After (80) years Soviet states collapsed.  People are  free now.", "Take out politics  ….  As a Pakistani 🇵🇰 …. Jews history & Modern state of Israel fascinate me.", "We want everything but without anyone fighting back for their land that's what they're basically saying", "It’s amazing how you ask the Palestinians where the boarders should be and they say: no boarders it’s all ours, there should not be an Israel.And then you ask the Israelis and they say: where we feel safe, 67,same as today, only one said since we gave away Gaza territory and all they do is fire at us from there.This is the Palestinian problem, completely unattached with reality, how can we progress from that point?!???", "For me, exactly what scripture tells us.....exactly!", "3:00 why does does the old gentleman say that he would want to return all? Is this common attitude amongst the older generation of Israelis?", "Someone should show that girl and that last guy the actual description of Eretz Yisrael is the Torah. I guess they want to get rid of Elat too lol.", "Land swaps are ineffective.", "the women at 4:45 says palestinians should go seek refuge in other arab coutries but then wants invade all the arab countries surrounding Israel. XD ... doesnt seem like the best plan", "An ever expanding borders 🤣", "If it had to adopt the one-state solution, it would have a lot to change to find peace and equality!I think the two-state solution is the best way out, even if some will get mad.", "Now we can guess who feeds the conflicts \"from the Nile to the Euphrates\".", "Now you know why they engineer instability in the middle East", "5:00 lady wants the whole Levant.", "I love Israel!", "If some stranger walk towards me with a camera and asking me very Unease questions while I'm enjoying my meal and minding my own business in a non western country, where democracy don't work even part time.  What do you aspect me to say?  🤔", "There shall be no BORDERs at allall those lines on maps are made by HUMANThe WORLD needs just one functioning direction, instead of multiple non functioning", "Great question", "Corey have you been to Sharif's concert in Hebron?", "Corey have you been to Sharif's concert in Hebron?", "I thought the Nile to the Euphrates (Greater Israel) idea was dead. looks like some Israelis are still promoting the Bible/Tora promise.", "Technically after the war they won , … anywhere . They gave land up they won in that war . Do we think the same would have been done for them ?", "Isn't it Iraq, Syria and southern Turkey? 😂😂", "Can you ask both sides if they are proud of the actions of their respective countries?", "borders are for enemy's.... so... i guess the borders that are easer and better for some force to defend the people from there enemy's...", "as long as This conflict stays political or what ever between two people's Israelis and Palestinians There will always be a hope for peace But if it turns into a religious conflict, there is no hope for a solution or peace at all,And it may turn into a religious conflict if the Israelis implement their plans to demolish the Al-Aqsa Mosque and build the Temple.", "😂😂😂😂", "The two bleu lines in the  flag of israel means Nil and Eupherat", "Are you arab, Corey?You can't be jewish then((", "From the river to the sea Palestine will be free! The people of Palestine live#", "Lose the masks ffs", "come on corey ask them if theyre brainwashed.", "Sunni and Shia must unite.", "\" Sinai is supposed to be ours \" 8:16IN YOUR WET DREAMS, HABIBI.(From Egypt 🇪🇬)", "Only few people see and say the obvious:  2021 borders. The only borders which can be acceptable in 2021. Who occopy what (live where) to the date of the agreement, get it. No more no less. If you start to claim territory, where other people live today, you open also your home to claim of somebody. This is valid both to those who want to grap Jewish Ariel and Arab Gilad.", "ask palestinians the same question", "I have a question for Israelites: If this is your minds, what f..ing peace you are looking for??", "This channel made me into a zionist", "Why do all your videos have double subtitles", "Showing their true colors. The \"peace they want\" is pieces of other countries! They didn't get burnt for no reason!!", "I would go with the second guy opinion. Freedom to all regardless Arabs or jews with less checkpoints.  There's no borders.   About 1967 that's just on papers no one agreed with that agreement.", "1- they don't prefer to be a civil country, they want it to be a Jewish country!! come on ... we are in 2021 and this concept of countries and mindset should be gone!2-We will take other people countries (like my country Jordan) but we don't want people attacks ... just accept what is written in Torah", "The Belfort borders would be a Good start.", "Border of Israel 🇮🇱 should be all of Egypt 🇪🇬, all of Jordan 🇯🇴, all of Syria 🇸🇾, all of Iraq 🇮🇶, half of Saudia, all of Qatar 🇶🇦, Bahrain 🇧🇭, Kuwait 🇰🇼, all of UAE 🇦🇪 ... touching Iran 🇮🇷, Turkey 🇹🇷, Algeria 🇩🇿 and African nations", "😂😂😂😂", "Oded yinon", "Bravo. Merci beaucoup, Corey. You should practice Judaism. I know you're atheist but you're a Jew. You should embrace it.", "“Sinaï supossed to be ours” lol keep on dreaming 😂", "There is no \"1967 border\". There is only the \"1967 demarcation line\" or the 1949 Armistice border, which is to say a line that was temporarily agreed as part of ceasefire between warring parties (in this case Israel, Jordan and Syria).", "Free Judea! 🕎✊", "הר סיני במצרים חחחחחחחחחחחחחחח מצא את מי לשאול אני מתה", "Hahahaha", "8:00 Well the sl*ve trade doesn't seem that bad afterall😂🤬", "Hey Corey, we've been watching this channel for years. Come join us for a discussion.", "4:51 well it seems we have a Israeli official/TGIP supporter here  🤡(the background is PERFECT)", "If God gave Israel solely to the Jews why hasn't it happened yet?", "I find it funny how some Israelis think about occupying more arab lands, while they can't be sure that their state would even still exist in the next couple of years.", "Gaza should just become part of Israel to get legally treated just and be in a democracy.  Sometimes you got to forgive and try to forget.  Endless wars solve nothing.  Gaza deserves better than being just a proxy war state", "l think the Israelis should take whatever they want, entomb the Palestinian people behind concrete walls, and make other nations pay for it. Oh wait, they have already done that.", "Clickbait beautiful woman. Your vaccinating too much . 3-4 shots or more will have long term effects ."]}, "A8kEoG-YZ2k": {"title": "Anti-Zionist religious Jews: Who do you want as your neighbour?", "top_level_comments": ["The guy at 3:40 is famous. He's been in documentaries and had articles written about him. He is the father of 16 children and is a member of Neturei Karta.", "My opposite neighbor is a Jew and my downstairs neighbor is Greek. We never once asked each other what your religion was. Our beliefs concern us, not anyone else. Easter, Rosh Hashana and Ramadan holidays are celebrated in the same building, this is not a situation to be disturbed, on the contrary, its a cultural richness.", "It's sad to hear the guy saying that he has to ask his Rabbi.....it felt that he wasn't taught to reason for himself", "I can’t believe you got Yoel! I’ve been following that guy around Israel for fifteen years on YT. He’s a spokesperson for the anti-Zionist Haredim. Thanks for getting his view!", "Very interesting, thanks.  Judaism seems ridiculously complicated.", "The last guy was my favorite. He didn't agree with him, but was able to have a civilized discussion", "Dang, this hit some really weird places", "I think Yoel had the most genuine answer", "LOL,  I have seen the most confused faces of my entire life!", "You managed to find Yoel Krauss, at 3:48Good work", "5:00 that's the same principle as Muslim believe. Our existence is prove of Allah", "Loved the last guy! Happy friendly and confident. You don’t often get all three in that community. (Will probably get some choice corrections from his rebbe)", "Corey, just to clarify with the guy @ 3:40... He was saying \"father\" in the capital \"Father\" sense, not his biological father. But rather that this theoretical secular Jewish neighbor is supposed to be his brother but is going against their common Father, i.e., God.", "Corey, in Tuvia from Ramat Gan 4:19 I think you met your match. Keep up the good work.", "The guy at 5:38  is such a piece of work..\" you can't say that, it's your opinion keep it to yourself !\" it explains alot.", "Tbh I don't have any problem to live with any one of em as long as they are nice & friendly", "Corey why would you say that “ even with what they do with Jews”", "It even says it in the scriptures... But some would rather distort them to fit their own political views... Psalms 146:9- \"The LORD preserveth the strangers; he relieveth the fatherless and widow: but the way of the wicked he turneth upside down\".", "3:51 I’m so glad you guys got this guy to answer he’s so militant he has a documentary of his family and him", "The first guy is the best... and the one in the middle", "Those to whom We gave the Scripture (torah) know him as they know their own sons. But indeed, a party of them conceal the truth while they know", "Awesome video! Thanks for the amazing work", "I like the one guy who says he has to ask his Rabbi", "Some of these answers are quite understandable, in reality conservatives from any of these religion have more in common in practise than seculars.", "I think they'd love canadians as neighbors 😀", "Man, those dudes are rocking some serious payos!", "These Brainiacs aren't 'Braining Sufficiently'.I'm Jewish, but I'm very Reform. I was definitely Secular most of my life, but I am joining a new Synagogue in my area that I recently moved to. I'm excited about it, frankly.Anyway. G-d forgive me, but all of these people are painfully stupid.They were asked who they would prefer to live beside. They WERE NOT ASKED 'Who would you rather be BFF Besties with and film a You Tube series with chronicling their Epic 'Bromance together'.If you ask me, my answer is \"The person that doesn't blast Cardi B at 3 in the morning.'The person that doesn't own guns'.'The person who doesn't borrow all my stuff constantly and never return it'.The person who doesn't use the same stupid, tired joke every time he sees me doing yard work like 'Working hard or hardly working'.As my late Bubbie would say 'Oy Guvalt'. These guys are all literally dumb AF!So much for the stereotype that Jews are all 'brilliant people'!", "4:15 all respect to you", "🔥👏", "Ain’t nobody going to talk about how my man @3:41 is totally underrated", "Yoel min 3:40 also appeared on a DW documentary about ultra-orthodox people who left Israel and moved to Germany!", "3:40 ah finally, Joel, i knew him from other videos, respect 👍👍👍", "I love this brother 3.38 on the VDO. He says the truth", "4:22-Smartest guy. Also Ramat Gan is secular", "Fantastic episode Corey", "Pretty ironic when you said you're an atheist but are manipulating some verse from the Old Testament to claim the right to stay at Palestine.", "Finally, the fellow at 4:24 nailed it.  He will not give up on his brother.  Excellent answer!", "Finally a decent question", "Wow Yoel is famous in youtube !!! Have a nice day from Dpain !!!", "Nice video Corey!  Love from Canada 🇨🇦", "Oh Corey Corey Corey… as he says brother you are the embodiment of the proof G-d exists", "As a Persian Muslim a salute the man at 3.40", "WOW....long time no see!!.....Loved this video!!", "Shalom, Salam, Peace To All Mankind. The Quran [Last Testament] Refers To The Orthodox Jews Are More Versed In Torah, Thus More Pious.", "Tuvia gave some good daowa", "4:11 what a good response", "Corey Gil-Shuster: \"What proof is there of a G-d?\"\r\rTraditional Jewish man : \"You are the proof . . . man is the greatest proof of the Creator of the world.\"\r\r- - - -\r\rA father complained to the Besht (Rabbi Israel ben Eliezer, c.1698-1760) that his son had forsaken G-d. \"What, Rabbi, shall I do?\" \"Love him more than ever,\" was the Besht's reply.", "That guy yoel is noturious  known as extreme anti zionist, they made a documentary about him.", "MAN'S HEART IS SOMEWHAT MORE  CONDUCIVE TO HATE", "very interesting hearing the actual opinions of people in Israel", "Corey Gil-Shuster, are you really an atheist or are you just measuring the other person's reaction?", "The first guy described it in the simplest and most amazing way!🙏🏻❤️", "Damn bro what a awsome question bro i love ur work brother", "❤️❤️❤️ Yoel", "How about an agnostic who hopes for something.", "4:20 is the best! If more can be like him! Toda!", "Apparently ultra orthodox believes u should let the mesiach do it's work", "You should understand like they also understand it, that they were sacrificed by \"own people\" and I don't think about Poles... only because those people wants to develop their religion- oh how modern is being traitors...", "@3:41 is the guy one can easily have a chat with", "Why is it so expensive to get from one part of israel to the other? It must not be like north america, where you can drive from one part of Florida to the other in several hours on a tank of gas. Or Toronto to Ottawa", "young ortodox jews are so sweet!", "( YAHAWAH - BAHASHAM ) 🔥🔥( The Most High ) GOD ✡️🔥🔥🔥", "Thanks man but no thanks??!!Your question is wrong and confusingYou should ask do you prefer an atheist neighbor or a religious muslimThere is nothing such as atheist jew these are two opposite things,man can't you understand that?", "John15:19 says if the Israelites in the world were of this world, the world would love the Israelites, but because God has chosen the Israelites (John 15:19), this world hates the Israelites. \rThe main reason these people calling themselves jewISH is because they don't fit the curses described in Deuteronomy 28:15-68, nor do they fit the blessing from Deuteronomy 7:6 and Deuteronomy 28:1-14 according to James 1:1.", "please bring mon ami along the next time you go to the Jewish district", "Respect to the one guy around 3.40 mark", "4:21 Seems to be the smartest!", "It would have been interesting too if you had asked them what country they would like as neighbor, of course this is mainly about Israeli-Palestinian relationships so I understand it was about Muslims 👍👍 thanks for your videos", "So basically they prefer to be neighbors with anyone who just respect their Shabath and minding their own business.", "You take everything From them and then wonder why they harm you !? , you are strange .", "And every muslim will prefer believers over secular & libral !", "2:18 A lot of the haredis youngsters don't have social skills, that's the result of a bad education system", "(3:40),that Mr. Yoel is an honest forthright man. He acknowledge the truth & doesn't deny it.", "For those who are making fun of the Jew who thinks he should \"ask his rabbi\" don't see the innocence of his answer. He clearly wants to do well and right by his faith regardless of whether the answer is right, wrong, acceptable or non.Answers like this shows the humility in his heart not a \"because of this\" or \"because of that\".Both some Jews and Christians alike don't have the all the answers or don't know how to answer certain questions.", "The reason I think the answer about asking his rabbi is a dodge is that he was not asked about a matter of law. He was asked about a personal preference. I also find it interesting that the distinction here is between secular Jews and Charedim. In the US, the majority of Jews are neither.", "Corey, you live in Israel what additional proof do you need?", "25$ or more for some extra behind the scenes photage or what it really is photage that was not used..like sure if it was somewhere around 5-10\"", "This helps me with depression", "Here is ethno fascism on display!!", "There is still some true Bani Israel", "How many believe there really was a motorcycle there?", "Very telling...", "4:11 now that's a man I can respect. Bless you my brother.", "Wait, is he really an atheist ?", "Nothing is Jewish about those European", "You interviewed Yoel Krause!", "long Live Falastine!", "I keep wondering where the human mind is. The difference between these two religions is no difference at all, just a manipulation.... The sanctuary of Islam is the \"KABBALAH\" And in Islam it is the \"Kaaba and the god Allah\" To be precise, that means. KABBA-ALLAH = KABBALAH  It is one and the same religion that comes from Israel.Pozdravi iz Bosne 🇧🇦💪", "Am Muslim and I like Jew's brothers and sisters they are true believers", "أنادمي فلسطيني 🇵🇸", "Believe what you want but NEVER force children to. That's destruction of innocence and that's pure evil.", "2:53 he kinda looks like yacov rambsel 😀", "Do religious people ( of every religion ) think they are brainwashed? - Uh, sorry, I don't know the answer to that. I'll have to go and ask my rabbi, imam, priest ...", "I respect my Christian brothers. The only difference with Islam and Christian is Muslim don't believe Jesus PBUH the son of God & God at the same Time! but our action will speak louder than Words! I love my Christian family. We are not your enemy!” Jesus said “ If God were your Father, you would love me, for I came from God and I am here. I came not of my own accord, but he (Elah) sent me.“O you who have been given the Scripture (Jews and Christians)! Believe in what We have revealed (to Muhammad) confirming what is (already) with you...” (Quran 4:46)WHY I CONVERTED TO ISLAM- I Got 13 VALID REASONS WHY AND HOW MUSLIMS ARE LIKE JESUS (PBUH) AND TRUER FOLLOWERS OF JESUS THAN MOST CHRISTIANS BELIEVE:1. Jesus (pbuh) taught that there is only One God and Only God should be worshipped as taught in Deut 6:4, Mark 12:29.Muslims also believe this as taught in the Qur'an verse 4:171.2. Jesus (pbuh) didn't eat pork as taught in Leviticus 11:7, and neither do Muslims as taught in the Qur'an verse 6:145.3. Jesus (pbuh) greeted with the words \"As-salaam alaikum\" (Peace be with you), in John 20:21.Muslims also greet each other this way.4. Jesus (pbuh) always said \"God Willing\" (inshallah), Muslims say this too before doing anything as taught in the Qur'an verses 18:23-24.5. Jesus (pbuh) washed his face, hands, and feet before praying. The Muslims do the same.6. Jesus (pbuh) and other prophets of the Bible prayed with their head to the ground see (Matthew26:39).Muslims do too as taught in the Qur'an verse 3:43.7. Jesus (pbuh) had a beard and wore a throbe. It is Sunnah for Muslim men to do the same.8. Jesus (pbuh) followed the law and believed in all the prophets, see (Matthew 5:17).Muslims do too as taught in the Qur'an verses 3:84, and 2:285.9. Jesus' mother Maryam (pbuh) dressed modestly by fully covering her body and wearing a headscarf (hijab) as found in 1 Timothy 2:9, Genesis 24:64-65, and Corinthians 11:6.Muslim women modestly dress the same as taught in the Qur'an verse 33:59.10. Jesus (pbuh) and other prophets of the Bible fasted up to 40 days see (Exodus 34:28, Daniel 10:2-6, 1Kings 19:8, and Matthew 4:1. Muslims do so also during the month of Ramadan.Muslims are required to fast the full obligatory 30 days (see Qur'an 2:183), and others take it a step further by fasting an additional 6 days to increase their rewards.11. Jesus (pbuh) taught to say \"Peace to this house\" when entering it see (Luke 10:5), and to also greet the people in the house with \"peace be unto you\". Muslims do exactly what Jesus did and taught. When we enter our homes and the homes of others we say \"Bismillah\" and also greet with \"as salaamu alaikum\" (peace be upon you) as taught in the Qur'an verse 24:61.12. Jesus (pbuh) was circumcised. Circumcision is 1 of the 5 fitrah in Islam, so Muslim men are required to be circumcised.According to the Bible in Luke 2:21, Jesus was eight days old when he was circumcised. In the Torah, Allah/God stated to the Prophet Abraham (pbuh) that it is an \"Everlasting covenant\" (see Genesis 17:13).In the Qur'an verse 16:123 Muslims are required to follow the religion of Abraham. The Prophet Muhammad (saws) said, \"The Prophet Abraham circumcised himself when he was eighty years old.\" (see Sahih hadith Bukhari, Muslim, and Ahmad).13. Jesus (pbuh) spoke aramaic and called God \"Elah\", which is pronounced the same as \"Allah\".Aramaic is an ancient, Biblical language. It is one of the Semitic languages that also include Hebrew, Arabic, Ethiopic and the ancient Assyrian and Babylonian language of Akkadian.The Aramaic \"Elah\" and the Arabic \"Allah\" are the same.The Aramaic \"Elah\" is derived from the Arabic \"Allah\", and it means \"GOD\".\"Allah\" in Arabic also means \"GOD\", the Supreme GOD Almighty.You can easily see the similarity in their pronunciation so this concludes that the God of Jesus is also the God of the Muslims, of all mankind, and all that exist.Now tell me who is the real follower of Jesus (pbuh)? Obviously Muslims.Now I believe am a true follower of Jesus PBUH. You shall not murder.  Exodus 20:13For everything there is a season, and a time for every matter under heaven: a time to be born, and a time to die; a time to plant and a time to pluck up what is planted.Ecclesiastes 3: 1-4'When their time....arrives they cannot tarry for a single hour nor can they go ahead'.  Al Quran Surah 16:61A sincere Christian and a Jew are those of your brothers in Faith. Muslim's Believe. 'What will it profit a man if he gains the whole world and loses his soul' Christianity Mathew 16:26Your Body is a Temple: 1 Corinthian 6:19 (My interpretation: Eat junk food be junky alike, eat healthy food be Wealthy alike.)Muslims don't call them-self, we are Mohamadism! But Muslim in Arabic = Meaning He who submit & believes! Just like God in Hebrew is Elohim and in Aramaic is Ela and also in Arabic is Allah. Elohim, Ela and Allah sound the same to me!Muslim's believe in the Torah Tenakh Gospel and the Al Quran.What do Muslim say about Mary and the Jews & ChristianGod sent the Angel to Mary and said \" O Mary indeed Allah has chosen you and purified you and be devoutly obedient to your lord and prostrate and bow with those who bow in prayer . O Mary indeed Allah give you the Messiah Jesus (PBUH). He will speak to the people in the cradle and in maturity and will be of the righteous\". She said \"My lord how will i have a child when no man has touched me\". \"When he (Allah) decrees a matter He only says to it BE and it will Be, He will (Jesus) teach him writing and Wisdom and the Torah and Gospel\". Surah Ali Imran 3:42 AL QURANCONCEPT OF GOD & JESUS IN ISLAM VS. CHRISTIANITY - (The MOST TOUCHING PART!!)https://m.youtube.com/watch?v=8jVxKgxvhAUThe enemy of faith call Jews, Jews because that they were from Jerusalem, and Christians because they followed christ. O mankind, We have created you from a male and a female and have made you into nations and tribes for you to know one another. Truly, the noblest of you with God is the most pious.2 Truly, God is All-Knowing, All-Aware. (Quran, 49:13)Islam rejects certain individuals or nations being favored because of their wealth, power, or race. God created human beings as equals who are to be distinguished from each other only on the basis of their faith and piety.  The Prophet Muhammad said: {O people! Your God is one and your forefather (Adam) is one. An Arab is not better than a non-Arab and a non-Arab is not better than an Arab, and a white person is not better than a black person and a black person is not better than a white person,except in piety.}Do Islamic Terrorists really get 72 Virgins? False Hadith | Conspiracy To Destroy Islam Hadith Who are ISIS : Israel Secret Intelligence Servicehttps://m.youtube.com/watch?v=R-AGLuV351gLesley Hazleton: \"Prophet Muhammad [s]: Where did Humanity Go Wrong?\"https://m.youtube.com/watch?v=2-hTxDvRVloRussian Christian priest about Islamhttps://m.youtube.com/watch?v=E_1oRMeumP4For Those Who Hate Islam - Message From Christian Sisterhttps://m.youtube.com/watch?v=SqNzxtcRIMsCatholic Priest Converts To Islam, Says It's Religion Of Peace.https://m.youtube.com/watch?v=Chrb1PZrFl4IslamTake care of Five Before five:1: Take Care of Youth Before Maturity.2: Take Care of your Time Before Preoccupied.3: Take Care of your Health Before Sickness.4: Take Care of your Wealth Before your Poverty 5: Take Care of your Life Before Death.  Jewish Rabbis Say Islam Is The Truth. https://m.youtube.com/watch?v=CBcA2IaZyNgVerily, Allah does not look at your appearance or wealth, but rather he looks at your hearts and actions.”For Those Who Hate Islam - Message From Christian Sisterhttps://m.youtube.com/watch?v=SqNzxtcRIMsMuslim Scientists And Their Inventions That Changed The World https://m.youtube.com/watch?v=eO1xEDriHRo", "The guy around 4:30 is hillarious :)", "Masha Allah ,After years I finally realized what my daddy said was  true, the real Jews people are always nice ,they always respect everyone , sorry my English", "5:32 הוא יכול לומר ועוד איך וואוווו", "If you remove the political / territorial dimension from the Jews and Muslims of the holy land, your left with cousins.", "Jesus Christ is lord 🙏"]}, "xDDrGcp-Fjw": {"title": "Israelis: Would you speak to Transgender people in the gender they identify as?", "top_level_comments": ["Love the fact that you interview people from different areas of Israel", "Hey Corey love the channel! Great work you are doing! I’d like to see a video where you ask the same question to the Palestinians! Thank you reading this!", "This was definitely going in the right direction, though the person asking the question may have a had a narrow view of what transgender means. Kinda personal to me, as I know more Female to Male Trans (FTM) folk, though often they do not get the same level of attention as MTF's", "Yo Corey where is the video about change with the Palestinian mindset? You interviewed me a year ago in Natanya and I haven't seen it yet.", "He should have asked Haredim to get some of their opinions", "Love to Israel from India🙏❤U ppl always stay in my heart🙏", "I wonder what Moses would say, if he is alive between us and saw this version of Judaism :)", "I think that many people would not even know that people have switched genders. I have a cousin that changed her first name. Still female, always female. New people who met her called her by her middle name, which she used now. I was raised since birth calling her one name for 20+ years, and called her the name I always used. If, I happen to remember,  I would use both names.", "Love to Israel from India🙏❤U ppl always stay in my heart🙏", "Thank you for the video!", "Of course I would but if that person is telling me that there are dozens of genders and that I should use some made up pronounces I would ask that person about his identity crisis first.", "If someone introduces themselves as a bowl of purple chowder, that is how I will refer to them- no actual need for sexual identification from my end.", "I personally would even though I don't believe a transman is actually a man, and I would never ever date a transwoman because in my view they are not real women. I understand it is important to them so I won't go out of my way to offend them.", "If you go to Tel Aviv every one would respect it there all liberal and a lot of gay ppl there", "I think the old ladies wouldn't treat Dana International as a \"he\" , because she is so female, anyway good to know young people are not biased against trans community. Now please let ask the same to arab israelis, religious israelis  and palestinians in the West Bank", "Dear Israeli people, I have a random request for you as you are always famous for being a high tech nation, which you truly are. It would be nice if the google translator in Hebrew could be improved a little. It seems embarrassing that Israel, as a high-tech country, does not have a decent Google translator, while recently digitized countries such as Estonia or Latvia got a great Google translator. Could that also be changed for the Hebrew Google translator?  Thank you and dear regards!", "Now ask this in Gaza. Make sure you got a helicopter to get the hell out when needed.", "HOLA Corey!! I'm from Ibiza SPAIN, and I love your videos and your channel. Great insight from the Middle East!! BESOS/KISSES :)", "Please ask if they'd have a trans person as a friend, lover, flatmate, employee etc.", "his language or word choice is poor.  when the final city of Jerusalem is created all occupants will accept one another", "The apology at the beginning of the video was mad!64", "Hmm...From Messiah to Transgender... a great switch...maybe Corey is trying to prepare people in case the messiah himself is a transgender, :)", "I am begging you to do a ask a Palestinian about this. Fair is fair and it will be hilarious 🤣", "I would like to know what Jews think of messianic Jews.", "You didn't ask the verity of the israelis, the answers spouse to be different.", "1:22 Damn the pet parrot is so cute", "The guy at 4:11 is so sweet 😍", "It's funny that some who said they would not use the preferred pronouns used them and some people who said they would use them didn't.", "The people in the background at 4:44 were so listening and talking about  the question.", "I would address them with their preferred pronoun but if they force me to say it then we have a problem.", "In Arab they kill first them by throwing from tower then MSM says gravity killed them 😜😜😇😂.", "Lol old folk are based", "I have worked with transgender people, gay people and I just respect them the way they respect me. Minding my own business. At the end of the day who are we to judge .it's their own choice which they wanted to be. It's crazy how many are these days.", "I have known a couple of people like this over time.  One cannot decide if he is a she or vice versa.  In conversation changes from masculine to feminine and back again.  One time dresses up and the time no,  He/she has not gone into changing their body, that person is just a cross dresser and terribly confused at that.  Another one was going through the procedure and called themself don/dawn.  This was many years ago and there was very little support for these people except in the gay community.  Would I refer to them by there preferred pronoun?  Yes, just to avoid conflict and confusion.  But personally I just regard them still as biologically make.  BTW, you did not mention that there are women that choose to be man, but they may a minority.", "This is why I respect Israel and non Islamic or religious extremist countries. They understand people deserve respect and love regardless of gender. I'm from Thailand and a trans person myself and grew up as girl. My family is Thai and Christians. Though it was hard for them but they accepted me as they were not willing to loose child over what they think. They believe that in time Jesus will use me as he had planned. And today through his blessing many of my Thai LGBT friends have accepted Christ, left their past life behind and even sacrificed their sexual life just to dedicate their life for his ministry. For God sees the heart not the flesh.  He will judge us by the fruit we bare. Shalom Israel with my love and respect to Israel from Thailand.", "Nothing but love for Israel. May God bless them always.", "That also assumes that the trans person is \"obvious\" If you are NOT obvious, it's not an issue.", "👏👏👏👏👏👏👏👏", "This is a stupid question to ask but I appreciate that you’ve changed the topic.", "Compare to the answers of the Palestinians…", "In my country we just use the birth gender.", "Next time ask some Arabs, I'm sure most of them will sound like the Israelis 😂", "If you honor the God who created the male as he is, then you will call the male just as he was created by his Creator.If you want to despise God forbid who created you as you are, then God forbid you call a male a female. This is your test before God. Can you argue with your Creator ?!", "I want people to refer to me as doctor eventhough I'm not one.", "Now, go ask the same question in the West Bank", "The don't ask don't tell policy is a hard policy to break after long time.", "You should go visit Trans-Jordan and ask if they have an agenda.", "Love and respect to Jews from India 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳.", "As Israeli: Yea, why not? I would respect that, every person should live their life as they wish.", "Yes,if they come to my shop to buy stuffs :P", "*Dana International has entered the comment section*", "And they follow the torah lol  god chosen people", "Need a Gaza Strip Hamas edition of this question", "The people that said they would talk to them in the feminine, ask them would they date that person.", "People will probably say I’m a bigot even though I pray for all people and care about all people but only because I don’t agree with trans people. Today people only live for others approval even when it goes against the truth. Your not helping those people out at all by accepting the lie of others beliefs about who they think they are. God is the Truth and if you live a lie or if your someone who accepts lies and not the truth you are not living in accordance with Gods wishes. Now I wouldn’t go out of my way to “hurt” someone who I know/see is transgendered, but I wouldn’t speak of what I know to be a lie so someone can live out their lie in peace because in the end it will hurt them on judgement day. So I think it’s good to respect everyone no matter what, while speaking the truth in righteousness, even though it might hurt someone who wants to be called something that they are not. Again I love all people and pray for all but it’s better to live according to what God would have us believe rather then sinful humanity’s lies. If we live by lies then the terms men and women will become meaningless. Also it presents problems with bathrooms/medically/scholarships/sports etc……………… and it will eventually hurt society as a whole someday.", "Dear cisgender video maker, thank you for trying your best to respect us, its all we ask and its appreciated.", "OnThisDay 2009, the World Archaeological Conference was held in Ramallah. WAC President Claire Smith stated, “Since it is difficult for Palestinian archaeologists to interact with the international community, WAC decided to go to Palestine”So much for The Land Of Israel game", "Did I miss the meeting or when did we get to choose what gender we are? \"That's his/her choice\" May God guide us.", "women often say look at their mind and not their body, well we cant see their minds can we we see their bodies.", "I think this whole transgender movement started with Rene Richards… “tennis without balls!”", "Dang! Corey just can't resist asking this BIG question 🤭 oh Boy, the lady's response was classic.....English 🤣🤣🤣🤣🤣", "4:45 the guys in the background lol", "0:26I think that people don't study history that much and don't do much pondering about how the past might have been culturally speaking.Just a short incursion in ancient Greek history would suffice to understand just how accepting the higher classes were of alternative sexualities, especially ephebophilia and homosexuality.", "In normal circumstances, people don't present themselves as transgender, but in their adopted gender.  It would seem very unnatural to address a person who looked like a man as a woman, and vice versa.", "Everytime I saw Cory on camera I could sense something corrupt about him, and that he was not a man of God. Now it's confirmed. Unsubscribed!", "LORD JESUS (YESHUA) WIN ON CROSS FOR US 🙏 (Isaiah 53) , (Psalms 22) , (Zechariah 12 : 10) ! Read BIBLE 📖 .", "5:37 for me \"she\" is a man if that is what \"she\" chose in life so I accept it", "I bet he won't ask the Zoroastrians...", "You should ask the older generation", "YESHUA IS MESSIAH ❤️ (Isaiah 53 : 3) !", "💙🤍💙A BLESSED SHAVUAH TOV AND CHODESH TOV TO ALL AM YISROEL AND FRIENDS OF ZION 💙🤍💙ROSH CHODESH ELUL WILL BE TODAY AND TOMORROW WHICH COMES TO US FOR GOOD", "Are you going to ask this question in \"Palestine\"?   I wanna see that one.   😃", "Sorrry, Corey, you can better. This is the useless video ever. What are these ppl in the street expected to say? The question is not relevant when it's abstract. Everyone is then tolerant. The real thing is how the family and the beloved ones  are reacting, how they manage this change, how does a mother  deal  with it, when her daughter becomes a boy, how speaks the father with  (or about) his son after becoming a woman. That would be interesting to know. These ppl in the street are political correct, that's all. I don't believe one word.", "Interesting how in each interview he only gave the example of a man identifying as a woman and never mentioned a woman identifying as a man.", "LORD JESUS IS ETERNAL WORD OF GOD In Flesh (Isaiah 9 : 6-7) , (Micah 5 : 2) ! ONLY WAY TO HEAVEN 🙏 (Daniel 7 : 13-14) .", "Nice video 👍", "\"for me she is a man\" - then why do you say 'she'?", "I will speak to each individual according to *physical gendr .* Only 2 gendrs male and female . It is written in the beginning ELOHIM GOD created them male and female , in His image .Science confirms The Bible it is called *BIOLOGY .* Trnsgendr is per_verse s_i_n created by haSatan . haSatan destrys puts his image over ELOHIM GOD .Good News ! There is only One Name to break the bndage of any s_i_n include trnsgendr . His Name is יהשוע YAHshua Jesus !!!! הללויה HaleluYAH PraiseOurYAH !!!💗❤️💗", "yeah now do it in palestine!!", "Play stupid games, win stupid prizes.", "3:58 nice guy and happy couple....in our society we speak with transgender as female cause ....I think transgender has two types one by born transgender and other become surgery ......what's your opinion....?", "I think that I have seen Daniel from Ashdod and in other video.", "didnt ask the religious israelis?", "only country in the middle east where lgbt people are respected", "In the name of God, the Gracious, the Merciful.1. A chapter that We have revealed, and made obligatory, and revealed in it clear Verses, that you may take heed.2. The adulteress and the adulterer—whip each one of them a hundred lashes, and let no pity towards them overcome you regarding God’s Law, if you believe in God and the Last Day. And let a group of believers witness their punishment.3. The adulterer shall marry none but an adulteress or an idolatress; and the adulteress shall marry none but an adulterer or an idolater. That has been prohibited for the believers.4. Those who accuse chaste women, then cannot bring four witnesses, whip them eighty lashes, and do not ever accept their testimony. For these are the immoral.5. Except for those who repent afterwards, and reform; for God is Forgiving and Merciful.6. As for those who accuse their own spouses, but have no witnesses except themselves, the testimony of one of them is equivalent to four testimonies, if he swears by God that he is truthful.7. And the fifth time, that God’s curse be upon him, if he is a liar.8. But punishment shall be averted from her, if she swears four times by God, that he is a liar.9. And the fifth time, that God’s wrath be upon her, if he is truthful.10. Were it not for God’s grace upon you, and His mercy, and that God is Conciliatory and Wise.11. Those who perpetrated the slander are a band of you. Do not consider it bad for you, but it is good for you. Each person among them bears his share in the sin. As for him who played the major role—for him is a terrible punishment.12. Why, when you heard about it, the believing men and women did not think well of one another, and say, “This is an obvious lie”?13. Why did they not bring four witnesses to testify to it? If they fail to bring the witnesses, then in God’s sight, they are liars.14. Were it not for God’s favor upon you, and His mercy, in this world and the Hereafter, you would have suffered a great punishment for what you have ventured into.15. When you rumored it with your tongues, and spoke with your mouths what you had no knowledge of, and you considered it trivial; but according to God, it is serious.16. When you heard it, you should have said, “It is not for us to repeat this. By Your glory, this is a serious slander.”17. God cautions you never to return to the like of it, if you are believers.18. God explains the Verses to you. God is Knowing and Wise.19. Those who love to see immorality spread among the believers—for them is a painful punishment, in this life and in the Hereafter. God knows, and you do not know.20. Were it not for God’s grace upon you, and His mercy, and that God is Clement and Merciful.21. O you who believe! Do not follow Satan’s footsteps. Whoever follows Satan’s footsteps—he advocates obscenity and immorality. Were it not for God’s grace towards you, and His mercy, not one of you would have been pure, ever. But God purifies whomever He wills. God is All-Hearing, All-Knowing.22. Those of you who have affluence and means should not refuse to give to the relatives, and the needy, and the emigrants for the sake of God. And let them pardon, and let them overlook. Do you not love for God to pardon you? God is All-Forgiving, Most Merciful.23. Those who slander honorable, innocent, believing women are cursed in this life and in the Hereafter. They will have a terrible punishment.24. On the Day when their tongues, and their hands, and their feet will testify against them regarding what they used to do.25. On that Day, God will pay them their account in full, and they will know that God is the Evident Reality.26. Bad women are for bad men, and bad men are for bad women, and good women are for good men, and good men are for good women. Those are acquitted of what they say. There is forgiveness for them, and a generous provision.27. O you who believe! Do not enter homes other than your own, until you have asked permission and greeted their occupants. That is better for you, that you may be aware.28. And if you find no one in them, do not enter them until you are given permission. And if it is said to you, “Turn back,” then turn back. That is more proper for you. God is aware of what you do.29. There is no blame on you for entering uninhabited houses, in which are belongings of yours. God knows what you reveal and what you conceal.30. Tell the believing men to restrain their looks, and to guard their privates. That is purer for them. God is cognizant of what they do.31. And tell the believing women to restrain their looks, and to guard their privates, and not display their beauty except what is apparent thereof, and to draw their coverings over their breasts, and not expose their beauty except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, their women, what their right hands possess, their male attendants who have no sexual desires, or children who are not yet aware of the nakedness of women. And they should not strike their feet to draw attention to their hidden beauty. And repent to God, all of you believers, so that you may succeed.32. And wed the singles among you, and those who are fit among your servants and maids. If they are poor, God will enrich them from His bounty. God is All-Encompassing, All-Knowing.33. And let those who do not find the means to marry abstain, until God enriches them from His bounty. If any of your servants wish to be freed, grant them their wish, if you recognize some good in them. And give them of God’s wealth which he has given you. And do not compel your girls to prostitution, seeking the materials of this life, if they desire to remain chaste. Should anyone compel them—after their compulsion, God is Forgiving and Merciful.34. We have sent down to you clarifying revelations, and examples of those who passed on before you, and advice for the righteous.35. God is the Light of the heavens and the earth. The allegory of His light is that of a pillar on which is a lamp. The lamp is within a glass. The glass is like a brilliant planet, fueled by a blessed tree, an olive tree, neither eastern nor western. Its oil would almost illuminate, even if no fire has touched it. Light upon Light. God guides to His light whomever He wills. God thus cites the parables for the people. God is cognizant of everything.36. In houses which God has permitted to be raised, and His name is celebrated therein. He is glorified therein, morning and evening.37. By men who neither trading nor commerce distracts them from God’s remembrance, and from performing the prayers, and from giving alms. They fear a Day when hearts and sights are overturned.38. God will reward them according to the best of what they did, and He will increase them from His bounty. God provides for whomever He wills without reckoning.39. As for those who disbelieve, their works are like a mirage in a desert. The thirsty assumes it is to be water. Until, when he has reached it, he finds it to be nothing, but there he finds God, Who settles his account in full. God is swift in reckoning.", "people say it is their choices,  it is no choice it is whom they are.", "3:04 My respect for them 📈📈📈📈", "תודה קורי, כקוקסינלית שחיה פה אני מאוד מעריךה את הסרטונים שלך. תמשיך לקרב בין א.נשים 💜", "I can't even watch it.", "Complete Jewish Bible ✡ [Mark 2:16-17] When the Torah-teachers and the P’rushim saw that he was eating with sinners and tax-collectors, they said to his talmidim, “Why does he eat with tax-collectors and sinners?” But, hearing the question, Yeshua answered them, “The ones who need a doctor aren’t the healthy but the sick. I didn’t come to call the ‘righteous’ but sinners!”", "Somehow you found all of the most polite and respectful people among us...Wow.", "They really need to use Corey Gil to solve the conflict between the Arabs and Israel.Corey you're the man!", "I sometimes wonder why nobody talks of the discrimination of the LGBT in Gaza/West Bank and how life for them must be seeing their neighbours in Israel being proud, joyous, accepted !", "Identity politics.. nonsense", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "Sad to see Israelis so Americanized. Without religious Jews Israel is no Israel.", "If people ask ,why not? If people force you , like canadians , then of course not.", "Jesus>>>>>>Muhammad😎", "Please keep these rubbish questions off of the channel."]}, "F9V_7oyyYsw": {"title": "Israelis: Is international media biased against Israel?", "top_level_comments": ["One thing I can say about Corey....he seems fair honest and objective ( ok that was three)...he even keeps the idiotic responses without censoring, which may cometa the expense of one side or the other", "\"All the Europeans side with Palestinians\" False. Some do some dont", "Corey you must work on your vocabulary and pronunciation since half the Israelis can't understand you", "''It doesn't depends on reality, it depends on what we want it to be''", "RT(Russia Television) news calls Jews in Iran the largest Jewish diaspora beyond Israel because Jews are originally from the land.", "I think most of internationals don't really care about the situation going on between Palestinians and Israelis. They have their own problems to deal with or they don't like getting involved in something that isn't affecting their territory.", "👍👍👍", "I can say the brazilian midia is.", "Why do you always make the conclusion on the road ? I’m terrified for you", "Of course they are nothing new here. They are bias for though ( positive) if the news is coming from the west. The USA is not in tbe middle unfortunately. They are always favoring Israel which is an issue.", "5:38 truth spoken", "In 1967 arab countries wants to wipe up Israel.", "When it comes to science, technology, engineering, education, the economy and the like I would judge international media coverage as very positive.  On the other hand, when it comes to relations with Palestinians coverage is very negative.  The media meets the limited attention span of its users and fails to explain why things happen differently in Israel from elsewhere.  Having said this, I wouldn't say that coverage of the Palestinian side is positive either, particularly on the political side.  Not surprisingly, given the face they put to the world - a leadership in Gaza that is avowedly terrorist, and a leadership in Ramallah that used to be devoted to terror as a policy tool.  It's hard to put a positive spin on that.The Palestinian side also suffers from being an integral part of the Arab world, and therefore associated with all the political and economic chaos that seems to be so endemic.  The \"Arab Spring\" was a rare time of positive news, and look how that all turned out!Apart from this, the only ongoing positive media coverage I can think of concerns the cuisine of the Arab world, but again that is tempered by multiple wars/refugee crisis/poverty etc.  Modern Arab science, technology, engineering don't even make it to the media at all.  Excessive devotion to Allah and religion is often presented as a cultural quirk peculiar to the region rather than a positive.", "‘Maybe they think you are arrogant, boastful?’ 😆", "“ we dont know why they dont like us, because the entire world says”", "Depends where they could get alot of audience and moneys.", "As we see, it is mostly against Israel", "“ Old city is Palestinians everyone says “ and the others “ i dont follow international media “", "Can't you for once interview people who are at least of average intelligence?", "Yes, but only cause of the erav rav, if real ones were in charge everyone would be crying that they couldn’t give enough to Israel", "Regardless of the topic...social media has two faces. Just like the coin. Two faces but same value .same reality. Same case.", "we really dont care what the international media thinks of us, lol", "So basically some Israelis simply don't know and those who claim to know seem not to actually read or view the international media. Jews may have arrived in Israel with sophisticated world views through personal experience, but it looks a though their descendants brought up inside Israel may have lost that. They appear to have essentially internal Israeli reference points.", "Well the bible does say that the world will come against israel in the last days before Jesus returns. So its possible we are right near that point. Get yourself ready.", "ohhh man seriously you asked some people which is really making jews look arrogant and retarded , they are answering not regardless to the question and their answers is horrible .ok according to the guy who said \"we are the smartest they are jelious\" its a stupid comment . yes , we got some really smart people and we are trying to educate people to the best and jews always tried to out-smart enemies because we were always out-numbered . so its kind of based on that i belive but its really stupid comment to say .me as a jew , i know that , we are not better then anyone , we are not worse then anyone , we are all equal .when people speak about jelious also they kinda relate it to we have jerusalem and lots of holly places for the christians too and maybe more religions smaller too .there is nations that wants jerusalem , that dont want us to have jerusalem etc ..", "LORD JESUS (YESHUA) WIN ON CROSS FOR US 🙏 (Isaiah 53) , (Psalms 22) , (Zechariah 12 : 10) ! Read BIBLE 📖 .", "Whoever amongst you sees an evil,he must change it with his hand;if he is unable to do so,then with his tongue;and if he is unable to do so,then with his heart;and that is the weakest form of faith.", "More good then evil in this world,that's why", "Yes very negative MSM.", "Arab also semitic peaple", "Birth place of Jesus Christ", "GOD Have a SON (Proverbs 30 : 4) , (Psalms 2) , (Isaiah 9 : 6-7) ! THANK YOU YESHUA ❤️ .", "I feel like the news media in the USA is for Israel not against based on what I see 🤷🏼‍♀️", "disconnected from reality and heavily indoctrinated to the extent of delusions about how they behave", "What is this the smartest question of all time?", "A Blessed Shavuah Tov To All Am Yisroel And Friends Of Zion \"The Guardian of Israel neither slumbers nor sleeps \"Psalms 121", "The problem with the media is that majority of journalists are uneducated and often simply silly people. \"Uneducated\" - I don't mean in journalism but overall, in general, like in geography, history, foreign languages, specific cultural oddities, etc. Without such knowledge it is impossible to give correct information. Besides Palestinians (or Arabs in general) give them very restrictive assess, so they don't have much material to report. However newspapers and TV's require from them such reports. Therefore  they have to make something up or to find something wrong on the Israeli side to fill the gap. It is also much easier for the same amount of money. Why do they need to do extra work? There are also certain stereotypes, clichés accepted by the conformists who are too lazy to think for themselves, fascist, communist and socialist ideologies, personal experience as well as old and still thriving anti-Semitism. Combination of all these factors creates distorted and untruthful picture which is presented by the media to its audience. Very sad and disturbing fact.", "It doesn't help to ignore international laws.", "just be honest and say your project is to try to make the occupants look good\r\rI hope this occupation falls as hard as who finances them and by your accent, you are one of those.", "2:46 HAHAHAHAHAHAHAHAHIMAGINE that way of thought being a problem; for anyone, anywhere, anytime across History. 🤡", "LORD JESUS IS ETERNAL WORD OF GOD In Flesh (Isaiah 9 : 6-7) , (Micah 5 : 2) ! ONLY WAY TO HEAVEN 🙏 (Daniel 7 : 13-14) .", "the kind of old man said ''all europeans are against israel''i say ''european media aren't though''", "I’m an American Christian. Yes I know how original. But I support Palestinian. At least the people’s lives. I don’t care what either are fighting for. I don’t think lives should be lost and homes should be taken from people.", "A good story is a good story.A story about, \"yeah, but look, this side did this, but then again that side did that, because they feel that they should do these things\" is too complicated a story to tell.", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "Jews are the smartest people(only because of the puppet America) ! 🤣🤣", "i doubt that the girl in 5:18 would claim the same nowadays", "I'm dying laughing at those poorminded people.😂😂🤣", "Because initiates every problem.", "Corey the media like you are afraid to ask the Arabs hard questions", "Of course it is.  If you even have to ask, you haven't been paying attention.", "\"Because we Jews, are the smartest people. Everyone is jealous of us.\"", "Guys at 5:26 are the average Israeli in every comments section, especially in Quora and on this channel", "You have to understand how media works. They chase ratings... there are 1.6 billion muslims and all the best too them. I love my muslim subscribers. However theres only about 20 million jews, so if you're a news outlet, and your chasing views, which side are you gonna take? This is looking at it from a purely statistical standpoint.", "I like how at least the first few people in the video don't know and apparently don't even care what the international media thinks about Israel, just like they shouldn't. I am sure they have more pressing matters in their daily lives, than thinking what some people thousands of miles from them might think about them. What does it matter anyway what Colombians think about Israel? They are more concerned when Hamas will start another rocket attack towards Israel.From my own perspective, as an European non-jew, I can say that most media at least in my home country is mostly biased against Israel, and are more leaned to pro-palestinian. It might not be very strong, but it is still obvious, like they seem to feel Israel is more to blame for the conflict, and palestinians are (mostly) just helpless victims that Israel is oppressing all the time.The reason is political and partly historical. The press here is mostly left-wing, and left wing people here tend to always see USA as something that should be opposed, especially in the 70s or so when Soviet Union, to these left-wingers, was supposed to be some kind of heaven for humans. USA bad, Soviet Union good.So, because USA always supported Israel while Soviet Union supported arabs and palestinians, the left wingers \"hated\" also Israel. They opposed Israel mainly due to the USA support, and that's the only logical explanation.Even though Soviet Union is no more, the bias against Israel (due to USA) has continued to this day. That's why the leftist here also seem to be very pro-islam, which is kinda weird when you see e.g. a left-winger feminist whining about \"patriarchy\" but at the same time feeling passionate about islam and muslims. Such contradictions...", "1:22 So who have been for years being sent to fight your wars, sir? The Mongolians?", "International media isn't all the same. Some is biased and some isn't.", "I’ve been watching this channel for a few years, at fist I thought the Palestinians looked bad, but the longer this Chanel went on on the more Israel was in the news, the more the Israelis look bad on this Chanel and less the Palestinians. This despite Corey being an Israeli.", "With all respect Israelis are naive to be a westerner tool instead they can be the heart of this area just imagine an Israeli chocolate factory selling chocolate to 500 millions people while now barley selling it to 7 millions .. but this peace and cooperation need real prove to erase a bad history of Israeli agression embedded in the collectif mind of arabs.. and if it happens this area can lead the world and be a great example for others to learn.", "mainstream media in USA is mostly pro israel it seems. younger lefty culture is not and supports palestine. I spent a month in Israel and palestine, and i decided overall im pro israel as well. Doesn't mean they dont make mistakes...", "LORD JESUS ❤️ YESHUA ❤️ Is The KING 👑 Of The JEWS (Isaiah 53) !", "I've seen half a dozen protests against Israel. I've never seen a protest against Saudi Arabia. Their war in Yemen led to more than 30k child casualties. There is mass starvation going on right now. Nobody on the political left could care less. I've heard people accuse Israel of racism. I have never heard Sudan accused of racism, despite ending the lives of 0.5 million black people.", "We have to differentiate media and social media. Media can obviously be biased. It all depends on the media itself, its agenda, its journalists, etc. But there are several checks and balances to prevent that. However, SOCIAL media is ALWAYS biased and should never be trusted, as it is not even its primary purpose, and there are absolutely no checks and controls whatsoever. Any moron has access to it. Social media is truly the greatest evil of the 21st century.", "International media is not biased but cruel towards those non Muslims who once upon a time victim of Islamic extremists", "LORD JESUS Is the Last and PERFECT Sacrifice for this world (Jeremiah 31 : 31) ! YESHUA IS MESSIAH (Zechariah 14 : 4) !", "Comment if you're a Palæstinian Christian☦✝️Let's ensure our voice gets heard👍", "🖖🏻 Long Live Israel! 😇", "I find it scummy as fuck  that the question was about Israel, not jews, and the answers were all about countries being against jews. The question (x country), to anyone outside of Israel, would seem be asking about the state.", "YEP! 🕍 Of 👹", "As a Muslim I love Jews and Christian people.", "The answer is \"yes\", but the weird part is that international-media is mainly owned by Jewish descendants, at least in Europe and the USA", "Brainwashed  indeed!", "In France, almost all the medias, the BBC in the UK", "The answer is yes of course ask olim!!!", "\"that there is ALSO anti-semitism there\" in America, France, Italy.  Did you mean ALSO as in Israel? Yeap, that's exactly what she thought.", "When Israelis have created a state from scratch, and turned it into a leader in science, technology, education and human development, of course it's going to be portrayed negatively by those who have totally failed to do likewise.", "🇮🇱=Big 💥", "No one said, \"Yes they are biased, because of religion.\" That's sort of a surprise. Without religion and dogma, how would people \"know\" who they are \"supposed\" to hate? #BlameReligion", "*God is shaking the Heavens and the Earth. Jesus Christ is about to return to rapture the Church.**Focus on eternity and your relationship with God through Jesus Christ. Ask Jesus to forgive you of all of your sins and He will, and you will have eternal life in Heaven.**Don't miss your chance~🙏👑🕊️*", "‏Is Israel really a neighbor?  And she has conscience?! and it has a sentry?!i🤣🤣🤣🤣🤣🤣🤣", "I stand with İsrail and Jewish friends.❤", "\"Because we Jews, are the smartest people. Everyone is jealous of us\"... LMAO", "It's actually biased to israels favour", "Eat more Ben and Jerry's ice cream", "7:26 girl is right", "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "Haters gonna hate .. Am Yisrael Chai ! 🕎✡", "those poor lost souls... I hope soon, the jewish comunitty of Israel can convert their society into a health sociaty.", "#🇵🇸🇵🇸🇵🇸", "When you occupy a whole nation and kill thousands of its civilians you wont get that much of an appreciation around the world, won't you", "Brasil supports Palestine 🇧🇷🇵🇸", "This girl was in Austria and says that people are more positive about jews and israel? She surley wasnt in Australia? Cant confirm her claim and i know what i speak about. Lets not speak about the big demonstrations from islamists after ther 11 day confrontation recently in Vienna", "On this day in 2002, Marek Edelman, a leader of the heroic 1943 Jewish uprising in Warsaw against the Nazis wrote a solidarity letter to fellow resistance fighters in Gaza, addressed to \"Commanders of the Palestinian...so much for Zio hasbara", "🇵🇰♥️🇮🇱", "6:48 No, it's because you've stolen that land, and you're imprisoning and murdering its people", "*GOD PROMISED*me a car in bible so now I am gonna steal it", "Ask palestians who is worst between Benjamin Netanyahu and Naftali Bennett.", "#freepalästina", "Around the river, ocean and the sea... Israel will be free. :)"]}, "ug6lOmPvVRI": {"title": "Religious Israelis: If biblical figures never existed are you still Jews?", "top_level_comments": ["The three falafels part made me cry. Of laughter. 🤣", "I think many of us believe in whatever our family's religion is without proof, it's like a tradition.", "The extra-biblical archaeological finds, the 9th Century BCE Mesha Stele, and the Tel Dan Stele, mention biblical figures King Omri (1 Kings 16:16-30) and the House of David (1 Samuel 16:13) respectively.\r\rThe Mesha Stele is housed at the Louvre in Paris, France, and the Tel Dan Stele is at the Israel Museum.", "Sad to say its the material world that most people worship", "The guy at the 3rd minute was very honest and thoughtfull.", "Wish the guy at 3:00 had his own channel. I love hearing him speak.", "The easiest answer would be to say that while these Religious Figures, Patriarchs and Prophets may be either fictional or a composite ideal of a number of real historical human beings - that doesn't invalidate the message and instructions from the Torah.  The Patriarchs and Prophets may be dead - but the Ideas and Message of the Torah is alive within every observant Jew - or even Christian and Muslim.The famous Rabbi Hillel even told a potential convert that the message of the Torah could be summarized while standing on one foot:  'What is Hateful to you, Do NOT do to your Neighbor. All the rest is Commentary. Go and Study'.", "I sometimes feel like Corey should use a translator with Israelis as well lol, cuz I feel like he sometimes doesn’t know how to articulate the question in Hebrew the best way and then when he asks the question comes out weird and kinda sets ppl off and they can get a bit weirded out and might get mad esp on religious questions…. It’s not what you say, it’s how you say it😅", "Well there is archaeological evidence for some biblical figures mentioned in the Bible. like King Hezikiah, and many of the Kings of both Judah and Israel. There has also recently found the seals of people mentioned in the Bible that aren’t kings like Natan HaMelech.", "second guy couldn't even stand his world being questioned for 3 seconds lol", "A very good video. But it tells us what we already know- traditional believers are followers. They follow a tradition without questioning it. Followers' mentality doesn't allow one to question. But, if I was one, I would counter Corey with: So, you construct a fiction (time machine) in order to prove we believe in fictions. But your very premise is wrong. Why would I seriously consider responding to an impossible fiction, like, for instance, how would men be called, as parents, if men could give birth? Fiction of that type doesn't deserve an answer.", "If you discover one day that Santa Claus is not real, will you still stay Cristian? French? Human?", "Some questions are absurd but also highly philosophical and, as usual, there are some very intelligent answers. What would happen if I found out that my grandmother was infertile? - Would I exist?", "Yes of course, Judea was both a sovereign and a vassal state with clear geographical destination and ethnicity, religion, culture, language, so even if we remove the patriarchs from the equation and move on from the biblical narratives, there was still a Judea (and Samaria/Israel), therefore there was Jews.", "The question wasn't delivered properly. Oral tradition passed down creates dramas and heroic journeys out to of ordinary but important moments in history.", "you know loki is a fictional character?!🤣🤣🤣🤣🤣🤣🤣", "Let's say you going back in time to the time of creation, and you see that God didn't create the world. Would you still believe that the world exists? This is the kind of question you're asking. Rambam rights if he seizes there is no world, and if world ceases God still exists.", "The guy at 0:53 had the best answer", "Zeus didn't exist. Are greeks no greeks anymore?", "Hi Corey, I hope your people and you excel.", "Guy at 6:20 nailed it 😂", "Great job Corey! Always interesting to check out your channel, keep it up!", "\"I see God everyday, and I'm not a fanatic\" lol", "some people said that Jerusalem temples (David and Salomon) never existed in the har abahit, some even said that jews and judaism had nothing to do with the land of Israel (they call it palestine) BUT, theses same people had no proof that a plastinian people belong on this land as a nation more than 50 years ago :)))) \"a land with no people, for a people with no land\" was right and true, definitly", "This was a very stupid and useless question to ask", "6:15 What he says really gets me by the balls in its potential implications:  (can't speak on the patriarchs but...) if there is no kernel of historical truth about Moses/Exodus, if you think about it, then the whole of ALL the Abrahamic faiths comes tottering down.  What is Rabbinic Judaism, the Christianity that's close to my heart and my neighbor's Islam if Moses and his Exodus was a pure fabrication?  That's why I think its so important to emphasize why the historicity of the Exodus needs to be dated w/corroborating extra-biblical sources:  Josephus is right about the Hyksos being the Hebrews!  People who blithely dismiss Moses as unmerited mythology, since it did not happen 3 Millenia ago when we know nothin happened, are so dangerous in undermining the tradition.  Not hair splitting here:  Hebrew-Exodus / Hyksos-Expulsion was 1500 BCE, three and A HALF Millenia ago.  Bucket loads of archeological evidence that Levant originating Semites w/Golden Calf (Baal-zephon) predilections were there for centuries until they're expulsion.  Schima Jacobovivich Exodus Decoded.", "If I found out they were never existed it could make me more sckeptical about my religion, but I still am a jewish person. And jewish in Israel don't know much about christianity and islam but that these religions say judaism is true (but irrelevant, 'old statement'), so I was also sckeptical about christianity and islam. (Make it clear: I'm not religious, but grow up in such an enviroment and 'lost my faith' in judaism - so also christianity and islam is not for me).", "This Question isn't a real question it's just turned in a way to say that these biblical figures never exist to delegitimize Judaism and presence of Jews in Israel typical Now please go ask that stupid question to Muslims about Muhammad let's see how they treat you", "I wonder why no one has asked Corey the same question in return ? 😏", "what is the premise of the question, is Judaism a historical religion or spiritual?", "Very nice video.", "Y’all don’t make me laugh", "So how is that standing not superstitious?", "That's kind of like asking if the founding fathers of the United States like George Washington and Benjamin Franklin didn't exist, would Americans still uphold their values.It's not the historical existence of these people that matters, but the narrative, the story and the values.Holding tradition, religious beliefs and values based on historicity misses the point. It's akin to attempting to scientifically prove the existence of god.", "The God of the Hebrews Ahayah Ashar Ahayah said let my people go the children of light", "Seems like it was an easy question for them to avoid but an ice-breaker for interviewee to: defend their opinion, mystical faith and last but not least, boast of long held social issue traditions. Over all, good question, good video, 🎥🍿 thanks ask project !", "Fact not FictionJewishness / JudaismIs a nationality ( only )Just like any other nations  or sect.", "If we found out there was no prophets then still the message of God came down somehow for this guy is able to ask these questions about Abraham, Isaac, or Moses and they were the ambassadors of Him. We can question everything. Names, the past etc. But who we believe in is not bound or locked in time. He is time! And everything else. So this question was kind of contradictory.", "Great question! I grew up believing that those people did exist. Not anymore. There is no archeological evidence whatsoever that the Israelites were ever slaves in Egypt, for instance. Quite the opposite, in fact. Plus the scriptures are full of historical inconsistencies. Scholars now believe that the texts in the Tenach were first written a few centuries before the Babylonian exile and during the exile.", "when i visited israel there is two locations in Jerusalem where jesus was either buried, or his tomb was placed. Some say the garden tomb, others its the church of the holy sepulchre. People dont even know this basic info, its still disputed! Nobody knows anything, and all the religious stuff is purely belief. There isnt even evidence of jesus's existence at all", "The Kingdom of Judah and the Kingdom of Israel are two different kingdoms that were rivals, it is impossible to be a Jew and a son of Israel, or a son of Israel who calls himself a Jew.The Torah  is just a book that someone wrote, from an anthropological and historical archeological point of view, was in the area of ​​Canaan and many other kingdoms, There are maps and findings, In the Kingdom of Judah and the Kingdom of Israel there were idolaters and they believed in statues, they did not believe in a Torah book written after many years, the Jews in the Kingdom of Judah and Israelis in the Kingdom of Israel were idolatersAll religions before the Montaist religions and belief in one God, were idolaters and believed in statues and worshiped the earth, and their God was not in sky,", "The old woman,she wants speak more and more because all 12 kids leave us alone 😂😂 ..the question in direction and the answer in another direction.", "let me answer the question that no one of them dared to answer itif I found out that biblical figures never existed simply I won't be a Muslim anymore.", "I am really surprised by how many people answered that they would still believe in Judaism", "The question doesn’t make sense. It’s like asking a fish out of the water if it would still be a swimmer. There’s no concept of swimming, and no fish, if there’s no water.", "The reason why Jews believe in the Torah is because there is proof that G-d wrote it.So if I see something that I originally didn’t think I would it wouldn’t change the fact that the proof that G-d wrote the Torah and wants me to do X,Y,Z is still solid.", "Silly and thoughtless question once more to challenge the Jewish people's  authenticity as a people and ultimately to undermine our rights to Eretz Yisroel.", "Hard But the religions come  most from the judaísm", "What a crazy question ? You can ask the same to all religious about God existence", "I believe in God because I don’t buy a “big-bang” just randomly occurred from absolutely nothing. Matter is a electrical charges arranged in a very complex manner, see the E8 figure, and it required an enormous amount of energy and precision to arrange the charges in such a manner. 1st law of thermodynamics, where did the initial energy come from? I accept there may be a natural answer above our understanding, but I find intelligent design to be a much more convincing explanation. Something from nothing, or something from something?", "Jews are descendants of Abraham, Isaac, and Jacob (and the lawful converts that ultimately marry into the Jewish nation), additionally a Jew express this heritage , by living in accordance to the beliefs taught by the forefathers and later prophets/sages that lived in accordance to Torah.", "We believe in God, doesn't matter of somebody exist or not..", "😆😆😆😆 Good question!!!!", "0:45 MY MAN✌🏽🤣🥀♥️", "many of people actually doesn't realise question. the said \"if there\"!!my opinion is there any actual proof aur authentic hundred percent proof that religion is false some Misleading  history..I Don't  problem to escape my faith....we have to free thinker.we should keep or maintain  always free mind  to acknowledge or accept the truth if the truth is against me.", "what kind of question is this? What is the point?", "with out those stories \" stories\" the belief would not be what it is,  if my grand mother was not whom she was i would not be whom i am .", "it's the message, not the messenger", "Hopeless question", "*\"If I don't steal your house then someone else will\"*Yaqub an Israeli Settler from NEW YORK USA", "Shocked no one has commented on the last lady's bizarre response bragging about her \"army\" kids, etc. Corey you should have been like wtf does your family and feelings about arabs have to do with the question?", "Its a bit like asking if your parents didn't exist are you still their child?", "Three falafels?", "If British people somehow discovered Harry Potter wasn't actually real, would they still be British?", "God bless all good people and those who believe in him. Btw I didnt find this question logical.", "Do you believe the current Ashkenazi Jews that occupy Israel are from the lineage of Shem?", "Religion is amazing. Even with undisputed proof, that they observed through time travel, their faith can’t be shaken. For an atheist this is really confusing.", "Only Zios and antisemites conflates Judaism with Zionism. It’s hard to tell the difference.", "Many religious people can't even understand the assumption that what they believe might be wrong, think about it, atheists perfectly understand the question \"what if God was real?\"", "Your question makes no sense. It's like asking someone. What if yhe knowledge from every book you ever learned is a lie, are you smart or dumb? It's so unrealistic, and the torah is not based exactly but the poeple basically invented the religion. Yehudi comes from Yehuda so if Yehuda didn't exist we would be called something else but we would still have our belief system", "Kingdom of Judah was established in 930 BCWhile Palestine already called a \"Pelesheth\" by ancient egypt starting from 1150 BC.Even Philistines in Philistia already exist during Abraham's era (Genesis 21:22-27)", "LORD JESUS ❤️ YESHUA ❤️ Is The KING 👑 Of The JEWS (Isaiah 53) !", "8:20 Three bars is a sargeant, in some armies anyway.", "7:21 lol", "Adam , Ibrahim , Moses , Jesus (Issa) and Mohammad PBUH are ALL Muslims There is nothing in Islam that says moses were a jew ! .Period.", "How you know they are fuked up? By their flafel wrap i mean rank. Bruh flafel rank? Lol", "What if Jesus came back as a black man?What if my mother was a transgender? Then I would be adopted or my father is same sex lover. She loved him so much that she changed for him. What if ConQuest by Christianity was created to fool the world to colonize the Israelites and make them worship Jesus (a man instead of the Almighty )and call themselves something they are not; only to have someone else take up their identity, their customs and tradition, as well as their birth right?", "I'd need more clarification on the question. If the forefathers didn't exist but they were still in the Torah? I'd think the entire existance and basis of Judaism wouldn't exist if they weren't real. We would just believe whatever would be taught to us from the Torah and characters that replaced those prophets.", "I believe in Time Travel and Pantheism, but in general, Time Travel defeats all dualistic theologies. So even if I find that Abraham, Moses, Isaac, Jacob, Jesus, etc existed, I would still believe in Pantheism and make them believe in it too. Albert Einstein believed in Time Travel and was a Pantheist. But we can still believe in a Modified version of God (not dualistic as in Abrahamic religions), even if Time Travel to the past was possible.", "They don't understand the question", "It’s irrelevant whether they existed or not.  Jesus according to the Jews and Muslims existed but they don’t believe he was the son of god.  For me as an atheist , there might well have been an Moses Abraham , David (probably not an Adam and Eve which imo is a creation myth) but did God appear to them and work through them, I think that is an unlikely as God working through Mohammed as presented in the Koran.  Imo the Jewish faith represented the values and priorities and concerns of people at the time, who, like most of the rest of humanity,  were interpreting the world around them through the lens of it all being controlled by a deity or deities and themselves the centre of the universe.  Clearly ritualistic religions like Islam and Judaism are deeply woven into people from birth and forms their community, so to conceive a life without it is impossible for them  an they clearly don’t want to consider the possibility they’re wrong.", "Lol, the children of esau and Japheth, desperately still convincing themselves of their own invention.The tribe of judah is black. Til the end of the world", "I have read the Torah story in the original language and Abrahams's seed The Ishmaelites and Israelites Midianites are Black people. I also read the ancient tablets that the Torah story came from the Enuma Elish and the Gilgamesh tablets, and more. I do not follow any of the Abraham cults, Judaism, christism, and Islamism. I find the question about Jews strange.", "Who was ignorant enough to submit this question? Regardless of whether or not you believe in the deity of Christ, his existence isn't contested. If a man that we worship as God existed, surly the secondary characters from scripture existed as well. Their existence doesn't effect the deity of our creator. Why would the existence of secondary characters in scripture, effect whether or not people decide to worship? If manufacturers lied about the features or efficiency of their products, would you believe it existed? Umm...Interesting how he worded the question, by skirting around the questions intent. Why not just ask, \"If the Bible/Torah was proven a lie, would you still practice your religion?\"", "Humans can be irrational.", "JESUS CHRIST ❤️ YESHUA ❤️ The LIVING GOD (Isaiah 9 : 6-7) !", "It doesn't matter if they were fictional or historical real people, it really doesn't. We also have no historical evidence for Socrates - he may have been a fictional character. But he still impacted the world in a big way. Cultural and literary heritage are real, regardless of the historicity of individuals mentioned in the traditions.", "I am the first to comment here...I believe jews feels offended when ask them such a question.  Because they're proud of their ethnicity.", "/watch?v=fj4POLkTqJY*FIRST EVER ORTHODOX VS. MESSIANIC THE GREAT DEBATE IN HEBREW! with ENGLISH SUBTITLES**(Rabbi Chaim Shitrit, Head of Kollel! VS. Dr. Eitan Bar, Dallas Theological Seminary)*הדיבייט הגדול = הרב חיים שטרית (ראש כולל!) מול יהודי משיחי ד\"ר איתן בר - על סמכותה ומקורה של התורה שבעל-פה של הרבנים", "There was no religion back then. There were no jews. You could only belive in god maybe", "Time flies so fast i know you now more accept Islamic Concept than other concept 😎Am i right ? 😅", "This is a dumb question its like asking muslims if you go back in time and Mohammed didn’t exist would you still be Muslim? Of coarse not since he started Islam. Abraham Isaac and Israel gave birth to the the Israelites/Jews if it wasnt for them then we wouldn’t exist not even Christianity since Jesus the Messiah was Jewish.", "god exists and help as cuz her son is hight rang in army and kill defenseless palestynian that make rly sens", "Biblical figures in my language MalayalamAdhamNohaAbrahamIsahakYakobOusephBenyameenMosheDhaweedhSolomonEliyasIshaya", "1- The Children of Israel disobeyed God, and this is clear from the current Torah and the Holy Qur’an2-And as the current Torah shows that Moses, peace be upon him, does not trust his people, so he put the Torah in the Ark of the Covenant as a witness against them. If they deviate from the truth, they are supposed to be the best generation because they were witnesses to the greatness of God and the miracles that His servants Moses and Aaron did. Peace be upon both of them, but the people worshiped the calf after that and committed sins more than once3-Moses, peace be upon him, marveled at the great disobedience of the Children of Israel and said, How will you do after my death?4- Then someone comes and says I trust the current Torah because my father told me and my grandfather told my father and so on5- And when God Almighty saw that the Children of Israel made mistakes and forgave them if they repented and sent them prophets to direct them, but every time they repeat the mistakes and kill their prophets6- And they followed their whims and their rabbis who, if they say, “Jump into the Fire,” they would have done so. So they left the one who studies the Torah at a beginner level, while the one who studies the Book of Rabbis (the Talmud) at an advanced level who was falsely attributed to the Torah.7-And when God wanted to have mercy on them and give them a last chance to follow Muhammad, peace and blessings be upon him, who came with a book in which there is no doubt, confirming the Torah and denying the lies that were placed in it, telling the true events of the events and excluding the prophets from moral defects such as lying, making idols and drinking alcohol, they rejected that and preferred blindness to guidance.8-Nothing will harm God if people do not follow His religion which He has approved for them. He has the kingdom of the heavens and the earth and in the Hereafter. Whoever does not believe in what God has revealed will be among the companions of Hell. God wants to forgive His servants only if they believe and follow the prophet whose description they find in the Torah (a prophet like Moses)", "The point of the question is, does it matter if the books are fictitious or real. For example, you could start a religion off of Harry Potter or sci-fi (Scientology). At the end of the day religious people are atheists because they dont believe in 99.9% of religions. I think extant religions and mythologies all have stories with good lessons. But to say one is true and the other is false is arrogance.", "These are jews, why is he asking them about the Bible?Also what is the difference between jew and jewish?", "If you believe in god, open the gates to Gaza, tear down the walls, let them live with you, share everything with people from Gaza. If you believe everything will be fine. No?Choose them and they choose you. Amen", "Well, this was an eyeopener! They are so irrational. They really can't comprehend the question or the repercussions of the premise."]}, "zbTaUqAl2Ck": {"title": "Jewish Settlers: Isn't it immoral to live in West Bank settlements?", "top_level_comments": ["Kudos to Corey for having the courage to ask thorny questions in a land of conflict. I think too many people take it for granted, not contributing in any way but harshly criticizing his style. I find that attitude extremely shameless.", "It's like some of  the  settlers learn to Prepare made up reasonings for themselves as they grow older, cause the younger one's  reasonings are basically meaningless!!", "people often give corey shit for being aggressive with palestinians but he was just as forward with the jews in this episode", "When you say it wasn't theirs make sure to give back America to real Americans as well as Australia", "There's some real shamelessness going on here.", "Make a t-shirt saying “Lama Lō?”", "I believe God gave me the wealth and money of all my neighbors, now I am going to take it from them by force to prove my godly point. Brilliant.", "Wow, this is an amazing question--they're all so very uncomfortable being asked it!Update : except toward the end. LOL", "This could be hours long & I'd STILL watch it.Actually, would be great to see that if possible?", "Even Israel's own Supreme Court (let alone the International community ) regards the occupation as illegal. Labour member of parliament, Yossi Sarid, expressed concern: 'Resistance breeds repression, which strengthens resistance, thus unleashing more repression, and one day we Israelis will look at ourselves in the mirror and be unable to bear the cruel and repulsive image reflected in it. We want not only to liberate Palestinlians from military domination but also to liberate ourselves from its \reffects.\"", "This is one of the best Corey videos dude.  He was asking questions in a pressing way and did not back down.  And actually confronted the Israeli settlers.", "Thanks for the Gaslighting.   I'm going back to the hospital to reclaim skin taken away from me at birth", "At some Point The Mongols were spread trough all of the Russian territory can they claim this land theirs now ?", "Their eyes says everything", "👏🔥🙏", "Wow Corey, I always felt that you are soft on Israelis but you proved me wrong. You went in on them.", "\"If it is not tempered by compassion, and empathy, reason can lead men and women into a moral void.”[Karen Armstrong,Twelve Steps to a Compassionate Life]", "So by the people's logic in this video,  all mankind possess the right to claim a land in Africa because our ancestors once lived in there then had migrated all over the world. Thus it is totally moral to kick a Kenyan farmer out of his land and settle down.", "Back when I first started watching Corey's videos, they seemed more like a debate than an interview. I believe an interviewer should correct misinformation, but allow the person they are asking to share their opinions without turning it into a debate. I think it's good to have back and forth style videos, but sometimes I just want to simply hear what the opinion of interviewees. That being said, I still enjoy his videos and think that he does a great job.", "They are trying hard to convince themselves,For their actions.Tatakae Tatakae Fight fight Freedom for Palestine 🇵🇸", "Hi I really love all your videos and I have questions im really interested to hear the answers to I would really appreciate it if you would want to use them in your future projects! Question to Palestinians: if you could go back in time to 1948 would you prefer to agree to Partition plan and Establish a country in the lands the UN gave you? Or would you still prefer to go to a war so all the land will be yours?For the Arab Israelis who served/serving in the IDF: what your family and your friends think about you serving in the IDF? Are there was sometimes problems with it? Are you feel equally to the Jews who serving with you?", "If I will become jew, my question is, should I go there and claim that god promised this land to us,Do you think israelis will accept my reasoning and lete live there?", "it will be an embarassing moment for me, the day i have to awnser GOD for my life. but it helps me to know, this goes for everyone. good luck!", "\"2000 years we were here\" , dude ! , You do realize that you was born less than a 100 years ago right !!!??", "your destiny is very obvious to us, and you even proved it for us, so carry on", "6:31 Pakistanis are NOT Arabs, they use the Arabic script, but speak Urdu. Not all Muslims are Arabs, just like nit all Arabs are Muslim.  That’s be like lumping me, a English-speaking person from the US, in with Italians cause the script I use is Latin and we are both Christian-majority countries.", "\"No one is going anywhere, we are all stuck here. We must find a way to live together \".", "The West Bank was part of the 1948 land allocation of Modern Israel. It was stolen by Jordan in the war of that year and illegally annexed. In 1967 it was liberated from the tyranny of Islamic occupation", "2:50مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ", "1:22 perfect example of cognitive dissonance lol", "New question. ……. Do you believe in life outside earth? If so, if not, why?", "if someone feels unable to answer will say simply i am not a political", "When was the last time a thief admitted she was a thief ?", "Ok, I'm halfway in.One question. How can you return to a land/property that WAS yours & then reclaim it?If someone here was honest & said/says \"look, it's a war,ok?... and we're winning\", then I would understand this ( not agree, understand ).", "In the 21st century I would assume it is already ok for Jews to live wherever they want, especially in their original homeland, but I guess if people still asking questions like this one, then \"Judenrein\" is still a possibility in this time and age... Just sad!", "It is written, \"It's our land..\" lol 🤣😂", "Love is unconditional. Try not to let fear, hatred or darkness enter our hearts. Take care. Lots of love. 💖", "Good luck in hereafter 👍", "Ceate one land for all inhabitants called Peacerael (Palestine, Israel, Peace), all citizens have equal rights.", "Israel is an apartheid state. Most of those people in the video know this. Terrible situation.", "Why do they believe \"God gave the  land ( of Palestine) to the Jewish people\" and seek to deny the Palestinian claims but no other ethnic people in the world make similar claims. The pope doesn't  say God gave the Christians Rome, Vishna does not say \"God gave India to the Indians\" . The most they can say is historically as an ethnic group or civilisation that they had lived in this area for an extended duration and have an affiliation or identification with the region , just like the Italian people have a greater affiliation to Italy than the French.But to claim the land was given to them by God is a bit of an (unprovable) stretch.", "Does any people who have some rusty coins in another country have the right to go there and kick out the natives ? Does the modern world accept that logic?", "She literally said “how many Jewish homes were taken by Germany”. So she’s basically saying if hitler did it to us why can’t we do it to the Palestinians.", "The answer is a simple YES.", "One thing I have to give it to the Israelis: they can answer this sensitive question with calm but conviction, regardless the answer is agreeable or not.", "The guy at 4:00 isn’t correct. Jews weren’t the majority but there were always a minority presence in the land. I don’t agree with the action of building settlements in the WB", "Imaginary landlord in the sky gave it to us. No need to watch the video really.", "Genesis 17:8, G-D gave the holly land to Abraham and his descendants. The descendants of Abraham are Isaac and Ishmael. Ishmael is the father of Arabs...so G-D gave the holly land to Arabs too, not only Hebrews.", "'I'm wearing a kippah!'", "they just bought the land with gun and tank", "6:57 - 9:00 holy moly. Ignorant AND dangerous.", "hey corey can you go to sheikh jarrah and do some questions there as well", "The girl that stated Arabs are what?  If she's claiming to be a jew, decendant of Isaac, Ishmael was his brother.  With that said, Arabs are your genealogical brothers..., but then again I argue with own my blood brothers, but never to this extent.", "When  in germamy  take jew home this is immoral ...but when jew settlers take palestinian home this not immoral!!!Who is crazy?", "As far as I’m aware most settlements are built in Jewish owned land or state land It is illegal by Israeli law to build Settlements in Arab/Palestinian private lands (international law considers all of the settlements illegal)And they are required to get an authorization of the defense minister in addition to the rest of the required documents authorization to a regular building", "Yakub disliked this video.", "Lol that guy said “every case”", "Israeli settlements are not in violation of international law. The 4th Geneva Conv. theory has been debunked because everyone knows there was never a Palestinian state & there were no tranfers of populations. Just because a lie is repeated a thousand times, it doesn't make it true.", "Watching this, never been more happy that I don't live my life by a children's book, like these people do(both/all sides). Quoting passages that are convenient as literal, and claiming brutal passages are just figurative/misinterpreted. Good luck to both sides because you'll need it!", "when you are part of the majority, anything will be accepted and \"morally\" justified in order to maintain that position of superiority and dominance. We live in times when morals and ethics are elastic, the end justifies the means. Israel is the apex of this .", "1st one was a former Olympic mental gymnast.", "It is truly staggering how insane some of these people are and to what lengths they go to twist the words to fit their narrative.The woman @ 7:20, insane!", "Don't worry UN isn't watching you", "what a good reason to say the land is yours \"  is written in bible\" :))", "11:05إِنَّ هَٰذَا الْقُرْآنَ يَقُصُّ عَلَىٰ بَنِي إِسْرَائِيلَ أَكْثَرَ الَّذِي هُمْ فِيهِ يَخْتَلِفُونَplease, read your book first!! before giving your review about another 🥀♥️😂", "Thanks Corey!Could you ask the same question to Non-Settler Jewish Israelis please? :)SPOILER - I think it is immoral for Israelis to live in the West Bank. :P", "It takes the strongest people to admit their wrong doings , But the voice of peace must the loudest", "Hey Muslims used to pray towards Jerusalem first and then Mecca. Clear in the Quran...the Ethiopian guy doesn't know what he's talking about.", "I can see it’s a very difficult question", "the title should be changed to 'The face of fascism'", "11:06 smash them! My man !", "at this rhythm we will have to restore the crusades god... what do zionists have in their minds when answering?", "In the name of Allah The Most Gracious, The Most Merciful to the believers,All praise and gratitude is for Allah,Peace be upon the one who follows the clear path. I invite to the true religion of our creator the creator of the heavens and the earth. Allah is One. The only one who is independent, all-powerful and Unique. Allah has no sons and no daughters our creator is the most high. Nothing and no one is worshiped in truth except Allah. Allah is eternal and in need of no one, we (the creation) are dependent on Allah The one who sent the prophets with the message: Only worship Allah, and do not worship any false gods/goddesses. The prophet Muhammed peace be upon him is the last prophet of Allah.Interpretation of the meaning of the Original Quran91:9/10Surely the one who purifies it (the soul) (from sins) will prosper.And surely the one who corrupts her (by sins) will lose.2:256There is no compulsion in religionThere are those who tell lies about Allah. The Truth has come and falsehood has vanished. Falsehood is surely bound to vanish. The truth is found in the Quran and the authentic hadith (in Unique Arabic). Allah preserved his messages. There is only 1 Quran and not a letter has changed,  And the sayings of the prophet (pbuh) are also preserved.Www.Quran.nl", "It doesn't make any sense to claim my ancestors or people of my nation lived there 2 or 3 thousands years ago so now this land belongs to me and my nation. This stupidity has to end. Are we people with conscience?", "Never realized settlers have  unibrows", "12:45, the dude said that there is no notion of Jerusalem in the Quran, just to later say that in the original religion of Islam, the jews are the eternal people. Sounds contradictory.", "I recognize the right of people to self determination but in this case the only propose of it is to delegitimize the state of Israel.", "Israelis: What do you think of Turkey joining the EU? I figure you can ask questions where the heat is off once in a while.", "There are already 2 Palestinian states (3 if you include Jordan, but we need it to remain stable  & ruled by the Hashemites) Gaza & Areas A &  B. They have full autonomy & those under PA control have passports & vote for Parliament. In Area C there are about 60,000 Arabs who are mostly friendly to Israelis. This area will eventually be annexed & they will be given citizenship.", "Deep down inside they know they were wrong and I can scenes that...", "God is a state agent 🕵️‍♂️", "7:07 good answer", "\"if i don't steal your house , someone else is gonna steal it \" Jacob the Brooklyn jew  Mai 2021Replying to the 2nd man who said that we bought the lands , fool someone else buddy", "Why do we care so much about Israel and Palestine while there is Myanmar in Crisis ?", "question for israelis: Why do israelis put their religion first and humanity second? why is inhumane treatment  being justified by religion?", "True history\rThe Roman general Pompey conquered Syria and Israel in 63 BCSome of the Jews rebelled against it,\r there was a people who invaded the Land of Israel even before the people of Israel left Egypt,\r the name of this people was \"Plishtim\" it is also written in the Bible.This people became extinct when\r the Romans conquered the Land of Israel.The name \"Plishtim\" In Hebrew/\"Paleshtina\" In Roman   Palestine?\r  This is a name that the Romans called the Land of Israel, to humiliate the people of Israel\rThey also called Jerusalem \"iIlya Capitolina\" and also the city \"shchem\" mentioned in the Bible, \rcalled it \"Niapolis\" .The biggest lie is Palestine. The name Palestine was called by the Romans when\r there was a Jewish majority in the Land of Israel.The Romans called it so in order to despise the Jews.\rThe name \"shchem \"  mentioned in the Bible is also called \"Niapolis\" . The Arabs call it \"nables\" \r. Because they do not pronounce the letter \"p\".There has never been a people called \"Palestinians\".\rThey all invaded Israel from Syria, Jordan, Egypt, Lebanon and more\r ...In Israel in Gaza and in Judea and Samaria there are families whose name is \"Al-Masri\" which means \"Egyptian\" in Arabic.\r The \"Halabi\" family means from the city of \"halab\" in Syria, and other such names that\r surely understand that they came from outside the Land of Israel, especially when Nebuchadnezzar\r king of Babylon exiled most of the people of Israel to Babylon (so it is written in the Bible)\r.There is no Palestinian nation, there has never been such a people, The terrorist Yasser Arafat decided\r to call it that in 1948To get public sympathy. ask who was the Prime Minister of Palestine ?! \rYou will never find.Who were her ministers?Where was the king's palace?The president's house?\rThe Prime Minister's house?Where was Parliament?What's her coin ?! Even if you ask every Arab in the\r world that he claims to be \"Palestinian\", what does the name \"Palestine\" mean ?! He does not know .\rThere is no such thing and there was not. Everyone who digs in the ground finds coins of the people of Israel,\r inscriptions, jewelry, graves, coffins, and more ...There is nothing and they have not found anything that belongs\r to a people called \"Palestine\".This is the reality, and whoever thinks otherwise has to prove it. The Arabs / Muslims\r have conquered the whole area.While the people of Israel were exiled from their land by the Romans.It is written in\r the Bible that the people of Israel will return to their land. And here after 2000 years as promised in the Bible\r, he returned to his country from all over the world,Everyone who kept his Judaism for 2000 years came to this country. \rThere are German Jews, Roman Jews, Austrian Jews, Egyptians, Yemenis, Moroccans, Tunisians, Algerians, French, \rSwedes and more ....And he who does not understand then I am sorry for him ... especially if he is a Muslim\r, because in the Qur'an it is written that this land belongs to the people of the book. (Bible)", "Kudos to Corey thinking Pakistanis are Arabs! I have never seen a people more ignorant of the lands surrounding them than Israelis.", "If winning wars was the real criterion for property, then all the countries colonized by Britain and France would accept it,  but they resisted and got their freedom, and some were exterminated like the Native Americans, and the same justice can apply to citizens if it is the reference. Anyone can steal land or a house or kill someone else as long as you have the power!! This is the law of the jungle, not the law of God or even false international law.", "It is very important to have Judea & Samaria for Israel's survival. The Palestinians need to be given some type of status within the country.", "Why jewish change noun mahammadim (muhammad){song of soloman} into a verb", "12:48 person talk on logic", "I like the girl at the end", "الالمان قتلوkم فما ذنبنا نحن", "don't forget that before 1947 jews were living in this aera too, jordan's expel jews in 1949 until israel free the land in 1967, and at this time, it was not question of palestine or palestinian people", "God bless you Corey. Wonderful unbiased work. Shalom.", "Is the second guy mizrahi? His Hebrew has an Arabic accent", "Native tribes in America need to reclaim this entire country.  The proof, they were actually here when it was taken.", "“It’s just ours” or “our bible says it’s ours”.Do they understand how reductive and immature that sounds? If a Palestinian says the same thing are you not just as bad as they are? Why should I believe you and not him?They also seem to get way more offended by questions than the arabs which is weird.It is interesting how the settlers blame Israeli policies as much as Palestinian though.", "Palestine is the name the romans gave to the land of Israel after conquering it from the Judeans."]}, "FmU2ef1bli0": {"title": "Religious Israelis: Why aren't converts to Judaism treated well?", "top_level_comments": ["The second man has a very beautiful heart. God bless him and his family❤", "The 2nd guy nailed it - the problem is not the Torah Commandment, the problem is with some people's pre-conceived notions or reflexive tribalism.", "More people like the second person will decrease hate in the world. Very reasonable and kind.", "Being Jewish is a combination of traditions passed on from generation to generation. Traditions that encompass celebrations, food, customs etc. and  it transcends religion so to speak. The religious beliefs are only a part of it and the origin. You can be an atheist, but if you were born within that community you're still Jewish. So, it's kind of normal (I am not saying it's right) that if you're not born into all this, it might be hard for the others to consider you part of their group. Being Jewish is not merely being part of a religion, but part of an ethnicity. I haven't met too many converts to Judaism, but with the few that I have, I've noticed that they talk about being Jewish all the time. They tend to be very right wing and so pro  Israel. I feel it's a way of trying to prove their \"Jewishness\" and also to seek acceptance and the sense of belonging. Actually I've noticed that tendency among the few converts to Islam that I know.", "It is amazing the beautiful similarity between the religious teaching of the Jewish and Muslim laws.The last Rabbi expresses the prohibition of reminding the reformed sinner or convert of their previous life.This is true in Islam too.  As a Muslim convert I love the goodness in this man's speach and I wish for him goodness. We as Muslims are always welcoming and celebrating converts.May Allah guide us all to the the truth and make us brothers in this life and the next.", "That second guy is wise.", "Asenath, Rehab, and Ruth are biblical converts who did a lot for Judaism. I was brought up to give converts that extra love.", "The second guy with the beard has that good point", "Converts to Judaism are fully and truly Jewish, only if they are sincere.Hillel the Old and Onkelos the translator were converts.Blessed be them!", "As a Muslim I respect all religions. ☪️☪️❤️❤️", "Man, that second guy, he is not far from the kingdom of God.", "Good information Corey. I especially like the fact that the last man emphasized that it says 36 times in the Torah to treat converts well. I hope that helps the person that asked the question. Somebody else commented that orthodox in the United States are cut up into groups. From what I understand, this is very true. They follow this rebbe or that rebbe. And it is very hard to get accepted into any group at all", "Everyone I know that has converted is very accepted and loved.Maybe the people that are like the person asking the question are super shy or just more reserved and don't make an effort to join in with others, get involved in doing things with others such as charity work, etc. A person shouldn’t be too self centered and expect people to always come to you, It's important to reach out, think of others and what you can do with them and for them.", "I think the trouble starts when there are different standards of conversion. My conversion took 4 years and I have had no problems with acceptance. I used to be very religious and now I’m not and I’m still accepted. I live in South Africa", "lmao anyone who doesnt treat a Jewish convert right Cleary doesn't pray amidah and reads it properly", "It's strictly prohibited in Judaism to treat a convert any differently. The Torah strictly warns against doing it. It's a very big sin.", "When it comes to the world of investing,most people don't know where to start.fortunately,great investors of the past and present can provide us with guidance", "Exquisite stuff Corey 🌟!", "Oh, Corey, I love you so much! Thank you so much for you!", "I think those kind of problems of acceptance are common in the Diaspora. I've seen and heard such stories of discrimination against converts. But in Israel it is not at all like that. I know many converts and whole families, and they are all accepted with love. I can't say anything about the Haredi society bc I'm not part of it, but among Religious Jews and even Secular Jews here in Israel, converts are very well received.", "Matthew 22:38-40You shall love the Lord your God with all your heart, all your mind and all your strength. And love your neighbor as yourself.All the law and the prophets hang on these two commandments.", "So if the person is NOT a convert to Judaism then it’s normal to not like them.?", "All people interviewed were humane and kind. Wonderful interviews!", "The bible specifically states multiple times to make sure to treat converts like everyone else. Anyone in this video who says anything contrary is misinformed.", "Sometimes because of the color of their skin , however haredim usually remember when moshe took an african wife and how bad comments were made by aaron and his spouse and how elohim responded , no racism ,love thy neighbor as you love thy self", "those that don't see the reality of the way things are like that lady, will never understand the problems of the world we live in, they are the kind to deny their crimes", "I love these videos. As a suggestion for those who watch these in order to improve their Hebrew, would it be possible to paste the question in Hebrew in the comments?", "The real question is, why do Jews treat each other so badly? The common denominator is that people are treated badly, and someone from the outside group will feel that there is negativity towards them, when in reality, there are so many groups of Jews who treat other groups of Jews so terribly as well. People are suspicious of outsiders, even of people within their own groups who act differently. But we're supposed to go out of our way to make other Gerim feel comfortable, so while I understand that on the level of human nature, it's understandable, there's really no excuse to treat converts poorly.Now, on the question of who is a convert: converting to Judaism isn't converting to a religion. It's converting to a peoplehood. You can't snap your fingers and convert to Indian, or Chinese. The same with Judaism. You have to undergo the full process. All things real take time, and it's usually clear that when someone undergoes a reform \"conversion\" it usually doesn't last, or becomes something unrecognizable. It's not hard to see why - reform is basically the modern day version of Christianity. Someone who converts via reform is not Jewish. They have converted to the religion of whatever reform \"Judaism\" is. This is the truth, even though it might hurt for some. Now, someone who converts via the correct route may become non-religious, but they are still Jewish, and are now fully responsible for all the sins they transgress, and the mitzvos they keep. That's why conversions should never be taken lightly.", "You should ask converts what the reasons are. I'm a convert and I have lots to say. I really think fake converts really contribute a lot to this phenomenon when they convert deceptively without intention to keep mitzvot. Because of this some people are suspicious of converts in general because they don't know if this particular one is sincere or not.Having said that, dati leumi society in general is super welcoming to gerim while charedim have all sorts of stigmas. They will accept halachic converts in their communities for technical purposes but they will only have them make shidduchim with divorcees, baalei tshuva, nebbechs or other converts", "I like how he tries to tell the Orthodox I Jews that that's your traditionwhen there's only one tradition like he said they invented that the reforms they make their own rules", "Loved the 2nd and last persons reply.  Not sure if its not a loaded question. But hey , its not corey who will get the flack . Its israelis.", "The problem is many converts don't accept the totality of Judaism. Very often they're not taught the culture and rabbinic laws that apply. Because of this some of them are seen as outsiders. There's also the issue of converting for marriage like Ivanka Trump.", "That man @1:34 Love him! He's the same kind of jew, that my mum is as a muslim. Very open minded yet religiously observant himself. I wish more people would be open like that!", "Barruch Hashem ..I converted 🕎🔯", "The man at 1:00 said a mistake about the Israelites who left Egypt.\rThe children of Israel did not convert, because they are the children of Jacob, therefore they were always called the children of Israel after the name of Jacob who was also named Israel.\rThe reason it says \"you were living in the land of Egypt\" refers to a person living in a certain place.\rThe Israelites received a place of residence from the Egyptians, so they are called Gerim.", "Judging by what Israelis say conversion is seldom a problem if it’s done correctly. As a result most react according to the Torah and are accepting. Maybe the problem is with Jewish Americans who are reflecting the general level of intolerance in American society.", "Man at 1.11: Absolutely correct", "Once I can afford to I would love to sponsor you...obviously as a believer in god I would love you to come back to that belief because Jews and Muslims believe in the one true god... but at least I can feel that you are sincere about the way you want to challenge people ... because I can understand why people find it hard to follow religion when the leaders and people that outwardly look practicing do not follow the rules of the books they believe in", "Depending on the community:*racism, which does exist, particularly heavily in the Ashkenazi world*jealousy, because many converts have experienced things many of the \"street\" would like to but feel ashamed about. Natural urges and curiosities about things like bacon and shrimp and the like.*politics, because some communities believe you must vote who you're told for.*rabbinic politics, because some rabbis are disliked by other rabbis and the followers expand that further.*money, because in some communities there is a lot of money and social welfare and they jealously guard it against potential usurpers....*grumpy old folks that hate to acknowledge that their young people are leaving or that they didn't produce enough young people to maintain a strong community@Corey, your Hebrew seems to have declined. You've become much less.....fluid..in speech. I would recommend practicing or writing down 2-3 different ways of wording the question's general idea since most sabras  get impatient with non-fluent speech.", "The issues with reform Judaism only came about because in the US the reform conversions went a little crazy in just rubber stamping conversions mostly for the purpose of marriage.", "It happens with a conversion. Some religion let the converts be killed and some let it go. It is all how much a community really believes the true message.", "I don't know who the guy asking the questions at the end was, but he was very pushy.", "Second man is great 👍", "2:30 woooooow he didn’t watch the last episode 🤣🤣🤣 beautiful mind though 🥀💔😭", "I do wish Corey would check out in advance the Hebrew vocabulary he'll need for each of the questions he takes with him.  Instead of winging it, a simple crib sheet would do.It's painful listening to him struggle to find the same words again and again.", "I love your channel. Good work.", "How do they even know they're descendants from the Isreaelites to begin with?Many of them might have been converts too at one point.", "Leviticus 19:34 The foreigner residing among you must be treated as your native-born. Love them as yourself, for you were foreigners in Egypt. I am the LORD your God.Revelation 7:3-83“Do not harm the land or the sea or the trees until we put a seal on the foreheads of the servants of our God.” 4Then I heard the number of those who were sealed: 144,000 from all the tribes of Israel.5From the tribe of Judah 12,000 were sealed,from the tribe of Reuben 12,000,from the tribe of Gad 12,000,6from the tribe of Asher 12,000,from the tribe of Naphtali 12,000,from the tribe of Manasseh 12,000,7from the tribe of Simeon 12,000,from the tribe of Levi 12,000,from the tribe of Issachar 12,000,8from the tribe of Zebulun 12,000,from the tribe of Joseph 12,000,from the tribe of Benjamin 12,000.", "It's amazing to think anyone could not get through the whole orthodox conversion, which generally takes a few years, and not notice before final conversion any negative attitudes they might find difficult.Having through orthodox conversion there may be an adjustment problem with individuals and communities who don't meet the stringent requirements of Jewish law, or perhaps a tendency to lecture about how things should be done.", "All I know from this is that converting to Judaism is like a Russian going to China.  Except for the whole \"VAT? VAT YOU SAY? NOW I CRUSH YOU!!!!\"", "The second guy answered amaizingly", "Imho, #2 got the 2 thumbs up 👍🏻👍🏻", "DISHONEST question. You ask Israelis about US & Canada. Reform conversions.", "Never experienced this problem myself. In Israeli society, I'm usually looked upon first as an American then, the \"Ger\" part as an extra bonus explanation for being crazy enough to leave behind the American dream.", "I did an orthodox haredi conversion and it was HELL on another level.  You can expect the most satanic abuse imaginable. Im so glad its over. Remember, while they are praying, Hashem is laughing at them. It's the most rotten group you will ever meet. You have God on your side. Keep following mitzvahs and don't look back.", "Can't think of another religious people where this question would even make sense as converts are looked upon very highly in other faith communities.", "As  a reform jew I would accept a person who has converted to reform, conservative or orthodox Judaism.", "the biggest problem is whent he pupies left the building in 2:11. It looks like the owner of the building never did anything to keep it in a good shape. Anytime they try to explain why on earth they never reach the top of that massive building, they were received with lots of harshness. But the little girl in 3:14 made me sad but at the same time made me laugh too. I like the bow, but she shouldn' t run after the dog unless it was washed the day before. Anyways good job for sharing this crucial information. Keep up the good work.", "Converts actually have higher soul level. Instead of being born by default into a religious family and taking on their habits without making any choice or effort, the convert experiences an exile and then returns. Hope this helps.", "Jesus of Nazareth is the Christ!He is the Messiah of the prophecies.", "Tell this guy from America to come to Israel and then he can be accepted.", "Now I realized that even jews have separation among themselves...", "The person who asked this question is a Messianic Jew. He is just a Christian trying to infiltrate.", "Question Suggestion To Muslims:If you believe that non-Palestinian born Jews should go back to where they came from, do you believe that non-Palestinian born muslims that immigrated from other countries after 1948 should go back to where they came from?", "A convert is basically a naturalized person. And usually, naturalized people are never treated as 100% \" real\" people from the group. You would have the same problem anywhere on earth among all humans. It's like being a stepson. Yes, the law says you are a real son, but the people have prejudices. It's bad I know, but you just can't avoid it with a certain %% of people.", "Corey you should have asked the question about arab converts black converts and white converts", "I was waiting for a complete honest answer, but it seems that there werent any. So i will add to what have been said:1. The jewish community is a very closed one, so for example you wouldn't find alot of culture differences in the community. And we know its harder to join a closed community.2. The religion is mainly for the descendants of israel, and the messages were mainly sent to them.   Thats why you wont find many jewish preachers, and because of that you wont find alot of converts or welcoming to the converts.  less converts = less acceptance, beacuse its Unfamiliar in the community.3. There are alot of gruops inside the community, and every group has its rabbi. And every rabbi has different opnions. So somtimes there is no acceptance within the community itself.4. Converting is a very long and strict proccess, thats why they will always have doubts about the convert doing it the \"right\" way.", "you should be clearer in who you are referring toobservant jews do not consider those who convert through conservative/reform sects to be jews and therefore do not feel that they are covered under the commandment that one has to love the convertand then we have many who claim to be converts, who actually arent", "My mom was a convert and she had no issues.", "The messiah enters the world through the loins of a gentile woman who converted, namely, Ruth.", "@0:51 best answer", "If the motive is to please the creator why would someone value other people's approval?", "The Orthodox Jew at the end with the curly hair is sooo cute :D lol :P", "How you going to asked them how they feel about converts and they are converts themselves", "2:20 a very honest racist accordingly to the creator of the word (Trotsky) itself. :D\"Not because we don't know if it's a good or a bad person\", he honestly said himself.", "10:11 don't eat from the Fruit of the Tree :Dstay blind.", "מקבלים את הגרים. זו מצווה. הטענה היא שחלק מאלו שהתגיירו, זה בכאילו, הם לא באמת קיבלו את דרישות היהדות.", "Corey with all what's going on. Why are you using these unimportant questions. Can you ask some more insightful questions about the present. For bith sides now?", "In other relegions there is only conversion and than acceptance but Judaism is so complex. Why is that?", "What is the Messiah‘s name ?Isaiah 12:22 Surely God is my YESHUA\u2028I will trust and not be afraid.\u2028The Lord, the Lord himself, is my strength and my defense he has become my YESHUA”", "The second guy was actually the first guy.", "I wonder if the second person feels the same about those who believe Yeshua is the Messiah. Many \"Christians\" today hate Jews, but Yeshua NEVER taught that. Paul didn't either.  There are millions of believers who live Jewish people.", "Corey,The simple answer to the question is that Jews don't always live up to the standards demanded of them in the Torah. You could also ask why there are religious Jews who gamble and curse. Same situation. Any justification is excuse making.", "if someone convert from atheis to jews, is he accepted?", "1:11 man isx100% right", "Who is the messiah ?Proverbs 30:44 Who has gone up to heaven and come down? Whose hands have gathered up the wind?Who has wrapped up the waters in a cloak?Who has established all the ends of the earth?What is his name, and what is the name of his son? Surely you know!", "Where are all these converts to Judaism?", "Interesting", "Converts to judaism aren`t treated well because they cannot trace their lineage back to the ancient Israelites.", "Yet they all look different", "Get another with this, 2 lots of sub titles that move quickly. Very difficult to read & keep up! Only good if you understand Hebrew", "Why would anyone convert to Judaism anyway  it’s like the oldest OS. Would you use windows 95 in 2021?", "Please ask Palestinians: Why did the PA reject Pfizer vaccine exchange with Israel, even though they could still use them for two weeks (most of them at least a month)?", "I'm a convert and so far I never had any negative experience from within the Jewish community. I'm not trying to say it doesn't happen, but I always hear about how Jews don't accept Jewish converts but only as a prejudice. I never had any such experiences myself, not have I ever met any convert to have had such experiences. So I disagree with the question, because it suggest that it's a given that that's how converts are treated, and I'm afraid it's also used against the Jewish community to suggest there is no acceptance of \"outsiders\". The question should be: are converts treated differently/negatively and if yes, why? I just dislike the statement in the question as it is", "Isaiah 9:66 For to us a child is born,to us a son is given,and the government will be on his shoulders.And he will be called Wonderful Counselor, Mighty God,Everlasting Father, Prince of Peace.", "That s very racist - not to accept a convert ( except for stigmas)", "8:56 وَمِن قَوْمِ مُوسَىٰ أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ♥️🥀", "The last human being who were being interviewed. Had an interesting reasoning about how the holy scriptures of Judaism. Proclaims that a non-Jew who started to study and to a certain degree practice the Jewish faith. Shall not be reminded about past sins. I just wonder and I think a skilled rabbi could answer this question, how do modern day religious Jews reconcile that religious mans statement with the concept of monotheistic past original sin.", "\"If the home of the Hereafter with Allah/Creator is indeed exclusively for you and not for others,of Mankind,then wish/long for death if you are truthful.\"           Holy Quran 2:94", "Judaism ✡️ has become a religion based on race"]}, "4dPoDb81OiI": {"title": "Israeli Soldiers: Do you hate Palestinians?", "top_level_comments": ["Beautiful video. Peace will come one day.", "Question idea:Q: If you (an Israeli) were born as a Palestinian, how would you feel about the occupation?And same question to Palestinians but reversed", "It’s insane that most of the interaction Israelis have with Palestinians is during their military service. If they had more civil interaction maybe things would be better.", "Corey you improved yourself at being more neutral and you ask the tough questions and are more calm now. Good job", "A more open-ended question would have been better.\"What do you think of Palestinians?\"", "אחי אתה עושה עבודת קודש הלוואי שכל החיילים שלנו יסיימו שירות בשלום", "Ask, \"How do you define terrorism\" to both israelis and palestinians.", "Hate and violence are never the answer. Peace from Israel 🇮🇱 🇵🇸.  For any Palestinians that might read this - both of us were born into this conflict without much choice. And the truth is that both of us, Israelis and Palestinians, are going nowhere. So what's the point of the endless fighting? I wish for a better future for us all.", "Soldiers dont fight because they hate whats infront of them, they fight because they love what is behind them.", "\"It's not soldier who starts a war. It is politicians.\"", "Host: “ do you hate palestinians? “Soldier: “ no “Host: “ did you encounter violence? From them? “Soldier: “ Yeah, it’s part of the Job “", "Palestinians and jews not hating each other or even being best friends:Media: *we dont do that here*", "Light would come one day no matter how dark the night is,let’s hope things turn better❤️", "Your channel is really amazing brother! I love how you let both sides say their opinions unfiltered. It really gives a much more detailed and complex perspective to the conflict! Would love to come visit such a melting pot of cultures one day!", "This is such a beautiful video. Thank you for doing this great project. Bless you", "5:45 best and most accurate answer!! I do believe it reflects the israeli population PERFECTLY", "0:15 the guy said it very well..He sounds like a really good person at all, cheers to him..", "Thanks Corey! this clip was so interesting to watch, as always.Just pointing out in case it hasn't been done yet - That last interviewee, who was somewhat unintelligible, was saying: \"They're poor, no one likes to be poor\".Which he probably states as his reason for not hating Palestinians (it's akin to the argument that \"Palestinians act the way they do because they're dirt poor and feel out of options\").", "Thank you for spreading awareness of these things, so many places on the internet where it's black and white and every side is depicted with absolute hate and no nuance.", "Genuine answers. Soldiers  hate only terrorism.", "The man at 1.44,  was asked if he hated Palestinians, and he replied No, and why? We are all created in G-ds image. What a mensch!", "when people get to know one another in decent environs they can understand one another, when you can understand one another the door is open for love and peace. the politicians work daily to make sure this does not occur. what a shame. great video.", "This reflects our community more accuratelly then media who wants escalation for clicks.At least in my circle of friends thats how we are.Not hateful and hoping for peace.But this doesnt get a million views while hateful vids do, shame.", "This channel, which I find wonderful, shows how complex is this conflict. But peace with surrounding countries will help the situation.", "Anyone notice how , conpared to the \" how much do you hate Israel \" video, who spreads more hatred?", "Thank you for this video !!!!!! Greetings from Spain", "Second Army guy at West Bank check point is a good man. He blurts out his positive mind.", "One of the best and most important videos Corey has ever made. The amount of views speaks for itself.", "\"We shall overcome someday, Oh, deep in my heart, I do believe, We shall overcome someday...\"", "When he said minorities at 3:46, he meant the minority of Palestinians who don't want peace with Israel, not the minority in Israel who are Palestinian. Stuff like that are what makes people think all Israeli soldiers hate Palestinians", "You pushed them to the point of reaction.....TRUTH!!", "Man, that second solider at the check point, humanity level set to 💯… and his voice rings true.", "Love the work you do. Keep it up brother", "מעריך את זה שאתה לא חותך תשובות, ולא עושה עריכות מגמתיות.", "Seems like a too blunt of a question with too much on the line for a straight answer.", "I really want to know your own take on this Corey", "Watching the videos on this channel make both sides look better to me.", "If their answers are sincere and they aren't just doing it for the camera, then i think we are heading towards a better place.", "I discovered your channel recently. What an amazing job you do. Wonderful people like you will one day solve the hate prblem on both sides and make people understand that they are all human regardless of the irrelevant race and religious differences. I am donating. Greetings from Tunisia.", "Good video.Let's ask Jacob why the police did not stop you when you wanted to steal the woman's house??", "I watched dozens of your videos in the last days and my conclusions are: (i) palestinians and israelis have much more simmilarities than differences. (ii) this conflict will never end while one side is alive.", "I hope someday there will be peace, brotherhood and unity.", "The guard at the Settlement has a good ideology", "I cried when I heard some of their statements its true they are all human beings and I cant stand that political movements control public opinions and brainwash people into hating each other. Humanity must win", "One question I'd really like you to aks both Israelis and Palastinians is \"what does 'zionism' mean to you?\"", "There were some great answers", "Israelis are all filled with love!! ❤️", "Corey Gil, at 4:58-5:01 that soldier's face is expose. Be careful you don't want him to get into any trouble or put a target on his back.", "Shalom&Salam for All!", "0:23 His answer felt very genuine to me. Different forms of violence and crime exist in every community. Small acts can and will lead to better circumstances. However, I don't quite trust those who claim that they don't hate Palestinians while also saying they've **NEVER** seen any other soldier have hate for Palestinians. It's simply not realistic. There's always a percentage of a population that has racist ideologies, whether it's 60% of soldiers... 50%, 30%... but it's never 0%. That doesn't ring honest.", "We are all human beings at the end of the day, we all have emotions and feelings and are more alike then different. It’s sad that we can’t get to know one another without having preconceived notions of one another. That’s how we would ever have peace, is if we listen more instead of always assuming the other is a bad guy and talking. Listen more.", "I am always curious.. How does the owner of this channel looks like. And like finally i saw his face at the end of the video 😁😳 Your voice is really soothing to hear. You should be a DJ too😜😜👍", "The second guy is a great person, god bless him", "A wise man once said your words doesn't represent what you think, your actions dose", "If you dont hate , so just stop war ,stop attack its a best way.., respect each other as humanity..thank you💚💚", "Please ask them y did they not stop Jacob when he was stealing some ones house.", "went back and watched a lot of your old videos from 3/4 years ago its interesting how peoples opinions change and how wording became more aggressive over time", "I really Want peace in this region For both. Side they are wonderful people", "\"I was just following orders\".  - those two that refused clearly didn't want their commanders to hear the answer.What maybe you should ask is \"Why do soldiers are shown in videos allowing settlers to be violent with Palestinians and they (soldiers) do nothing\"", "As usual, lets give Corey credit for doing these videos going around and asking people. That being said, it does not really matter at all whether the IDF soldiers hate the Palestinians or not. What matters is that they follow orders and would shoot civilians, as they have done always, regardless of personal feelings. Orders are orders and the soldiers will follow. That is the nature of war and it is understandable that the Palestinians hate them for that.", "Very refreshing if they are answering truthfully.", "This is just emotional for me, I am Palestinian, from Hebron, or the original name Khalil, never visited or went to Palestine, it sucks seeing other illegal settler occupiers or illegal forces stepping on your own land and you’re not, and I am a refugee, so my grandfather went to Jordan 😔", "Thanks for doing this man. I really hope one day I could travel to the land without consequence or worrying about my safety.Make the whole land one secular government with no religious or ethnic bias. No evictions. Stamp down any violence. Help restore destroyed communities. Everyone winsI'm gonna get comments saying it's a pipe dream but bro do you really think that a two state solution will solve the problem? People will keep fighting over the land. 2 state solution is like a king Solomon compromise. No one will be happy with it.", "I just found your channel and realized we have the same last name!  Very interesting project 😉", "I pray for all of us to get out of darkness and see our brothers, 7.8 billion of them through the light and to overcome fear and arrogance soon in Jesus name. Amen. God gave us unlimited power to enjoy life, unfortunately we chose the ego/ mind fabricated world to ceaselessly fight over material objects, land, and all things we live behind before we even start enjoying them.Learn what hate means,, then you wouldn't do it.. God bless all.  Love you💕💕💕", "Most of our problems can be solved.But we rely on politicians to solve our problems.", "Good job!", "Hate may make it easier, but you don't need hate to pull a trigger.  You only need a few ounces of force and a willingness to follow orders.", "Corey asked Palestinians same question sometime ago because he wasn't pleased with some of the answers. The interviewees faces were partially blurred. Here the blur didn't even flicker. You know those Palestinian interviewees could be in trouble now considering the situation in Israel.", "👏🏽👏🏽👏🏽", "stop war, stop violence. Love and Peace from 🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩🇮🇩", "If you ever go back into the West Bank, ask the Palestinians their opinions on China's treatment of the Uighurs", "Thanks lot s for sharing this very interesting video brother 👍❤🧡💚👌", "I really love that army❣️", "I have no interest in this type of video,  Where the Israeli army is systematically portrayed as the most tolerant army, and the Palestinians as fierce.", "I watched a few of this guy's videos and I really like that he is able to gain access and ask real people questions, but the dude is confrontational as hell.  His mannerisms and responses are almost the same as clickbait.  No answer is sufficient and he has something to say or some noise to make.", "You censored them but we still can see some of their face 😂", "Its weird how IDF soldiers seem more humans than the politicians", "You can know there answers by there actions", "As a human being we all have love and caring feeling blessed by god . The political and few top people greed made us fight each other..", "It would be interesting to hear from the Egyptian soldiers that are also blocading Gaza to see if they hate Palestinians too.Why do they also have a blocade there too?", "Corey, please ask people on both sides what they think about the Gaza strip being occupied by UN blue helmets!", "Btw love your channel bro. Been following you for quite long now", "Thank you for this. A message to soldiers in the idf:I support all members of the idf...1. In protecting the survival of Israel. 2. Putting up with unwarranted abuse and insults from various people. 3. Always remaining professional and kind 4. Please stay safe and happy.5. and survive.", "I Love 🇮🇱 &🇵🇸I like all about israel because I know world change become modern like now cause Intelligence israel person. GOD BLESS ISRAEL", "This needs to be broadcasted", "0:15 and 5:36 soldiers were the best", "Excellent food for thought", "Could've done a better job w/ the blurring but meh. I appreciate seeing these Q&As and hope that people continue feeling comfortable enough being candid and honest", "These videos are interesting but painful.... this violence will never end", "I don't know what is the goal of your work but some videos you did are really interesting.", "It will be a different story if the interview is live and broadcasted only  in the soldiers homeland TV station...", "First soldier is so kind..😍❤", "Soldier : “we cannot answer this question”. You : “ why not?”  You’ve some balls for sure!", "i love this video", "I would believe the second guy because he opened up, but those who were like \"no\" bruh... anyone with half brain knows they have to say that because it's on camera. Real life shows different imagery.", "Actions speak louder than words my friend", "Soldier number 2 gives me hope.", "Oh Allah; The One, The Absolute, The Eternal, The Master of the Day of Recompense, The Most Gracious, The Beneficent, The Ever Compassionate, The Most Merciful, The Giver of Life, The Inflictor of Death, The Illustrious, The Magnificent, The Sovereign, The Ever Pardoning, The Just One, The Light, The Illuminator, The Incomparable Originator, The Relenting, The Holy One, The Forbearing, The Patient, The Source of Peace and Perfection, Guardian of Faith, Preserver of safety, The Irresistible, The Supreme, The Mighty, The Wise, You are ancient having no beginning and Everlasting having no end, You are The Creator of the heavens and the earth, The Creator of everything that once begun to exist. I beg You Allah, by every name that belongs to You, by every name You have taught to Your creations, by every  name You have kept in the knowledge of the unseen, help our brothers and sisters in Palestine to be free!! Ya Rabb!! Help every oppressed against their oppressors, everywhere!! Ya Rabb!!", "I appreciate very much the work you're doing in opening a conversation between real people.My wife and I thought about what question we'd like to ask and came up with this: What do you want Palestinian/Israeli children of the next generation to understand about Israel/Palestinian life?We wanted to ask a question that promotes change, and acknowledges the perspective of both sides, without focusing on the past but instead looking toward the future. What better way to do that than to remind everyone that our children are the future, and what we show them today is what they practice tomorrowThank you again for doing this and I wish you the best continuing with this project."]}, "ff4gEL3lH0s": {"title": "Israelis: If the conflict is solved what do you expect to receive?", "top_level_comments": ["6:10 He said \"khayalim shenoflim\" which translate to soldiers that are falling and means death of soldiers and not immoral soldiers", "Hope you and your Arabic translator are safe during these times of high tension. Thank you fo ryour good work for peace and dialogue.", "6:11 you translated as immoral soldiers. He didn’t say that. He said “fallen soldiers”. Big difference in translation.", "It is almost like all the negative stuff you hear about Israel and Israelis in the social media is not true!!", "I see the young people on both sides have less rigid views. They sound more accepting of each other. Maybe this is the hope.", "It is good to see that people want peace <3", "I don't know of your political views and I don't care, you are a very polite and professional person. You do a very good job by asking these questions and sometimes in order to educate you must ask only a question rather than provide an answer. ✌️🇵🇸🇵🇸🇵🇸", "6:09 He said \"without having to be afraid of fallen soldiers\"", "After watching these people views , we all can say majority of people don't want conflict. there are some who does want conflict ( extremist people) and they are easily drawn by their respective politicians.", "*Corey, the guy at 6:08 says \"fallen soldiers...\" Not \"immoral soldiers..\" ☝️", "The solution seems to exist in more and better contact between these 2 people. In cultural, athletic, educational, physiolatric, scientific etc exchange and co-operation.", "\"Fallen soldiers\" means dead soldiers in hebrew not immoral.", "5:42 you meant moshav Azrikam6:10 he meant “soldiers that fall in wars”, not “immoral soldiers”", "Next time I'm out and about and need a smoke, I'll make sure to look behind  the bars that covers windows.", "The young couple made me hopeful, but terribly sad. I hope for peace in my lifetime, and theirs.", "This channel blew up on my YT timeline. It's practically all I get now. What happened!? Great channel btw.", "Corey asks lady at Ikea: \"What do you expect to receive?\"Lady: \"PAX.\"", "Thank you corey for always maintaining the integrity of your work, you're such an inspiring person. Congratulations on the 200 000 subscribers!", "If the problem is solved, what do you expect to receive:Israel: Disco Disco timePalestine: Disco Disco time*Fans of the Zohan will understand this comment (while downing a bottle of Fizzy Bubbly)", "4:56 thats a pretty thoughtful place to hide your cigarette 😂😂😂", "I loved this video and the answers you got", "You dont feel safe and comfortable in that quiet environment! You should take a look on the other side and you'll realize the real meaning of safety.", "Love Elad's words", "A lot of dreamers I hear!  If 'Peace' means the greater freedoms of movement and settlement as most seem to desire, it sounds very nice as an ideal. But, if the reality actually occurred of having a far greater amount of people that you didn't trust walking about in your neighborhood breaking into apartments, stealing anything that isn't attached to the ground, your women folk being sexually harassed, in the workplace and as they walk down the street, then I would prefer the status quo. You just can't wipe out hate with a declaration, with a piece of paper, it doesn't work like that. It takes a long time to build up trust again. It takes even longer to be able to establish trust with people that have been heavily programmed, to say nothing of the clash of cultures and the religious influences. I am not a pessimistic person, just a realist. Shalom!", "Love your approach.", "I sometimes wish for a normalized audio in the editing (making all the levels of the audio in all of the clip the same level)", "This is the best way to learn a different language.", "I love these videos", "Oh my God, everyone just want peace, and Palestinians too", "Excellent video as always", "Congrats 200k!!!", "Thanks for these videos.", "May God help us all!", "6:11 pretty sure he ment \"not being afraid of soliders falling\" And not \"immoral soliders\"", "Nice clip!", "The long awaited arrival of the guy with a dodgy eye is near 👁️", "I believe that the real chance for peace had been wasted in the 1990s until 2000. On our side  It will be too difficult to make people ready to listen again about this. For me what I really like to say that I love the people of Meretz on the Israeli side so that I don't mind elect one of them as a palestinian president", "thank you for your work", "I had to come watch some videos to get away from the sadness in the news. If only the regular people were ever consulted...", "The lady in the purple t-shirt is so lovely.", "What a timing", "Next time ask about Sheikh Jarrah, what think Israelians about Evictions of Palestinians from their Houses? 🤔Greetings from Italy 🇮🇹", "Every place you visit seems to be louder than the last, lol 😆", "6:10 he said soldiers that fall as in soldiers that die in battle... not immoral soldiers. חיילים שנופלים.", "Hi, thanks for the interesting video. I think you were wrong in translating the interviewee's words at 6:12, he said \"חיילים שנופלים\" - this is a phrase that means soldiers who are killed in battle, and not 'immral' as you translated.", "You can tell the girl at 4:11 didn't really feel comfortable with what the guy was saying.", "To answer the question - acknowledgement of my right for self determination", "\"Beware of the supplication of the Oppressed,for there is no barrier between it and Allah/Creator.\"       - Prophet Muhammad (Tirmidhi)", "#askanisreali - Why is there very less charity/aid organisations to help their neighbours aka Palestinians. Why are (assumed)  privileged isreali helping them with education, food and dignity?", "HEY CORY YOU SHOULD MAKE A VIDEO CALLED I AM A MESHUMED", "5 seconds later, thousands of missles flew through the air, minding everyone's business", "I have a request: you should ask Israelis how they feel about \"Kaifeng Jews\"", "I love peace. ☮️😃😃😃", "Next please ask about sheikh jarrah that what they’re doing with Palestine.", "6:09 he said without having to worry about soldiers who die not immoral soldiers", "1:07Kibbutz? I wrongfully thought that Kibbutz didn't accept malls.", "I would receive nothing tangible...Like those in the video say, hopefully become less scared of random violence...I'd be more likely to move to Ashdod or Ashqelon... I'd visit Bethlehem as a tourist without using a US passport...", "This is too vague of a question and answers. Both want an ethnostate in the same area.", "Young israelist: okay good.Old israelis: This is our land forever.", "Like 👏🏻", "Yeah? Why don’t we talk about the attack on the mosques", "I feel u never trully care about how the problem should be solve, u should ask the soldier in Al-Aqsa Mosque then the people that already wound.. i mean u should be there \"RIGHT NOW\"", "Well this video had a short life.  He should ask them what they expect? Not much or nothing from our so called peace living cousins.  BTW is Corey on the streets now during the riots trying to achieve common ground?", "how kind israelis are  woow  😂😂😂", "@1:00 IKEA doesn't mind interviews in the shop?", "6:36 Is it legal to be this swagged out in Israel?", "muna.kurd 15 this is her Instagram she makes a regular content about what is happening in Sheikh jarah cause she is one of the residents of this neighborhood. share her account and support her as much as you can", "Typical young people: “Real Democracy” lol", "Shalom , Shalom Jerusalem ❤️ ! Pray for ISRAEL 🙏 .", "It would be really interesting to ask the same question to Palestinians. I've got the feeling everybody just thinks Hamas/Fatah represents the Palestinian mentality, and I don't really believe that.", "\"Government  is the problem \"The  people would work it out .", "Shalom.. I emailed you about question but you haven't replied.. Please reply as love your channel and want ask question 🙏🙏", "Did this man just say behind the skeens?", "Yeah you’re asking a very vague question. One side has missiles and guns other side has rocks and sticks. Maybe ask why steal the sheik jarrah land and let Palestinians live in peace.", "How about the ability to build a third temple on the temple mount and pray there?", "Road trips to Lebanon amen", "The hot dude at 4:00 minutes 😭", "The settler in West Bank 4:14, she does not want to pronounce the word Palestinian. Is that hard for her?", "Please ask israelis about what do they think about the role of Russia in the current conflict.", "can you ask people on the streets about Jacob Frank?", "👍👍", "Чтобы разрушить условное еврейское единство, хватило создать еврейское государство. Израиль  лишил евреев мечты.", "when you wrote \"refugee from Gaza\", you mean she is one of the 8000+ Jews who were evicted? I just want to make sure I understood.", "🇵🇸❤️", "LORD JESUS (YESHUA) Is The KING 👑 Of The JEWS (Isaiah 53) , (Psalms 22) and (Zechariah 12 : 10) !", "Damnit, the same everywhere. Those dealing in hate and death pursue conflict while the humans suffer while hoping to live in harmony. We have learned nothing and we are doing less each day. Damnit", "They expect to be told how special they are. How all their legends are true. How their ethnonationalist behavior is not criminal but instead is a gift for mankind.  And how their swindlers aren't really swindlers but the most morally-upright creatures on the face of the planet. Aren't they all so amazing and wonderful?", "Ask israelis whether stoning should be back if yes then for what     things?", "Hey Corey did you make a video asking Israelis what they think of decades of apartheid??", "Same people, Same language roots but they kill each other. Guess why? People happened to believe some schizoids for their personal interests.", "Impossible! Unless the antisemitism in their teaching miraculously gone or at least their leaders stop to do so.Its been planted in their heart since they were little.", "What sort of a question is that?", "he said thats the million dollar question. its worth Billions if not Trillions of dollars", "What a nice and good people all they want is to be safe", "🇹🇷❤️🇵🇸", "I wanna ask you something how do you know about our history I really want to know it's ok if you don't answer", "And then they go an vote for netenyahu", "U must ask what they opinion about what happen now!the world really can see who is israil now.May Allah reward your deeds.May Allah open your heart", "#saveshiekhjarrah", "4:16 the lady saying InshAllah InshAllah it does happen but Jerusalem will the capital of Palestine while use have tel avivBoth citizen can apply for dual citizenship at there request Jews to respect the boundaries of the Muslim quarters and like wise to Muslims and Christians holy sites shall remain to there faith and not go over to the other site unless to view on tours just visiting like a tourist Gaza blockade needs to stop haves it’s on airport and shipping docks this can provide revenue not just for Palestinians but the other part Israel"]}, "CdaEQtMSw7I": {"title": "Israelis: Did Israel create or support ISIS?", "top_level_comments": ["It's not unique for a government to create a crisis, then offer the solution to that crisis. Unfortunately the solution usually entails infringing on the people's rights in one way or another. \"You never want a serious crisis to go to waste. And what I mean by that is an opportunity to do things that you think you could not do before.\"Rahm Emanuel", "The question was actually real 😂", "God bless you Corey. Doing God's work as always and brining first hand observations to the world.Stay safe, brother.", "It's pretty well-documented that Senator John McCain created Isis", "Daesh never attack Israël. And Israël heal daesh guys in Syria. So that's a good question", "Some of these isralelis are so sheltered and only live in their small bubble,  they don't see what's going on behind those walls", "Should have asked if Israel helped ISIS to defeat Syria - not Israelis but the mossad or government", "That one guy who said that he wasn't working for the mOSSAD, actually looks like one", "for me i think yes they made it or at least supported it to last longer to break syria apart , the last strong country that still didn't make peace with israel so ofc israel would like to see it broke", "\"They created the paper clip and and i hate brenda\"Yoda:  there's nothing a little music can't help  rockin rockin and rollin , down to the beach im strolling but the seagulls poke at my head not fun i said seagulls mmmSTOP IT NOW!", "“We are people of peace….we conquered this land”  4:35", "\"I've never heard of it or researched it but I think it's bullshit\".", "God gave land to some and forgot to tell others 🙄🤔🤣", "Arabs are something else", "Everyone conquered and some are happy and some are suffering.", "ISIS= Wahabism/Salafism/Hanbalism combined with jihadism. This ideology exists since over  1000years in the Islamic sunni  spectrum and it claims to be the only true way of Islam.", "Several countries were caught RED HANDED. So don't bother with your \"experiment,\" AKA, disinfo.Those that know, know.", "If ISIS is actually  to protect muslims where are they now?...", "Wow people you have nothing to say so you say we support ISIS😂😂", "Well it once documented on R&U videos, i forgot the title, but it's an old video where the russian army seized tons of weapons registered to israel. And look at the news of hos maby times israel jet passing by through enemy territory without permission🤦‍♂️", "Stop these lies and only peace and love!❤️😌", "2:50 i dont think that argument is valid germany also supplies both sides in a war with weapons. Thats just the business", "America created it, possibly with other allies' cooperation, but before it got out of hand. Just like Iran funds hezbollah", "Obviously the average citizen doesn’t know what happens on the government level.", "Ur so biased in ur reporting", "Look up Timber Sycamore for some context", "This channel belongs to a israeli canadian (Corey Gil-Shuster). I don't know to what degree he is neutral.\rIt's possible that he is more pro-israel and chose to ask harsh questions against israelis so such harsh argument can be easier to be argued again. (where as a moderate question like \"given israel keep expanding its territory, do you think palestine's military actions are understandable\", will make israeli settlers look more unreasonable )\rFundamentally, we don't know what are all the questions that are given to Corey Gil-Shuster. I think it's better if Corey can further try to make the questions comparable in terms of tone and reasonableness (you don't want to ask israeli unreasonable questions that are easily-countered... while ask palestinian reasonable question that are hard-to-be-countered)", "Why eli wearing that shirt, thats like me wearing a hrvat shirt", "What is this nonsense !!😬😬 Stop lying if you think you're right then why do you lie I don't understand.😑😑", "You should've asked them have they heard of a man named Shimon Elliot? Aka Abu Bakr Al Baghdadi.", "8 People in this video have never, ever, heard about false flags operations.DO NOT google \"Isis apologizes to Israel\"", "Why is this video unlisted? Is it because of the title?", "You should ask military people like IDF. Citizens wouldnt know", "I want to ask a question Palestinians. \"Will happen something good with them if Israel will withdraw from west bank. Will it be same as in Gaza (Occupied by Hamas)? Will they have more Rights?\"", "Corey, what do YOU think about USA funding and supporting jihadists over 50 years against Russia and then turning against them, and in different regions as well?", "How many times has ISIS attacked Israel?", "ISIS - Israeli Secret Intelligent Service After being famous (exposed what isis means)  they change their name to  IS - Islamic State. hahaha. another point is, How can The ISIS never bomb or send rockets or even kill or even tries t0 anyone in Israel?", "I watched a lot of your videos and you're extremely biased to the Israeli said .. I bet you even filter their answers", "אם נכון אז לעוד פעם עבודה מצוין בשם ישראל ובשם המוסד! כל הכבוד...", "Why would they speak honestly when this could literally threaten their very lives once upoaded to Youtube ?", "literally no evidence", "Let's have a look at the timeline shall we?2011: Arab spring and start of Syrian civil war2013: ISIS splits of from the general rebel groups and now opposes both rebels and Ashar2014:war spills into IraqBasicaly at this point US,Saudi Arabia,Israel and Turley were all supporting ISIS to counter the Iran and slightly later Russian backed Assad and Syrian army. Plenty of evidence suggests Israel being involved in funding them2014-2016: ISIS at peak with Americans now favouring Kurds while the Saudis and Turks turn to rebel groups/ ISIS recieve no support and have basicaly lost all allies2016-2021: gradual decline of power and since 2018 they have had a small strip of the Syrian desert at best.Israel,US,Turkey,Saudia all have been supporting isis in it's cradle days as a formidable opponent to Assad. It was only after they grew too powerful (half of Iraq and 3/4 of Syria) and their attacks in those countries that they lost favour. The Syrian civil war was a war of proxies in which Israel contributed and helped destroy ISIS.", "They won't let me reply with the truth. They keep taking it down.", "ISIS came from Al Qaeda which wants to destroy Israel. This is a classic case of people using Israel/Jews as a scapegoat for every evil in the world.", "This is the craziest thing. The fact that people  in the world would believe such a moronic conspiracy theory  demonstrates just how removed from reality they are.", "3:27 Oh irony I get it", "The first soldier is totally hot", "Why my comments are deleted? You can delete here but truth and proof is already written on history books. That will be remember...", "This is true never forget able God never forgiving", "was this video private? i didn't get to see it.. it only poped up now thats why it has so little views", "A better question would be; \"Will the Arabs ever stop blaming others and start taking responsibility for their failings?\"", "YESHUA Is The KING 👑 Of The JEWS (Isaiah 53) ! I Love ISRAEL ❤️ Greetings from Macedonia ❤️ Shalom ❤️ !", "Arabs and their conspiracy theories. LMFAO.", "Ask the people who were fighting against ISISThey will tell you", "but this is true. the defence chief of staff even admitted it", "0:56 he did not wear the face mask completely. If you have sex with this kind of person, this person will not wear condom for safety protection.", "Iran took alqada from Afghanistan and latter pushed them to  into Iraq to harm Americans then they turned against the shia now they blame every thing on israel even if the cornflakes gose out of date they will blame it on israel . The devil is on over drive . I'm from iraq and I have heard this alotWe can't buy peace but we can make it Shalom from assyria to israel", "It's true they did create isis to destroy Syria and other surrounding countries", "people also think earth is flat", "DO NOT GIVE THIS GUY A RED CENT.He's already on the payroll.", "انقذوا_حي_الشيخ_جراح#savesheikhjarrah #ŞeyhJarrahmahallesinkurtarın#SalvailquartierediSheikhJarrah#RettedasViertelSheikhJarrah#sauvezlequartierdesheikhjarrah", "Corey ask this question from netanyahu or israely army", "It is crazy how blatant the bullshit is becoming - no one trying to analyze or interested in analyzing why such a claim would be made and on what basis. The last woman's claim on one hand that the land was \"promised\" - by whom? Would every being on this planet agree to those terms or is it possible that that \"promise\" is conveniently worded in language only you speak and you fullfill that promise by means of \"bloodspill\"? Then divert to the other colonial terrorists to back up your claim... But no way did those same institutions create daesh...", "I’m Israeli and I forced my daughter to join Isis", "\"Viewer question?\" Are you not responsible for your question, it shows that you hate Israel So you're being manipulative everyone can tell its a personal hate question it's just unprofessional for you to do, the fact that your also Islam, as if you're asking if china's food is from japan just like that. yikes man", "That was a true fact ..", "Israel didn't have a problem whatsoever with ISIS when they were near the Golan Heights for years. And it's known they treated Al Qaeda fighters in their hospitals and gave them weapons as well", "What about Al Nusra?", "According to many Jewish sects Allah and HaShem are the same god.  Wondering if their HaShemIs really Mohammad’s father “Hashim”!", "Its in their interest though and guess what they being Islamists never attacked Israel In fact an Israeli official said \"We prefer ISIS in Syria over Iran\"", "Why would we provide them weapons they're gonna use again us? Why would anyone think we created an organization that kills our people?", "Why do you laugh when asking the question?", "I wonder if they know that Israel has actually created Hamas?", "Created Hizbollah, Hamas, Jehady islamy and all ethnic religious groups in the region.", "They do provide weapons to a lot of people around the world.... He's not lying. 2:55 Unfortunately they sold weapons to Azerbaijan who used them to kill over 5,000 Armenians in the war last fall.", "Hillary Clinton who created the ISIS, search it in YouTube", "Just ask yourself why daesh didn't attack israel...even trump said it also by the way", ">A few years ago", "The fact that they all got triggered at the question is telling u something if  it was nonsense to them they would have laughed at it", "Every single time.", "Now ask a serial killer if he really killed his victims.", "Yes of cours", "why did You make the vid not public", "Stupid question , to ask the criminal if he did his crime", "I don't know Israel support isis India  supporter isis in India city name kerala karnataka", "This comes from an idiotic myth that ISIS never attacked Israel. It did, and regardless Israel fought them. Even if it was true, and it isn't, that doesn't prove a thing, they never attacked Oman for example, what does that mean?A few incidents, just from memory-What I know of in Syria:-Israel provided drone support to a secular Syrian rebel group called something like Knights of The Golan Heights in a large scale assault on an ISIS held area. Look up the War On The Rocks article about that.-Border skirmish with Israel in Syria around November 2016. Started as a firefight with a IS element that climbed towards an Israeli outpost. Israeli infantry were able to repeal them, and a building in Syria where other ISIS elements were placed got airstriked. The results of the firefight were posted on YouTube, try searching \"israel Vs Islamic state\" or something of that effect.In Israel: The only thing I know of is a 3 men strong attack in Jerusalem in 2017 I think, that ISIS took credit for, but other armed Palesinian groups claimed that they were lying and that it was them.In the West Bank:One of the only famous cases of the Palestinian Preventive Security actually functioning against terrorism was a case where they stopped an ISIS attack inside Israel, that was around 2018 if I recall.On the Egyptian front:This is where most of it is. The Sinai based Ansar Beit Al Maqdis, a group which swore loyalty to ISIS and thus became al-Daoula al-Islamia Wilayat Sanaa, or ISIS in the Sinai, is responsible for:Blowing up Gas pipes going through Egypt to Israel, and an assault on Israeli soldiers on the border in a separate incident. Also shooting rockets at Eilat, although they were intercepted I think. There were other cross border raids since they became a thing, but I don't know which ones were necessarily theirs, like the ATGM attack in 2011.More importantly al-Sisi said in an interview that Israel bombed hundreds of ISIS targets with his approval in the Sinai around 2019-2018. There's a picture taken from a video from around the period of 2019 on an blog by Joe Truzman, where an ISIS member presents the munition dropped on them from the sky, surprise surprise, the inscription on it is in Hebrew.A few of the thwarted worldwide terrorism ISIS attacks were thanks to Israeli intelligence. Remember for example that period where no one was allowed to have a laptop battery in airports? The thwarted attack on Australia by ISIS that was revealed due to Unit 8200? Or the planned attack on Denmark?", "Actually you till someone when lies look at face of all the other things a lair will lie it the blood and they deaf and blind", "Corey I hope you read the comments, there is alot of conspiracy theories down there that you can ask", "100%", "Next question : \"some claim the moon is made of cheese, do you agree?\"Woke Jihadibots : \"of course they deny it , its just a proof that they secretly know it!!!\"", "Here is a question: Why does ISIS never attack middle east countries that have friendly relations (Saudi Arabia, UAE, Jordan, etc) with the US and Israel?", "Here's another question... why has ISIS never even tried to attack Israel?", "Yes.", "The story of this stupid question is the same old story all over again: Muslims, and especially Arabs, are unable to take responsibility for their own actions and blame others for their problems and situation...", "4:30 \"We are people of peace \" best joke 2021 צָבוּעַ", "Google ‘Haavara Agreement’", "🇵🇸 #أنقذوا_حي_الشيخ_جراح🇬🇧 #Save_SheikhJarrah_neighborhood🇺🇸 #save_sheikh_jarrah .🇷🇺 #Спасти_район_ШейхДжарра 🇹🇷 #ŞeyhJarrah_mahallesini_kurtar 🇩🇪 #Siehe_SheikhJarrah_Nachbarschaft  #Sauver_le_quartier_de_SheikhJarrah🇪🇦 #Salva_el_barrio_de_SheikhJarrah🇮🇹 #Salva_il_quartiere_di_SheikhJarrah#الشيخ_جراح#انقذوا_حي_الشيخ_جراح#savesheikhjarrah#حي_الشيخ_جراح#لا_لتهويد_القدس#أنقذوا_حي_الشيخ_جراح#لن_نرحل", "I wish you worded it differently because it’s true but the details are to complex for people to understand without it sounding like a conspiracy.", "They did to Iraq and Syria what they did to Germany in WW2, they don’t want any other countries to prosper. Any nation that is too strong and is awake about the truth is a threat to Israel.", "Everything that looks very bad - it is easy to blame Israel.  There is someone who does not take responsibility for his actions and casts them on others"]}}