{"OvrcrsMp0Ww": {"title": "Palestinians: What are the borders of the future Palestinian state?", "top_level_comments": ["INJUNE 1964, AN EGYPTIAN OPPORTUNIST ON THE PAYROLL OF THE MUSLIM BROTHERHOOD,HELD UP A JORDANIAN FLAG WITH THE STAR REMOVED, AND SO… BEGAN 3,000 YEARS OF“PALESTINIAN HISTORY”  YOU WERE NAMED BY A ROMAN AND INVENTED BY AN EGYPTIAN", "Does \"all of Palestine\" include Jordan (originally part of Mandate Palestine)?", "Put aside that baggers can't be choosers i always wondered why they don't claim Jordan as well as Jordan aka transjordan was part of British palestine from 1921 until 1946. I guess there is a reason why they want \"the borders of 1947\"", "Then they will say israelis must make \"peace\" with these people.", "notice in this video; there are no disagreements between interviewees. judging by this video exclusively (sadly no other views shared that Corey could have included) it seems there's no other option, other than war. this is tragic. in oppose to the Israeli part of the video that was shared previously. there were vary of views.", "It shouldn't be this hard to realize that the answer to \"I don't recognize Israel\" is not the solution.", "I can’t believe you’re always in nablus but you never find me. i wanna be in one of your videos🙄", "And meanwhile nobody contests the borders of Pakistan, although this was created at the same time as Israel and for the same reasons: to give a state to the Muslims in the India colony. There are Hindus in Pakistan, are they fighting against Pakistan, not recognizing ist existence? Are Muslims in India not recognizing it's existence? What is so different?", "When was this area land of the palastinians? NEVER https://en.wikipedia.org/wiki/Timeline_of_Jerusalem", "The mentality is the reason why it's not going to happen. You need more consensus and accept the fact that you have a neighbor.It's like if France wanted it's land back to the Netherlands, never gonna happen. Whether your position is, with no discussions or concessions nothing will happen...", "Now you know why they have nothing", "If you find this topic interesting - check what we do. Join the discussion.", "The borders of the British Mandate of Palestine before 1948 included Trans Jordan. Why isn't Jordan occupying Palestine, just Israel?", "you learned a lot about yourselfand you did not know about all this in the depths of your heart, huh?)))it's so simple really", "Don't you always get the majority of Palestinians saying \"all of it\" meaning Mandate Palestine?", "There can't be  any peace agreement if you don't accept having a neighbor", "Ever think of reasking questions? Opinions can change, especially from questions you asked 5+ years ago.", "You been uploading a lot Corey, good questions coming along on both sides as well lately( yes I know some of the videos are old give me a break) .", "before 48, that would be British mandate of Palestine 🙄", "Corey, You are almost at 250,000!", "So what percentage of Palestinians would be satisfied with the 2 state solution? Is it a recipe for peace or just a prelude to more war?", "How can one publicly answer such question when fearing a repraisal from PA and perhaps facing a long term imprisonment for condoning the \"enemy and their action\"? Is it why thousands cross checkpoints every day to earn better salary and experience welcoming bunch of Israelis - but then when asked to share their opinion on camera they swore to be Israel's ferocious enemies?", "If only there had been among the generations before you, men possessing wisdom, prohibiting (others) from mischief on earth, as did a few among them whom We saved (from harm) ?But the wrongdoers pursued the enjoyment of the good things of (worldly) life they were given therein, and persisted in sin. And your Lord would never destroy the town unjustly, while their people were doing right.And if your Lord had willed, He would have made mankind one community, but they will not cease to differ. Except whom your Lord has given mercy, and for that He created them. And the word of your Lord is to be fulfilled that “ I will surely fill Hell with jinn and men all together.”And each [story] We relate to you (O Mohammad) from the news of the messenger is in order that We may make strong and firm your heart thereby,….And there has come to you, in this, the truth and instructions and a reminder for the believers. And say to those who do not believe, “work according to your position, indeed, we (too) are working, And wait! Indeed! We (too) are waiting.” And to Allah belong the unseen [aspects] of the heavens and the earth and with Him the whole matter will be returned, so worship Him and rely upon Him.And your Lord is not unaware of that which you do.", "What if Israel would occupied the entire land with Gaza and Judea , Samria ( west bank ) and then named the Jewish state as \" Palestine \" ?", "Awesome vid, awesome channel, great team. Love every vid to get an idea of the feeling on the ground. Peace! Love!", "It shows their true faces.", "These questions are kind of returning but phrased differently.", "It's sad to admit but this is the answer that Corey almost always gets, regardless of however the question is phrased. 1948 and no less.", "Very sad. This my-way-or-no-way attitude is why they will most probably end up with nothing.", "Just in case you were still hopeful that this conflict is going to be solved soon, here's a video to give you a reality check, I said it in another video and I'll say it again, 73 years have passed and they learned nothing, they still have the exact same mentality.", "One thing for sure, their \"Future state\" would be lucky if it looks like current Lebanon,  let them hope for the dictatorship of Sisi, as that would be a blessing compared to a power vacuum of Fattah, Hammas, PIJ, and surely ISIS Sinai.Killing is their teaching of resistance.Like Abba Eban said \"The Arabs never miss an opportunity to miss an opportunity\".", "I don't want to rush to conclusions, but if this video is representative of public opinion, it shows that a 2 state solution based on 1967 border will not lead to peace. Interesting video as usual, thank you Corey.", "\"The borders of the future state of Palestine will be what they were before the occupation\". Ummmm, let me see, what were they? Since there was never an Arab, Mamluk, Seljuk or Ottoman state, province or geographical designation called Palestine. Since 'Falastin' was only ever a reference to what the Crusaders, following the Byzantines as the Eastern Roman Empire, called an area encompassing today's Lebanon, Israel, parts of Syria and Jordan). We would have to assume the guy at 0:33 means the British administered Mandate Palestine. If that's the case, before 1922 at least, that would mean all of today's Jordan and Israel. I'm not sure the Hashemite Kingdom wants to change its name to Palestine, since it has fought so hard to create a Jordanian identity for the Bedouin and sedentary (southern Syrian) Arabs of the land. But we know that's not what he means. What he really means is that Israel should just miraculously disappear from the map, as if people and society, their economy, institutions, infrastructure, culture, built environment don't exist. Infantile people like this man continue to have wet dreams of paradise on earth that will supposedly arrive if only a map could be corrected, and specifically only if Jews didn't exist on maps, at least not as sovereign people in their own political domain. The cultivation of such improbable dreams is the reason for the continuing futile violence and dead-end politics that besets the Arabs.", "The Ancient land of the \"Historic Palestine\" was decided by the British in 1918. How does that work?????", "The funniest bunch of tribes (khamulas)", "In 1947 it was a colony of the British mandate. They are educated about imaginational state that never existed.", "Although I respect their opinion, it’s unrealistic at this point.", "and this is why there will never be peace.", "I am Sarrah by blood and language - i am foremother of whole jewish nation!)))", "All you have to do is look at the Gaza Strip. That's what you'll have.", "ShaniPTSD-Queenie.Come back!Don't listen to the Docs. It is time to act bonkers in public again.", "Corey, you love Mediterranean people as your people, but Abraham is not from Mediterranean, he is from Chaldean UrAnd who is Chaldeans and who they are now, do you know?", "This will never work... people need to compromise.", "Lol they are súper funny.", "They are entitled to a country in the exact same borders as the previous independent Arab kingdom/republic/Sultanate* of Palestine.*unfortunately such entities have never existed.", "How do the Israeli Arabs and Israeli Druze feel about this conflict?", "They want their own country back?  Go to Jordan. The Mandate of Palestine included all of Jordan.", "I would like the Jews to have their own country, like Muslims or Christians,", "Ask them what will happen to Jordan", "Give them anything at all, and what you'll get back for your efforts is another trst base like Gaza.", "Jordan's borders have been established. That is their state.", "how do you manage to read the information so quickly and delete it ??I wonderWow you a genius", "How come we find ancient Inca, Mesopotamia, Persian Greek, Chinese, Roman, Egyptian, Indian, Aboriginal, Jewish and other ancient civilizations and cultures and yet, nothing has ever been discovered of Palestinian ancient civilization before 1964.", "Their state is on the other side of the river.", "There is nothing called Palestine there is only Israel and Jerusalem is its capital \rSending love and support to Israel from Saudi Arabia", "when they said ''historic palestine'' I googled it and went to the Wikipedia page, Israel is mentioned long before the term Palestine ever existedhttps://en.wikipedia.org/wiki/History_of_Palestinethe title says '' History of Palestine'' but it's just the area name, not a country or something...", "Israel has always been the Jewish homeland. The League of Nations in 1922 recognized the historical importance of the land to the Jewish people and paved the way for a Jewish state.", "“إِنَّ اللّهَ لاَ يُغَيِّرُ مَا بِقَوْمٍ حَتَّى يُغَيِّرُواْ مَا بِأَنْفُسِهِمْ” I hope you people get the translation of this verse.", "Corey, are you to blame for all the evil that is happening around and do you still consider yourself righteous?)", "I don't really get these people who say - \"I don't recognize Israel, there is no such thing\". Israel exists whether you like it or not. It's just plain stupid to say such things.", "2:40 / 3:27 \"from the river to the sea\" no less... well at least, Nobel Palestinian ladies did not demand \"from the sea to the Tigris\" as did the Israeli lady in the previous video. the Israeli thinks larger. 😁", "Demanding everything, is exactly why they will end up with nothing.", "Future Palestinian state 😂😂😂", "Pretty clear why they have been waiting for such a long time, and why no body really pays them too much attention.", "I'm fine with from the jorden river to the red sea.", "Good thing Israel has already cemented their existence annex the area C and let the Palis accept Israeli citizenship or be paid to leave.", "Next question(s) for the Palestinians: \"have you noticed that you're further than ever from this victory that you keep on talking about? How do you think this so-called victory will be achieved? Might it be better for everyone, yourselves included, if you settled on a more realistic goal?\"", "hey remember the jewish communities that have existed for centuries on the land? or maybe that jews were discriminated and the population shrinked over the years? lets keep that going, we deserve the entire land, and they need to live under our rule", "This people Remember they lose all the wars After 48' ?", "I guessed Corey, you are an Arab, not a JewYou are sharing J2 haplogroup, not J1)))", "You already have Jordan as your state,why do you want more?", "And actually you should respect khazar women too because khazars accepted judaism and khazar womens also mothers of the jews))", "I don't want the West Bank, I want to have my own bank to print the money myself.", "Most of them have same opinion, before 1948 .", "It's just name. What if Israel change name for Palestine. It'll be good fun", "I am an Egyptian woman, seriously)So you are my sslave)My Egyptian slave) it is you CoreyYou are Egyptian slave)don't be offended, why are youit's just a joke)))❤️❤️❤️", "Judging from these comments, it's apparently useless for Israel to engage in peace talks and make concessions to the Palestinians.", "Lord, what confusion is everywhere!))🤣🤣", "Balfour declerationLook it up yourself", "They just want their land back", "1:16 Best answer here by far... which is sad.", "It's no brainer from the river to the sea!", "It is not possible now 1948 i think the better solution is 1967 border both side people Deserve peace and love", "Are they aware of the fact that before 1948, trans-Jordan was actually the BIG part of the British Mandate of Palestine?", "YESHUA IS MESSIAH ❤️ (Isaiah 53) !", "They never had a stare before this. Isnt Jordan part of historic palestine from the mandate and then the British split it up? Go bother them too about land for the Palestinian state.", "and i want tham in jordan and all the jews historically places that has stolen by the romans and called Philistines and later will come back to jews..... so... yeah... good luck and dont forget all the jews places in arabia befor islam took all overislam occupated all that they have.... fact.", "existentialism 🙄", "Although I'm not a fan of the Chosen People and Holy Land narratives, given that off the bat that that's not Godly and thus bogus, I do feel Israelis need a home wherein they can feel secure and go about their daily lives. Having read the Pianist and other sources, they were put through hell during WW2 and I can't, in all honesty, deny them Israel as it currently exists. I am well aware of the legitimate Palestinian claims but life is not ideal. An intractable conflict :(", "You father married a canaan woman - he could not fulfill the law normally", "No one suggested living together in peace/with 2 states…That’s distributing as an israel who wants peace but the other side is not", "You’re asking question without mentioning the fact that Jordan 🇯🇴 is also part of Palestine pre 1948.You are very shallow, you ask the same questions you didn’t ask if Palestinian prefer to have Israeli citizenship or co exist side by side.Your interview is rather irrelevant and not constructive.This Palestinian of course want a Palestinian state but consider israel won’t hand over any of its territory.Go ahead keep on asking what do THEY think borders should be.Irrelevant", "In the sea", "From the River to the Sea, bay-beeeeeee"]}, "9e0OFmdT9Ho": {"title": "Palestinians: Do you think you are brainwashed?", "top_level_comments": ["This is just a bad question. No one will say “yes”.", "The tricky thing with this question is that people who are brainwashed would not admit to be brainwashed. A better question would be \"do you think people around you are brainwashed?\" Or \"what common beliefs do you object to or question?\"", "The biggest problem is, if I was brainwashed I wouldn't know that I am brainwashed", "Why not also ask Israelis if they r brainwashed? Consistency matters.", "The guy:brainwashed? No, no one can wash my brain.Corey: how do u know you’re not brainwashed?Guy: because I live in the town, I watch TV I watch the news I know what’s up.Me: 🤦🏽‍♂️🤦🏽‍♂️🤦🏽‍♂️", "That's the whole thing about being brainshashed, you don't know it", "the first question should never be a negative.once you asked \"are you brain washed\", that person is on defensive side.always ask some softball questions that they think they know it well, then throws a little fact to contradict that and starts to shake their faith down.after few rounds, it's ok to throw out \"are you brain washed\"", "Every human being that lives in any society is “brainwashed” to some extent. Usually traditions tend to have dogmatic beliefs about life, that don’t necessarily have something realistic to back them up 100% as something that HAS to be done, but under the pressure of society/tradition/what you’ve been taught/your personal choice, people still act at certain ways fuelled by that specific tradition.", "A tricky question. Respect to the lady at 4:40.", "Wisdom comes when we recognize our ignorance. The scientific breakthroughs in the last half-century came when we stopped pretending we knew how the world worked.Many of these Palestinians seem pretty confident in believing they know all there is to know. Not a good sign if we want peace or mutual understanding.", "@4:27 \"I believe my own beliefs\" sums up the recursive, self-reinforcing thinking that seems to be endemic in our species. We need more of Julia Galef's \"Scout Mindset\".", "Moadim Le'Simcha To All Am Yisroel And Friends Of Zion May The Jewish People Merit To See The Reestablishment Of The Beit HaMikdash in The Near Future", "Socrates, at least written historically speaking, gave birth to syllogistic conclusions, Aristotle ontology and epistemology. This was about 4 centuries before the Common Era, however, there was no guarantee that the brains back then would be able to follow logical conclusions, and unfortunately it is still the case. A lot of adults have a mental development of a child, and are easily persuaded through frequent messages, simplistic aphorisms and sayings, religious dogmas, political propaganda and senseless traditions.", "Liked the little cab ride at the end! Love the sympathetic translator.", "Teach love , not hate. 🌈❤️", "This is a good episode, in relation to everyone gave a reasonably detailed answer, how they think 👍", "Corey: Are you brainwashed?Mega chad: brainwashed? No, no one can wash my brain. I watch the news I know what’s up.", "of course they will say no.someone who is brainwashed thinks that he isn't brainwashed, otherwise he wouldn't be brainwashed.", "04:40 : Im not from nablus but i study and live there, to be fair i don’t see that type of oppression, and women do be walking at 10pm, 11pm everywhere.. coffee shops are filled with male and female students all around the city..", "Shalom, Salam, Peace To All Mankind. TV News Channels Can Easily Make Us Change Our Point Of View, Just Look Back At The Afghanistan, Iraqi, Libya, Syria Wars. Best To Watch A Diverse News Channels On You Tube, Then Use Your Brain Towards Wisdom.", "the brainwashed do not know they are brainwashed. that’s kind of how it works!", "This is such a poor question. A better one would be \"do you think the news you consume is objective\"", "🔥👏", "I don't expect a brainwashed person to say yes to this question.", "You dont know the reasons... It's actually really simple. Theres an ongoing invasion and oppression that some strangers do to Palestinians. Try to complicate it, but actually it's simple.", "This question is the very epitome of the word chutzpah.", "I agree with those that state that this is a foolish question. Very few people anywhere in the world will state that they believe that they are being brainwashed. It would have been better to ask if they question authority and whether they've ever done their own research.", "True history\rThe Roman general Pompey conquered Syria and Israel in 63 BCSome of the Jews rebelled against it,\r there was a people who invaded the Land of Israel even before the people of Israel left Egypt,\r the name of this people was \"Plishtim\" it is also written in the Bible.This people became extinct when\r the Romans conquered the Land of Israel.The name \"Plishtim\" In Hebrew/\"Paleshtina\" In Roman   Palestine?\r  This is a name that the Romans called the Land of Israel, to humiliate the people of Israel\rThey also called Jerusalem \"iIlya Capitolina\" and also the city \"shchem\" mentioned in the Bible, \rcalled it \"Niapolis\" .The biggest lie is Palestine. The name Palestine was called by the Romans when\r there was a Jewish majority in the Land of Israel.The Romans called it so in order to despise the Jews.\rThe name \"shchem \"  mentioned in the Bible is also called \"Niapolis\" . The Arabs call it \"nables\" \r. Because they do not pronounce the letter \"p\".There has never been a people called \"Palestinians\".\rThey all invaded Israel from Syria, Jordan, Egypt, Lebanon and more\r ...In Israel in Gaza and in Judea and Samaria there are families whose name is \"Al-Masri\" which means \"Egyptian\" in Arabic.\r The \"Halabi\" family means from the city of \"halab\" in Syria, and other such names that\r surely understand that they came from outside the Land of Israel, especially when Nebuchadnezzar\r king of Babylon exiled most of the people of Israel to Babylon (so it is written in the Bible)\r.There is no Palestinian nation, there has never been such a people, The terrorist Yasser Arafat decided\r to call it that in 1948To get public sympathy. ask who was the Prime Minister of Palestine ?! \rYou will never find.Who were her ministers?Where was the king's palace?The president's house?\rThe Prime Minister's house?Where was Parliament?What's her coin ?! Even if you ask every Arab in the\r world that he claims to be \"Palestinian\", what does the name \"Palestine\" mean ?! He does not know .\rThere is no such thing and there was not. Everyone who digs in the ground finds coins of the people of Israel,\r inscriptions, jewelry, graves, coffins, and more ...There is nothing and they have not found anything that belongs\r to a people called \"Palestine\".This is the reality, and whoever thinks otherwise has to prove it. The Arabs / Muslims\r have conquered the whole area.While the people of Israel were exiled from their land by the Romans.It is written in\r the Bible that the people of Israel will return to their land. And here after 2000 years as promised in the Bible\r, he returned to his country from all over the world,Everyone who kept his Judaism for 2000 years came to this country. \rThere are German Jews, Roman Jews, Austrian Jews, Egyptians, Yemenis, Moroccans, Tunisians, Algerians, French, \rSwedes and more ....And he who does not understand then I am sorry for him ... especially if he is a Muslim\r, because in the Qur'an it is written that this land belongs to the people of the book. (Bible)", "A Blessed Shabbat Shalom To All Am Yisroel And Friends Of Zion \" The Guardian of Israel neither slumbers nor sleeps \"Psalms 121", "Ask this question to religious jews...", "We are all brainwashed in our own way according to how God wills our lives for us.", "The old bad program \"lies\"  needs to be changed or replaced ! 👽", "Thank God for the girl, she is brave as anything. But they're on a war footing at all times so who can blame them. You toe the effing line.", "Not one of them even thought that there's a possibility they could've been brainwashed...", "\"No one can wash my brain\", LOL!!@ That guy was funny.", "I know I'm not brainwashed,whyI watch Tv", "Another dumb question.....brainwashed people have no idea they are.", "They're cute", "There's no brainwashing, each person has their own beliefs and will think of others as brainwashed if they don't like others' beliefs.You can talk about close mindedness though, which is apparent in many comments on this channel, where some people (mostly zionists) are refusing to believe what Palestinians have to say out of just refusal not out of rationality or logic.", "00:57 she said no one knows all the facts", "A brainwashed person don't know his brainwashed", "Honest Arab answer:  Yes we've been brainwashed, so what!!!  Corey's reaction:  Guess the Ask Project is now over!!!  What's the point?  LOL", "This ignorant guy says: \"No one know the truth\"But it is not truth 3:36God and Jesus Christ knows the truth and he is a truth a way and Savioreverything has long been known and written from beginning to frontread everything in the book of Revelation of John the Divine", "Now it’s time to ask the Israelis this question Corey. Nice 3D thinking >:)", "A bit of a loaded question.", "Score one for 22 year old women.", "The sound is awful, can you change the micro?", "Corey do you film in winter ?", "History Science and Common sense will show you the truth. Follow your feelings in knowing whats right and wrong. Non but ourselves can free our minds.", "Other people's facts?Alternative facts?Been there once in the USA with the egregious Trump regime.  We don't need to go down that madness again.", "4:40 Manar from Nablus - that girl is smart!", "What kind of answer is an absolute \"no\", to a question that obviously has only an ambiguous answer... you can't take their answers seriously...", "Of course they are. This shouldn't be a question either", "Jesus, what a silly question!", "4:38 the objective one", "Who exactly will admit to being brainwashed...what a stupid question...", "Ask Israeli Settlers the same question", "How many Taxis are there?", "Brainwashed ? Serious ? What question is that ? Their land has been stolen , who will brainwash you for that ? No need brainwash,Israel stole their land simole", "0:55 she said she doesnt know all the facts and the translator said (she did know all the facts)at least  translate right", "Classic gaslighting", "Sir, are you brainwashed?", "Your questions are just getting dumber", "I’m not surprised 0:46 it would be girls saying they know all the facts lol 😂 women r toddler ..! You can’t make this up wild ..!", "Do you know there's judaism in Indonesia? Ask that queastion to israeli", "tell Manar from nablus that i love her, she's so beautiful and intelligent", "Wow, that’s a question. (just opened the video; haven’t watched it yet)", "If both groups accept each other's facts, history and right to the land we will have wonderful peace we both have lost so much  we don't want our son's to die in war and believe me as a Israeli I'm not afraid of war but I want peace and Israelis aren't going anywhere and palastinians aren't going anywhere we have to have peace", "Well, that was predictable. Now do CNN viewers LOL", "On this day in 2012, Israel rejected a plan by Arab governments that enjoyed the support of the Obama administration for a major conference in Helsinki to discuss the possibility of a Nuclear-free Mideast. Almost every country in the world, signatories of the Nuclear Non-Proliferation Treaty (NNPT), backed plans for the meeting in 2012 or 2013. Israel rejected the proposal as “external coercion” and said it would not take part. It is one of only three countries not to sign the NNPT.", "Brilliant question to ask someone lol", "Palestinian woman are gorgeous", "When watching this I had the impression that most of the people kind of knew what the question was about and the ideology of an all arabic Palestine can not be questioned without getting into serious trouble and this was something that made the people really uncomfortable. Of course ideology is something of a false conscious, but in such a narrative there's mostly a hidden elephant in the room that no-one can really name but know it's there. If it's named and pointed out, the ideology would crumble and that's the reason that going against these narratives goes so much against the rules. 'it's to complicated', 'it's to political' were statements that where somewhat revealing.Remember this episode where they got asked about that Jewish temple on the temple mount under their mosque? From a archeological and historical perspective saying that it's a lie is as silly as to believe that the moon landing was staged. That's ideology in full effect to believe in such a grotesquely contradiction. But it serves a purpose: this particular narrative has a good amount of projective power to it, because in the end the arabic population of the contested territories (excuse me, 'occupied' of course) are since '48 in the bad situation that they chose the false leaders until now that don't give two shits about the well-being of their people, so the telling that someone else is the root for all their problems is something that makes allot of sense to believe in because it's the much easier way vs really solving the problems (like protest the shit out of the PA and kick out the oppressive islamic clericalism until a democratic and egalitarian foundation for the Palestinian society is reached).Just imagine this one thing: ask yourself what would happen, if the Palestinians would lay down their weapons?Next question is what would happen, if Israel would lay down their weapons?Where would the 'ethnic cleansing' really start?", "These two brothers and sisters will never ever agree until one day which is not anytime soon!!", "Elberfeld translation of Deuteronomy 251 If there is a dispute between men and they go to court and judge, then the righteous are to be judged righteous and the guilty guilty. (Deuteronomy 16:18; Deuteronomy 17,9; Prov 17:15; Isa 5:20; Clan 3:35)2 And if the guilty man has earned blows, the judge is to lay him down and have him beaten in his presence according to the number stipulated, according to his guilt. (Luke 12.47; Acts 5.40)3 He may give him forty blows - no more - so that if he continues to beat him with many blows beyond these, your brother will not be dishonored in your eyes. (2 Cor 11:24)4 Thou shalt not shut up the ox when it is threshing. (1 Cor 9,9; 1 Tim 5,18)to verse 1. This is how one feels righteousness with common sense.to verse 2. Small guilt less punishment and more guilt more punishment. There used to be corporal punishment for guilt. Today there is jail or fines or other punishmentsto verse 3. There is a maximum penalty and it also revolves around human dignity when it comes to punishment. 40 beats used to be survived, but probably not always. Nevertheless, the guilty man is seen as a brother of mankind from whom one cannot take away all honor.to verse 4. Now comes the leap of thought, before it turns to guilty parties and punishments. Now it's about animals doing the work. These beings have not committed any crimes but they work. It is the enhancement of stealing human dignity. Now they call people disparagingly stupid animals, these people take care of their livelihood and the livelihood of their families with their work. Now they are ordered to bandage their mouths (so that they are plagued by being deprived of the air they breathe. A kind of torture even though they are innocent). In 1 Cor 9,9 and 1 Tim 5,18 Paul already points out that it is not about oxen but about people. Here about apostles who deserve their wages for their work. However, this is not the only type of interpretation, although it is correct. In His Word God shows again and again something new that people learn and understand.If you no longer see people as human beings but as slaughter cattle (ox), this is an increase in the punishment (torture). Connecting the mouth fully applies to the present day. Go shopping and you will see a lot of oxen. God told people this over 3000 years ago and this prophecy will be recognized at the end of the day. God said that you shouldn't do that and people who order this do not do God's will, but the opposite of it. Satan only wants to kill, steal and destroy.But Jesus Christ is the way, the truth and the life. There is also a connection between the muzzle and buying and selling, a forerunner of the mark of the beast.,-.,-.,.", "Ask the same question to the other side", "Do you think YOU are brainwashed?", "the question is not even clear damn it", "Ask this to the Israelis", "Everyone is brainwashed regardless where you are from.. people will have their own views on things..  it is what’s it is…", "Everyone in the earth is somehow brainwashed by his family and community since he is child. Rare are the ones who do not follow and repeat what they taught them.", "Hundred percent right its palistanian land get out.", "Hidden and unknown information...Similar to an unread history textbook.Sometimes like a puzzle piece that fits an individuals concept of what they think the puzzle 'is', or 'should' look like when finished. Sometimes it is a piece that is to another puzzle entirely.Sometimes it sorta fits into a spot, but not really and must be set aside. Sometimes it makes one look at the puzzle entirely differently from a new angle. Sometimes it completely changes what they thought entirely about everything they had in front of them.History is complicated. Especially 1920 to 2020.The era when cults, 'magic', science, and war discovered, created, and destroyed so much. Hugs and good vibes y'all 💗🌈♎👽🤖🛸😎", "It's a good question you are asking but you should ask the question to the Israelis.", "Damn Corey that’s a ballsy question to ask.", "What stupid question is that? No matter what Is the issue or people you are asking", "almost all the arabs in judea have incredibly distorted views about temple mount. I was in the west bank in 2009, in ramallah and the villages nearby. The Palestinians simply don't believe that temple mount existed before al aqsa and the golden dome. this belief was widespread.", "Its interesting how they look like they are afraid to voice their real opinions.", "What a stupid question.", "RIP my IQ", "I don't know all the facts but I don't believe I am brainwashed because I've learnt in history of Israel it is called conflict however the history of Palestine called it occupation. I personally believe in peace so we can have equal rights and freedom.", "Ajaha why do you think that the Jews are better than that ??no betterand what are they really better?that's funny", "first guy LOL", "The women saying she is brainwashed and she thinks all that stuff about israel is not true was the only nice person in the video.", "Can the wrong answer earn a knife?", "I wish the lady at the 6ish mark would have said my spiritual discernment told her so. I can't relate to many people in these videos but.. I can hardly wait to meet her in Heaven.", "Do the \"chosen ones\" after. Same question. Now THAT'S a tribe with a lot of brainwashed people. They believe there is a deity that hands out real estate. \rCase in point: Shani in this forum. She unironically echoes what her rabbi tells her.", "\"We are not brainwashed.\"A video before:\"Tel Aviv is a Palestinian city called Tel Arabia and Jesus and Adam were both Muslim Palestinians.\"", "They don't need brain washing, they are literally living the facts.", "I have nice question, ask the Palestinians what they think about King Faisal"]}, "rOW12bTZlW8": {"title": "Palestinian: What song best represents Palestine?", "top_level_comments": ["I think Mawtini represents Palestinians.  I usually listen to English. Anything related to different languages.  Happy Rosha Hashana.", "Mawtini best represents Palestine. It is a wonderful song. Surprised only one person mentioned it.", "Without watching the video i already know it’s MAWTINI ✨", "Dido - thank you.Some how I could relate to the video clip", "Don't cry for me, PalestinaI never really left you..", "Palestine is in our heart", "It's kind of sad that this channel is supposed to give a positive insight about both people, which it actually does, but yet in the comments you see so often so much hate from both sides", "great job man, always enjoy watching your videos..keep uniting them.", "I'm disappointed by this comments section. Lots of petty fighting. Can't we all be better than this? Peace could happen, if only all sides were willing to swallow their egos.", "If you were asking refugees, it would undeniably be Ibrahim Touqan's Mawtini.", "Dude, I love your channel. I hope they won't kill you or take down the account. Thanks", "I think a song can't represent Palestine ❤️🇵🇸🇵🇸🥺", "❤❤❤❤", "Yasser Arafat & Hassan Salameh loved \" MAWTINY\" for Ibrahim Touqan.", "Songs of war from Palestine; songs of peace from Israel", "3:37 😍", "💙💙💙", "On this day in 2018, UN accused Myanmar of committing genocide against its Rohingya Muslims. Exactly a year earlier, the Israeli High Court had ruled on a request to release information on Israel’s arms sales to Myanmar. The court refused...", "Jamás de Camilo Sesto.", "such a good queistion", "I see Doron Kavillio is still undercover at 3.45", "You should open your Tik Tok account! I would really like tu upload some of your content there but it's your work :'(", "You dropped a bomb on me", "True history\rThe Roman general Pompey conquered Syria and Israel in 63 BCSome of the Jews rebelled against it,\r there was a people who invaded the Land of Israel even before the people of Israel left Egypt,\r the name of this people was \"Plishtim\" it is also written in the Bible.This people became extinct when\r the Romans conquered the Land of Israel.The name \"Plishtim\" In Hebrew/\"Paleshtina\" In Roman   Palestine?\r  This is a name that the Romans called the Land of Israel, to humiliate the people of Israel\rThey also called Jerusalem \"iIlya Capitolina\" and also the city \"shchem\" mentioned in the Bible, \rcalled it \"Niapolis\" .The biggest lie is Palestine. The name Palestine was called by the Romans when\r there was a Jewish majority in the Land of Israel.The Romans called it so in order to despise the Jews.\rThe name \"shchem \"  mentioned in the Bible is also called \"Niapolis\" . The Arabs call it \"nables\" \r. Because they do not pronounce the letter \"p\".There has never been a people called \"Palestinians\".\rThey all invaded Israel from Syria, Jordan, Egypt, Lebanon and more\r ...In Israel in Gaza and in Judea and Samaria there are families whose name is \"Al-Masri\" which means \"Egyptian\" in Arabic.\r The \"Halabi\" family means from the city of \"halab\" in Syria, and other such names that\r surely understand that they came from outside the Land of Israel, especially when Nebuchadnezzar\r king of Babylon exiled most of the people of Israel to Babylon (so it is written in the Bible)\r.There is no Palestinian nation, there has never been such a people, The terrorist Yasser Arafat decided\r to call it that in 1948To get public sympathy. ask who was the Prime Minister of Palestine ?! \rYou will never find.Who were her ministers?Where was the king's palace?The president's house?\rThe Prime Minister's house?Where was Parliament?What's her coin ?! Even if you ask every Arab in the\r world that he claims to be \"Palestinian\", what does the name \"Palestine\" mean ?! He does not know .\rThere is no such thing and there was not. Everyone who digs in the ground finds coins of the people of Israel,\r inscriptions, jewelry, graves, coffins, and more ...There is nothing and they have not found anything that belongs\r to a people called \"Palestine\".This is the reality, and whoever thinks otherwise has to prove it. The Arabs / Muslims\r have conquered the whole area.While the people of Israel were exiled from their land by the Romans.It is written in\r the Bible that the people of Israel will return to their land. And here after 2000 years as promised in the Bible\r, he returned to his country from all over the world,Everyone who kept his Judaism for 2000 years came to this country. \rThere are German Jews, Roman Jews, Austrian Jews, Egyptians, Yemenis, Moroccans, Tunisians, Algerians, French, \rSwedes and more ....And he who does not understand then I am sorry for him ... especially if he is a Muslim\r, because in the Qur'an it is written that this land belongs to the people of the book. (Bible)", "Looks like they're doing damn well in Palestine, all things considered...  😏", "God open my heart to love my cousins Jews,  true cousins by blood ( Abraham father).", "MY FAVORITE SONG IS\"IF I WERE A Palestinian id just say take everything ,i like to share\"", "The song where is the occubationAnd all time favorite i eat pizza three times a day and lts not forget the song i left my Ray-Ban glasses in my car", "'Midnight Oil - Beds are Burning'", "LUPE FIASCO WORDS I NEVER SAID", "LORD JESUS (YESHUA) IS ETERNAL WORD OF GOD and GOD In Flesh (Isaiah 9 : 6-7) , (Micah 5 : 2) ! THANK YOU YESHUA ❤️ .", "THANK YOU YESHUA ❤️ Isaiah 53 ❤️ !", "\"Don't go taking my House\"", "you dropped a bomb on me...Gap band", "System of a down B.Y.O.B  😎", "3:14 correct the translations, its not even close to what he actually said.", "Shariatube won't let anyone hear music in the future, thanks copyright! 😉", "Ana Dammi Falasteeni!", "Zahrat el madaen by Fairouz i think, hehe.", "🇾🇪❤️🇵🇸", "It's Dami Falastini for me", "you should see me in a crown 🥀♥️🇵🇸✌🏽👑", "\"Delusion\"", "Run to the Hills by Iron Maiden", "As a Palestinian there’s three.1- Anna dammi filistinie ( my blood is Palestinian)2- Mawtini (My homeland)3- Fida’i (Warrior)These songs explain the Palestinian mentality and identity better than any other.", "Why do u ask such these kind of weird questions?", "Jewrey Gil Shuster", "*GOD PROMISED*me a car in bible so now I am gonna steal it", "Uprising", "Mawtini", "Ask an israeli what they think about transgenderism", "\"Like a Virgin\"  by Modonna", "Long live Palestine! From an Iranian Muslim", "„checkpoint303 - Streets o Ramallah“  Song", "Songs about Israel,  \"This land is my land\"", "probably Hamas song: attack(read like \"monkey\") go do terror", "Song for Israel: Stayin' alive", "\"bomb in the pizzeria\"", "I do not think you want me to ask my question.", "AC DC - highway to hell", "Bomb bomb bomb let me hear you say wayo", "Jesus wins in the end", "A Blessed Shavuah Tov 💝💝💝And A Joyful, Healthy And Productive New Year To All Am Yisroel And Friends Of Zion 🍯🍏May the Jewish People continue to return, reconquer and reclaim our ancestral homeland of Eretz Yisroel.עם ישראל חי לנצח", "Free Palestine and Julian Assange.", "*_F R E E     P A L E S T I N E_*", "*_P A L E S T I N I A N     L I V E S     M A T T E R_*", "*\"If I don't steal your house then someone else will\"*Yaqub an Israeli Settler from NEW YORK USA", "Rivers of Babylon.", "Ana dammi falasteeni my blood is Palestinian", "\"Fake Land\" by Yakatora", "O Son of Israel, why do you join yourself to God as a partner? Why do you equate yourself with God? Isn't this an encroachment on the Rights of God and an insult to God? Isn't every creature, all of God's creation, God's servants? Isn't God Powerful over every creature? In such a case, isn't every being a servant of God?\rO children of Israel, why have you slandered God? If every creature is God's slaves, then how can God call someone gods, sons, children, etc.? Is it fitting for God to tell a lie (lie)? Isn't every creature a slave of God?\rO children of Israel, please answer my question honestly. Have any of you ever called your children slaves? Even though your children were stupid, disobedient, sinners, villains, they listened to you only for profit, or because they were afraid of you. Have you ever called them your slaves? - Of course not. How then can God call his children slaves? You talk about God that which is alien to you.In your Book (Torah), the God of Moses issued a verdict that he was His slave. \r“Moses, My servant, is dead.” According to your logic, God should have \rcalled Moses not not a slave but a super beloved son. But God made a verdict about him that he was only a servant of God.Why are you equating yourself with God? You will become aware of the fact that you are pagans now. And God does not forgive the Gentiles after death.", "What represents the Palestinians is their legal cause, their long struggle for independence and freedom, their strong resolve to resist a colonial project backed by the West.", "\"Suicidal bomber\"", "Israeli national anthem (The Hope): \"to be a free people in our land, the land of Zion and Jerusalem\"Palestinian national anthem (Martyr): \"I will live as a warrior, I will remain a warrior, I will die as a warrior - until my country returns\".Therein lies the difference between the two groups. One wishes for a better future for its people, the other wishes for an all out war.", "Hi aya 😅", "Ridiculous question 🙄", "We will win and we will free palestine", "Please ask what make the land belong to them both the israeli and the palestinient", "First comment", "\"קום תעשה ביגועים\" (Get up and carry out terrorist attacks)", "▪︎\"Imagine\" John Lennon▪︎\"Breakin my Heart\" Elton John▪︎ \"Lie, Lie, Lie\" Joshua Bassett▪︎\"Cry Me a River\" Justin Timberlake▪︎ \"Exit\" U2▪︎ \"Suicide Solution\" Ozzy Osborne", "and just when I thought the questions were starting to get better. Ok: Palestinians & Israelis:1. Do you eat pork? 2. How much of your movies/T.V. is Western?", "*Songs that represent Israel 🇮🇱 :**Hallelujah* - Milk and Honey*Jerusalem of Gold* (Yerushalayim Shel Zahav) - Naomi Shemer*Chai* (Live) - Ofra Haza*Shema Yisrael* (Hear O Israel) - Sarit Hadad*Hatikva* (The Hope) - The Israel Anthem*Mi Shemaamin* (Those who believe) - Eyal Golan*Rak Biglal Haruach* (Because of the Wind) - Shlomi Shabat", "It would be nice if someone make up a song starting with Death to Isreal, or Yiddish go home and leave us alone.", "Free Palestine from Turkey🇹🇷❤️🇵🇸", "*Fun Fact:* The so-called Palestinians stole Iraq's anthem. I'm not kidding. Just Google it. 🤦‍♀️", "For real, nobody like Palestinians", "Better than Berlin(not Palestinian)", "Most Israelis don’t believe in God, but they believe God gave them Palestine.", "There is no such a thing as \"Palestine\". Invented nation from 1964.Jews belong in Judea and Arabs belong in Arabia.", "Their favourite is \"Attack,  do terror attacks.\" (תקוף, תעשה פיגועים in Hebrew) by hamas boy band, it was their hit in Hard edge operation.", "O Children of Palestine & O Children of Israel\r\r\rO Children of Palestine, Why do you cry yourself to sleep?\rThe UN has abandoned you. The World Powers do not care if you weep.\r\rO Children of Israel, You were given refuge, why did you not accept it with a smile?\rIs it right, that if you are given an inch, you must take a mile?\r\rO Children of Palestine, You are in our hearts and mind.\rFrom the River to the Sea, be they Muslim, Christian or Jew, we must always be kind.\r\rO Children of Israel, Why do you indignify those you occupy and put Gaza under siege?\rYou talk of your right of return, but for the Palestinians, why not practice what you preach?\r\rO Children of Palestine, Have the Palestinian, Arab and Muslim Leaders also let you down?\rThe promised victory must be earned. Peace is the Child of Justice, the alternatives we must frown.\r\rO Children of Israel, When you were expelled and persecuted regardless of any Peace Accord.\rDid the Muslims never grant you refuge? For those with no gratitude, fear the wrath of the Lord.\r\rO Children of Palestine, where are the politicians or media that give a dime?\rWe must persevere with prayers and noble actions. Then the Lord will deliver a just Peace, as a sign."]}, "S0X1ZrspXCU": {"title": "Palestinians: How many have to die to free Palestine?", "top_level_comments": ["Critique: The question you asked was based off of a presumption. You presumed that \"Palestinians want to reclaim Palestine AT ANY COST\". \"At any cost\" is a very, very, very, hard presumption. I understand the goal with this channel, but if you want to be fair, then please ask much simpler questions that are not based off of such hard presumptions. Not just to the Palestinians, but also to the Israelis. Please........... just be more thoughtful and self-aware and critical with the questions that you are asking people.", "Zaid-the voice of reason.", "Welcome back to the cabaret.Your weekly dose of entertainment.", "Your questions are getting more and more stupid...", "Yes it's worth it even all have to die! at least the world will remember it's silence.", "Wasn’t Amar from Jerusalem in another video?", "Is it just the places you're going to ask these questions or am I amiss at seeing a rather healthy middle class among the Palestinians that others in the Arab world would be envious of?", "Such a weird and Jewish question. Should the Palestinians just accept that their children are being murdered and that they’re being kicked out of every home they lived in", "We hope peace and love and just for all", "Dude, Naram! That girl is awesome. Such truthfulness.", "Good format of the project but idiotic questions like this are compromising it", "1:30 توقعته يقول عندنا دين عندنا ايمان بالله ولكنه قال عندنا وطنية وهي اقوى سلاح ....؟؟ وهل الوطنية اهم من الاسلام ؟  هل جنسيتك أهم من دينك ؟", "50% percent or Bellow.😊", "Ask some better questions, Cory. That's why your views are going down", "- You can have half.- Allahu akhbar, everything![War, arab loss]- You can have a third.\r- Allahu akhbar, everything!\r[War, arab loss]- You can have a quarter.\r- Allahu akhbar, everything!\r[War, arab loss]- You can have...", "this would be my answer: For those whose blood has already been shed for the sake of justice/ Allah (swt), so that I can stand next to them in the day of judgment without hiding my face out of shame.", "Just give us our land back", "Life is very important remember you only have one Life,both sides need peace if you Sacrifice your life to freedom  you have not achieved anything you are inside your grave,that is not good idea.", "We’d rather die than live under occupation and oppression.", "Allah Honoured the righteous tru Islam.If we fight for Nationalism Allah will dishonour us.", "Will say it a good answer for you to Me if we make a war ad a palstenian if we will die for our land and belive the free palstain will back to us so I don't think so that we will lose alot because Muslims people have faith in victory of Allah for palstenian Muslims as the Quran (So when Tâlût (- Saul) marched out with the forces, he said, `Verily, Allâh is going to test you by (the ordeal of) a stream, whosoever drinks of it, he will not then belong to me, and whoso does not taste it, he shall certainly belong to me, excepting him who takes (only) a handful (of water) with his hand.' But they drank of it except a few of them. So that when he had crossed it, he and those who believed along with him, they said, `We have no power today against Jâlût (- the assailant, the Goliath) and his forces.' But those who held it as certain that they (one day) were going to meet Allâh said, How often a small company has triumphed over a numerous host, by the leave of Allâh! And Allâh is with the patiently-persevering.')So it's not about number it's about faith in the victory of Allah so we will win with a little number of victims so for all those people who said that we are afraid if you are afraid go out from this country before this day come true and I'm sure that you guys from this occupation power I'm sure you know that this day will come and all of you are afraid from this day So if you are afraid go our and ask forgiveness from Allah and if you trust what you heard from Your twisted book stay there and the true will come and face you or face your children or your your grandchildren nobody knows when but it will come and palstain will be free again from zionest that they are killer", "Ask questions and ask the Palestinians what they think of the North Africans  thet living in Israel,", "The right to seek justice and the duty to do justice are greatly emphasized in the Qur’an. Almighty Allah says,(O you who believe, be upright for Allah, bearers of witness with justice, and let not hatred of a people incite you not to deal justly. Deal justly — that is nearer to piety, and be careful of (your duty toward) Allah; surely Allah is Ever-Aware of what you do.) (Al-Ma’idah 5:8)", "The dark side of sarcasm", "better questions please", "Serious question.", "I think the Jews should leave the area here and go back to the places we came from and give them back the land, that everyone will come back from where they came from, that's the solution, There is no other way to leave to return to African countries to North Africa back, And just move on from here, it's theirs, and they'm not ready for any solution.", "I hope for peace between us ,  peace and love from israel 🙏🙏", "No occubation to be found", "Surely you need to ask the occupier when they will stop occupying? Palestinians can only be free when they have their own state without Israeli bullying.", "What a deep question", "gives me a \"I will sacrifice my life for pakistan\" vibes lmao", "His questions for the Palestinians are becoming more and more of a ‘did you beat your wife’ nature. The wording of the  questions seem to purposely put the Palestinians in a bad light no matter how they are answered.", "Sorry; can't help myself again but you have to just look at the \"poverty and the abject suffering\" of these people in such atrocious conditions in a refugee camp.   Where is this fabled \"historic Palestine\"  I note that no one has ever found it.", "\" You will leave and we will laugh. \" - Ahed Tamimi", "The silence of the international community klls the Palestinians more than anything else.", "HOW ARE THEY SUPPOSE TO KNOW", "Il faut demander Hamas!!", "Very stupid question", "Shalom Salaam Peace  ✌️", "The question itself is wrong", "it is a weird question and offensives man.", "I used to watch this earlier on weekly basis", "In the name of Allah The Most Gracious, The Most Merciful to the believers,All praise and gratitude is for Allah,Peace be upon the one who follows the clear path. I invite to the true religion of The Creator of the heavens and the earth. Allah is One. The only one who is independent, all-powerful and the only one who is Unique. Allah has no sons and no daughters. The Creator is the most high. Nothing and no one is worshiped in truth except Allah. Allah is eternal and in need of no one, we (the creation) are dependent on Allah. The one who sent the prophets with the message: \"To Only worship Allah, and do not worship any false gods/goddesses. Do not associate parnters with Allah.\" The prophet Muhammed peace be upon him is the last prophet of Allah. Allah didnt sent the messenger Muhammed for a specefic nation but for the hole word until the sun will rise from the west.  (A sign from the signs of the Day of judgment/The Hour/The end of the test.)Because when that happens no more repentance will be accepted.Interpretation of the meaning of the Original Quran91:9/10Surely the one who purifies it (the soul) (from sins) will prosper.And surely the one who corrupts her (by sins) will lose.2:256There is no compulsion in religionThere are those who tell lies about Allah. The Truth has come and falsehood has vanished. Falsehood is surely bound to vanish. The truth is from Allah the only Creator. The last revelation is from Allah is in the Quran and the authentic hadith (in Unique Arabic). Allah preserved the last revelation (sent to The last messenger Muhammed (pbuh)). There is only 1 Quran and not a letter has changed,  And the sayings of the prophet (pbuh) are also preserved.Www.Quran.nl", "The question itself is wrong. Nobody knows how many would die to liberate Palestine. It's not about the number..it's about freeing your country from occupation at any cost. Whatever the number is it would justify the number once you free your country. They are fighting for a cause. They fighting against oppression.", "many times the interpretation is really not accurate in many videos.", "Always choose the HOTTEST to interview🤤🤤🤤🤤🤤", "10:11 \"whether we are a man, woman, elderly or child\" says the trst ex\"detainee\" ... nice of him to point out how any of them could be a trst.", "Another stupid question!", "I do t blame the Palestinians one bit. However the Jews could say to them let’s go back to 1948 agreement. That would be fair enough but I also think Jordan should never have been sectioned off in the first place", "al Aqsa will be free one day i have no doubt abou that.", "The question should read how many non Jews must die for the Zios to be a Chosen People?", "Siz onu toprak satarken düşünecektiniz yada İngilizlerle işbirliği yapmadan önce. I support Israel💙", "Governments need to make things better and people won’t protest.", "Freedom has a price the price is our blood , palestine will be free even after 100 years", "“We all have to die.”  Oops, got to go. Time for me to head to Israel so I can get a job.", "I am a but disappointed tbh I didn't find a proper answer from any of them, I wish if any one made it clear that the Palestinians are not fighting alone the Palestinian land conflict is not just a Palestinians problem its a whole Muslims nations 6 million jews vs 1.9 billion Muslims war so I don't know what this blogger mean by \"how many more people should die\" ask the zionists  if they ready to fight 1.9 billion Muslims 🤔", "Either a federation or two states with some monetary reparations for the Palestinian homes lost in 1948 seems like a solution. All fundamentalist organizations must disarm in any case.", "Six times they have rejected a country. Name one other people who have rejected a country once?", "MAJORITY WINS", "\"Allah has decreed, “I and My messengers will certainly prevail.” Surely Allah is All-Powerful, Almighty.\" [58:21]", "\" GIVE ME LIBERTY, OR GIVE ME DEATH\"", "I appoint flannel shirt guy to solve the problem he is in the right track and I agree with him.Peace would be nice but when Israel takes land its not a sign of peace", "You are not solving problems but complicating others. every content you ask about religion you ask about conflict. Palestinian people are suffering. Please", "13:59  - note that she is speaking in ARABIC and not in the \"historic\" ethnic language of Palestinians.", "less than the people dying under the occupation", "Ask them about *Pallywood.* 🤣🎬", "You could go to Afghanistan now and ask the question.You could have gone there a year ago and asked the same question.", "3:18. She's so good, good spirit, lovely heart. I like her answer the most. I don't really like this question though, you can't really give an answer to this, I'm Canadian, one life is too many. We must find a way for Palestine to be free. #FreePalestine", "If they die, they die.", "Tell that to H@mas'and hezboll@", "UNRWA teaches this in all the schools. Go back to the 1695 census, there was never Palestine.", "The Britz were given the mandate to [re]establish a Jewish homeland, then gave most of it to Arabs. Plus they have a beach front trst base at this point. That's more than enough. The rest is Israel. If they didn't want it that way, they should have accepted a state the many times offered, instead of attacking. Their poor and hostile CHOICES are no one's fault but their own.", "A perfect picture of madness", "100% i hope.  All for the british mandate! Rule britannia! Yay!", "Farfour, I have the keys. I have the deeds. Let us in. Lol!", "Will be interesting to see Cory’s grandchildren carry on this project and see the Palestinians using the same rhetoric in 70 years time while their lives go nowhere.", "Next video ask Zionists\"How many Palestinians u will kill\"", "Corey I know what you did there😌 The question is the same as \"Why Afghan men ran from their country and leave the women?\"😌 Well played Corey, well played 👏👏👏", "💙🤍💙A Blessed Shavuah Tov To All Am Yisroel And Friends Of Zion 💙🤍💙", "\"We know too well that our freedom is incomplete without the freedom of the Palestinians.\" — I've seen this a lot.  But even Nelson Mandela who was deeply supportive of the Palestinian struggle for independence, never deviated from his view that this could only be attained through all parties recognizing Israel's legitimate right to exist within secure borders.  I personally do not believe in 1-state solution or 2-state solution, if there is no communication.  Dehumanization has to end on both sides.  There's no future reality without both population finding a way to live together.  Palestinians won't disappear, Israelis won't disappear. \"The only way for us to move forward is not to focus on our governments telling us what to do, but from the population, from the ground up to be able to build relations together and have a vision of what type of future we'd like to create.\" - Rudy Rochman.", "Jacob 2021 logic dominates the minds of the Israelis if I don't steal it someone else is gonna steal itAnd now this stupid question Which is better, freedom or death?", "AM YISROEL CHAI LE'NETZACH ISRAEL 🇮🇱 LIVES FOREVER FROM THE JORDAN RIVER TO THE MEDITERRANEAN SEA", "A colonizer telling the native dont fight for your liberation for your own sake...How classicThe correct universal answer for any nation is: If peacefully option is not available, then as many as it needs...but when choosing the best timing and prepare for the best outcome", "The English questioner clearly presents a bias when framing the questions and how he words his responses and follow up questions. It takes the attention away from the subject and puts it on the questionnaire, which is very counterproductive. The goal is to understand the feelings, emotions and rationale of each individual's answer to an already loaded question. Instead thd audience is forced to listen to interjection and in some instances, twisting the meaning of the responses to present an unfavorable narrative to the Palestinian struggle for freedom and self determination.", "Cuz is wildinnnnnnn 🤣🤣🤣🤣🤣🤣🤣🤣🤣 my perspective on the Muslim world has completely changed", "FREE PALESTINE 🇵🇸🇮🇷✌❤", "Falling in love with martyrdom has become normalized in Palestinian as a viable ideal that will optimize one's own creation or destruction. If only ........?", "Was gonna suggest how many MEN would be better but then I listened to the end...", "all of them pls", "Beyond individually owned properties, NONE of it was EVER \"their land\".", "*'We know too well that our freedom is incomplete without the freedom of the Palestinians*Nelson Mandela", "We can all safely say, you did it to yourselves. You had a chance - many chances - to make peace, but all you did was deception upon deception. At least Miliekowski is out, thanks be to God.", "Does the man at 14:00 believe that the UN partition offer was a never ending possibility? The Peel Commission partition of 80% of the land was turned down, the UN partition was turned down,  how many times have the Palestinians turned down land for peace? Over 5 separate times in over 80 years.", "Brave for those who have answered. You just made some of these people potential targets", "die is not a option for even one person its stupid way to back your land with blood money is the key thats whats makes jews strong even this vloger makes money from an conflict. just when the life gives you lemons start make your lemonade dont complain always there is a way for succes but until you let the rich people making money from an conflict there will no have such a thing as peace or freedom", "Nonmuslim logic Apartheid southafrica bad apartheid Palestinian good", "you can't free something that was never a country", "Surely, the victims can't answer that? It depends primarily on how many the occupying aggressor is prepared to kill.", "8:20 \"We are under occupation\" saying the guy that walks free while saying that they are sacrificing their life's while not realizing that they are terrorists"]}, "1QqGDnQfEA0": {"title": "Palestinians: Would you speak to Transgender people in the gender they identify as?", "top_level_comments": ["This will be off topic but Arabic sounds so good, I feel like I can listen to it all day without understanding a word.", "The last lady sounded like a historian academic. This is a good thing. Knowing our history matters.", "Shout out to all the people who saw the video where this same question was asked to Israelis and commented \"i bet corey wont ask this to palestinians xD xD xD\".", "Anyone else fondly remember the time when Corey used to post TWO videos a week?", "Interesting how many people would respect the chosen gender but believe that no one else would.", "Poor Corey makes it all too confusing by mixing up English and Semitic grammar.Whether you call the person he or she is when you are speaking to them is plain wrong.  When you are speaking to a transsexual person the question is whether you would say you (masc) or you (fem) and use the corresponding gendered adjectives, nouns and verbs, whether that is in their new or old identity.  He/she are for when you are talking to someone else.If you walk around looking like Corey and say you see yourself as a woman, I don't think anyone will buy it: they will use masculine forms.  But, if you were born a woman and transitioned so that you NOW look like Corey I don't think anyone would insist on the feminine forms, even if you walked around wearing a T-shirt which proclaims, \"I was born a woman but now I am a man\"!", "Good video. And thanks for asking both people. Many are ignorant about Palestinians and Israelis. Not everyone is the same.", "That's super theoretical question cuz trans people would not survived there, so it's more a question of how they will address a foreign visitor who is trans.", "I'm actually surprised by the answers. The majority in this video would respect the pronouns but don't believe that others would.", "Ask those that work construction - life under the sun is different than inside the regulated room.", "You should adjust your question (English) for those who don't speak it fluently. Interesting topic though.", "2:20 Rinat try to lower her voice, maybe to not disturb anyone, and Corey shouts 🙄😅", "I'm surprised it's much more open minded than expected", "It makes sense that most of them said they would talk to them in the way they (transgender( wants only because they dont want to start problems with them", "I don't mind speaking to others how they prefer to be spoken to if they ask politely. I do mind if I am forced to on pain of losing my job or similar.", "@7:18 she said “in general, I would try to avoid them because I’m scared of *personalities* like that” I think here she’s implying that transgender people, especially in a repressed Islamic culture can be unpredictable, reckless and not safe to be around so she wouldn’t want to connect with them. The idea of sex is frowned upon in most Islamic cultures (lots of taboos around even heterosexuality let alone LGBT) so to see someone openly oppose that and declare themselves trans usually indicates that they aren’t socially adjusted and could be trouble. She later goes on to say that she would avoid them too because they might change back to the gender they were born as especially addressing male to female transwomen.", "The first person said he would avoid them. I think it's right and not right because, ok, in this case you don't piss one's off, but if you avoid them, they will think he's disrespectful or rude.", "I wonder if Palestinians  know of Dana International, the most famous Israeli Transgender person", "a real businessman addresses the people the way they want. bad customer service is less money. it's also nicea person who is new to the transphere would use they or not use pronouns at all (definitely not referring to myself or anything)", "What if someone is of the persuasion that, the post-op trans hasn't actually changed their gender, but rather merely mutilated their genitals in a vain attempt to affirm their dysphoria? How would you phrase the question through that lens?", "Palestinians are mostly lovely people. Even when they don't like the ''transgender idea'' maybe due to culture or personal matters, still they are always like ''yeah i do not agree but i'll treat that person the best i can even tho i feel unconfortable with it''.That's what respect means.", "There is a fine line between mutual respect and treating others as human beings, and feeling like you're being \"dictated to\" and told how to think just to make the other person feel comfortable. This is why many Corey interviewed would avoid them. I grew up in Cali. so I met many different kinds of people. I try to show respect while also maintaining the right to my own POV. (PS..One of the professors at my undergrad uni (male) just liked to walk around wearing a purple dress and matching purse. I think he did it just to get a rise out of people (dude had a beard)-compared to many trans individuals who like to enjoy the music/worship at my church. They were dressed \"to the nines\" with hair/make-up..everything. Very respectful. Very nice.)", "8:34  his words hit's the reality .✔", "What's that quote by Noam Chomsky? “The smart way to keep people passive and obedient is to strictly limit the spectrum of acceptable opinion, but allow very lively debate within that spectrum....” Applies to this silly little video.", "I love you Brian", "Love your channel, butI would have waited for the cop car to drive by before beginning or just not use it in the video.", "9:22 How do you verbally beat someoene Corey?", "This whole concept is confusing, I like the first answer where he said he just wouldn't converse. And it is not a cool thing to be confused about your gender, so for anyone who thinks it is cool for a man to walk into a woman's washroom cause he identifies him as a woman, then you are crazy and have lost the plot.", "Palestine is about as developed on this movement as my small Midwest town lol", "You asked mainly young people…. Your reaction was way too positive if supposedly reflecting the population. Love your vids but just being real", "To address someone in the gender that they see themselves as is a lie.It's also is blasphemy I would be calling God a liar.The bible said all liar will find their part in the lake of fire that burns forever", "That also assumes that the trans person is \"obvious\" If you are NOT obvious, it's not an issue.", "Nice video", "Young people are rad", "In my opinion I would never disrespect them but if that person told me I wouldn't call a man a woman if he was born a man that's just my opinion. But like I said I wouldn't disrespect them and I know some people will say by not calling them what they prefer is disrespect not in my eyes because I live by the truth.", "I would ignore a transgender person", "Half of this video is loud sirens and horn honks", "You aren't open minded you should try some 💩 lipstick,  I think it's great..", "I'm ashamed to say that I'm surprised that you found so many open-minded people. Interesting that the most articulate and accepting were three young women. Fascinating video. Thanks.", "MIRACLE OF GOD The quran was written in 7th century Arabic. The Quran is the meaning and it is not confined to one language. The purpose is to understand and it can be in any language including anyone's mother tongue.Al hayat” (life), 145 times; “al mawt” (death), 145 times“al-dunya” (mundane life), 115 times; “al akhira” (the afterlife), 115 times“malaika” (angels), 88 times; “shayatin” (demons), 88 times“ar rajul (man), 24 times; “al mar’a (woman), 24 times“as salihat (good deeds), 167 times; “as sayya’at” (wrong doings), 167 times“qul” (say), 332 times; “qalu” (said), 332 times“an nas” (people), 50 times; “an nabiya” (prophets), 50 times“al muslimat” (Muslim women), 41 times; “al muslimin” (Muslim men), 41 times\"yawma-izhin\" (That day), 70 times; \"qiyama\" (Judgment day), 70 times\"dunya\" (near), 115 times; \"akhira\" (far), 115 times\"shitaa\" (winter), 1 time; \"sayf\" (summer), 1 time\"Isa\" (Yahushua), 25 times; \"Adam\", 25 timesIblis the devil is mentioned 11 times and seek refuge from iblis the devil is mentioned 11 times.Belief and disbelief 17 timesClay (teen and sperm (nutufa112 times (how ALLAH says he made us) Charity (zakat and blessings (baraka same amount of times.The words \"Sea\" and \"Land\" are used 32 and 13 times respectively in the Quran. 32 plus 13 equals 45, and the two words make up 71.1 and 28.9 percent respectively of those 45. These percentages roughly correspond to what we today know the proportion of the Earth's surface made up of water and land to be.\"Human being\" is used 65 times: the sum of the number of references to the stages of man's creation is the same:al-Fatihah in itself has 7 verses, 3.5 dedicated towards our praise of the Omnipotent, and the next 3.5 dedicated towards our prayers to the Omnipotent.The words “salawat” (prayers) and \"aqimis-salah\" (establish prayer) are mentioned 5 times in the Quran, the same as the number of mandatory daily prayers.The word \"alwan\" (colors) is written 7 times, the same as the number of colors of the rainbow.The words \"samawat\" + \"sab\" (heavens + seven) are written together 7 times, the same as the number of heavens described in the Quran.There are 365 days in a year. The word \"yawm\" (day in singular) is written exactly 365 times.Muslims circumambulate around the Qibla, seven times during pilgrimage. The word ‘Qibla’ is used in the whole Quran exactly seven times: 2:142:8, 2:143:15, 2:144:8, 2:145:10, 2:145:14, 2:145:18, and 10:87:12\"https://youtu.be/Fb92bx1kYYUwww.google.com/url?sa=t&source=web&rct=j&url=https://en.m.wikipedia.org/wiki/Symmetry_in_the_Quran&ved=2ahUKEwjC8KWIgbjxAhULQEEAHThcBFwQFjAAegQIAxAC&usg=AOvVaw0fvhfLuAaW4M9JHqnXti5h&cshid=1624803774708", "This question leads to nothing. One should focus more on useful things that benefits himself with his Creator Allah SWT.", "just do not ask the clerics about this", "Next question to Muslim Palestinians: Would you marry a transgender?", "Damn 🤣 the guys had the harder time expressing themselves 😏", "Ben shapiro is gonna be mad", "The girl who says she doesn't know anyone trans but she has gay and lesbian friends who she supports when nobody else does, I love her.", "Lot of people may not realize Palestinians are very exposed to the outside and to different ways of life  especially Europeans . Basically,  nothing shocks us compared to other conservative societies.", "In arab world i am sure most middle east dont know what transgender is. I didn.t know until now", "They would accept them. Without experiencing it? Kinda like how people vote blue but dont live in blue states", "Question: \"In 20 years, if someone identified as a dog and wanted you to pet them, would you?\"", "The translater is good", "Serious question, is there an arabic word for transgender, was it hard to translate this question ?", "In the name of Allah the benefactor, the most merciful,He is Allah is One, the Sustainer, Independent and Most high. Allah has no gender Allah is unique. Allah is the greatest. And there is none comparable to Allah. I invite u to the true religion. The clear path our creator has shown us. Allah sent al the prophets with the same clear message \"worship Allah alone and don't associate partners with Allah and follow us (the messengers) (peace be upon them)\"  The Truth has come and falsehood has vanished. Falsehood is surely bound to vanish. When they are in a sinking boat in de middle of the ocean the disbelievers call upon Allah, and when Allah brings them back safe to land there are people that associate partners with Allah. Peace be upon the souls that follow the guidance of their Creator, Allah.  [Interpetation of the meaning of the verses]Quran 91:8/10and inspired it [to know] its own rebellion and piety!The one who purifies his/her soul succeedsand the one who corrupts it fails.{And I did not create the jinn and mankind except to worship Me.} [Quran 51:56]• {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taaghoot.} [Quran 16:36]• {And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.} [Quran 21:25]InterpetationWww.quran.nl", "Both in the Israeli video and the Palestinian video most people said that they will, and had a positive thought about the transgender community.But what's interesting in the Palestinian video is that most People have no problem with transgender culture, but they think that other Palestinians do have a problem. Interesting.There was a research a few years ago saying that 97% of Palestinians do not support the LGBTQ+, but this video proved it is wrong. It seems like most Palestinians are open minded and accepting after all. It's good to hear that. Let's hope for peace and coexisting between the two nations.", "Cory you gotta do a video on the topic \"What do Jews think of John the Baptist\". I think that's an interesting cross-over", "Questions like this is a waste of time", "Please ! don't record when there is some  alarm ! don't do it again please xD", "Thankfully, we don't have any gender cases in English like they do in Arabic.  As for me, pronoun-wise, I address almost everyone as \"you\".  What I call them behind their backs is none of their business.  :)", "Always asking the important questions Corey.Thanks for the nuance.", "Lol ) I identify myself as a king of universe , call me your majesty only and naever call me an idiot, ill judge you then ))", "Not surprising. Religion divides.", "As an arab trans queer person im so thankfull that rinat is excisted. I love you rinat thank you 💜", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "Ask Palestinians who is Muhammad Ali and what they know about him", "depends on their appearance. i won't call a person wearing hijab with \"sir\".", "2:42 I’m a Jew but fell in love with Balsam 😍", "I remember in Bangkok 2017 I was going through Sukhumvit Soi 4 which has a side dominated by Arabs in terms of restaurants and shops and I saw this drunk Arab say to two ladyboys ‘you and me, my hotel’ with no shame despite being surrounded by other Arabs. Of course he could have chosen a CIS female as a companion quite easily as it was lower Sukhumvit. He wasn’t ugly or anything, just a normal looking guy. Glad he got to experience life outside the confines of a repressive culture and religion.", "I agree with the Guy at 8:44min. One is either born as a male or a female accept the way God created u its ungratefull unthankfull to God changing your gender.only original male and female brings Forth new generations..God made is that wat according to His Will.", "12:30 this guy isn't from Palestine.. I don't know if he counts and I isn't hear where he said he was from originally.", "Unfortunately, the transgender issue was mingled with the other LGB. The definition of your reality as a man/woman comes mainly from the brain itself (and from the structure of the body), thus we find some men, who are describing themselves that they are women locked down in men's bodies and vice versa. The Islamic scholars 1400 back did a marvelous job when they studied the she male, and the share of it in the legacy as an heir. Meanwhile, there's a Fatwa \"religious opinion\" for Khumaini that they adopted in Iran, which I totally agree with, by giving the approval to men/women to trans their gender to avoid homosexuality, as some gays might practice such an activity due to their feelings inside as women. In Egypt recently they started to accept arranging these surgeries after exposing the patient to some tests and checking him by a medical committee until they are sure that the surgery is going through the right way physically and mentally", "Im really thankful to the translator that explain really well she is better than him", "Corey is running out of questions  to ask now", "So for all of you in the comments last week wondering if there'd be a Palestinian version of this question, well, here you go.", "This video definitely took me by surprise and exposed my implicit bias (e.g.. all Palestinians would tow an ultra conservative viewpoint) Gotta give luv to my trans folx, they were they one's who had nothing to loose, the first to throw those stones at the Stonewall Riots. After, all homophobia is wrapped up transphobia....One need not look any further than folx in this video who referred to folx sexual orientation..", "קודם שאנשים מהקהילה הגאה יוכלו לחיות ולעבור בשטחים בחופשיות. אחרי זה תשאל אם הם יקראו להם במין שהם בחרו.. (היו תולים אותם על עמודים לפני שהם היו פותחים את הפה).קל להגיד כן ובאותה נשימה להגיד בחיים לא ראיתי אחד.. כי כולם בורחים לישראל. המקום היחיד שהם מקבלים בו מקלט ומרגישים בטוחים.צביעות של מוסלמים עולה על כל דמיון..", "ايه دا يا فلسطينيين ؟؟؟؟؟؟؟؟؟؟ نص اللي في الفيديو مع الأشكال دي بجد؟؟؟؟؟ الله يهديكم وأنتم علي أرض مقدسة فيها مسجد كان أول قبلة للمؤمنين، علي الله حسابكم", "You guys don't understand how this pronoun nonsense is very much an Anglophone phenomenon. The entirety of Modern Standard Arabic and all its dialects from Morocco in the West to Ahwaz in the East are inflected in either masculine or feminine. Every single verb has a masculine or a feminine morphology. What would these nonbinary people's pronouns be in Arabic??? The introduction of just one pronoun means you have to create hundreds of new morphologies for the tri-consonantal root systems in Arabic (and even in Modern Hebrew).Gender is absent entirely in English (except in the conjugations of the third person pronouns but even then the words \"it\" and \"they\" may be used to refer to a \"nonbinary\" gender).What about languages like Turkish in which there is a single pronoun for \"he,\" \"she,\" and \"it.\" Do you need your own pronouns then???Please, if I am not making sense, someone should correct me.", "9:39. Why didn’t you translate accurately and ask if he will hurt them? If my child would want to transition, I would whoop them also and I’m a Christian.", "Murdered for sport in paliestine. Speaks for itself.", "The first guy got it right, just avoid them. Based.", "Apparently language matters so why would I call a horse a cat or colour red yellow?", "i remember some lgtbq+ people supporting \"palestine\" - seeing some reactions here that video is hilariousthanks corey i hope the weather isnt too hot ;-)", "This was kinda surprising. It's nice that there are so many people who would accept it even though there obviously are a lot that wouldn't.  I'm trans so it was interesting to see both Israelis and Palestinians answer these questions.  I know the translator used the wrong pronouns sometimes, but her job is to speak in a way where she will be understood, so I can see why she did that.  It'd be so cool to read that interviewees paper on LGBT issues in Islam.  This was very interesting!", "*GOD PROMISED*me a car in bible so now I am gonna steal it", "That woman at 1:40 seems so educated, smart and open minded. Good on her.", "Those who can make you believe absurdities [i.e., that you are a woman trapped inside a man's body], can make you commit atrocities [i.e., mutilate your own body undergoing a \"gender reassignment\" surgery]", "Corey, please can you ask Israelis and Palestinians of a wide variety; if you had a crush on someone you didn't know was transgender, would you still have a crush on them after you find out they are transgender?", "Why doesn’t Corey ask Zios questions like’ would they like to see the IDF to carpet bomb Gaza. Would they like to see Al Aqsasqa   mosque", "Arab countries are a transgender or anti-lgbt community, but research shows that same community watches gay porn the most.", "From Ibn ‘Abbas R.Anhuma, the Prophet PBUH said:‏لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ\"The Prophet PBUH cursed effeminate men (mukhannathan) and women who imitated men.\"Sahih al-Bukhari (5886", "Focus with me hahaha", "Off topic:  Happy Independence day, India!   ❤️ 🇮🇱 🇮🇳 🥳  🎉", "Ask Israelis: do you think that you represent the West in the Middle East?", "Free Palestine 😎", "If I had to put an age on Corey, it would be about 45. And Mon Amie, 25.", "*Free Judea!* 🕎", "This video should be shown to all LGBTs all over the world that support Palestinians.", "Trans people are amazing. You are loved. 😀💜", "It would have been interesting to bring up Shia Islam's interpretation of transgender people. While conservative Sunni Islam views transgender people in a negative light, Shia Islam recognizes them as valid. Iran for example despite having the death penalty for gay and lesbian people allows for transgender people to exist openly and has the most gender reassignment surgeries in the middle east."]}, "jxkdbLCTZlk": {"title": "Palestinians: If Muslims are one nation why are they indifferent to the Palestinian cause?", "top_level_comments": ["There’s a temptation to think that the group you’re in is United - Jews as one , Muslims as one, etc - but that isn’t how humanity works.", "If Muslims are one nation, why are they indifferent to the Uyghur genocide?", "Corey don't use words like indifferent when asking non-native English speakers these questions. Chances are most of them don't even know what indifferent means,  I mean the guy at 3:30 said \"all people are different\". These are words only native speakers know, you tend to use words and expressions that are too advanced for these people, many of whom have a basic grasp of English. I'm Greek and if you came to Greece asking the locals a question with the word indifferent, most people wouldn't know what you mean.", "Because they all have their set of problems sometimes even greater than the palestinian's one in their own country", "Because everyone cares about only himself and his interests.Thats the reality of our world", "The loyalty of the Arabs is given first to the close family. After that to the enlarged family. After to the Hamulah, families of the same ancestors. Then to the tribe and the country is coming at the end.", "i dont have a question i have a wish that all people in the world have peace and unite for love  thank you my friend for your video", "If muslim are one nation ,than why are muslims so indifferent to Uighurs?🤔🤔", "الشعوب الاسلامية العربية كلها متضامنة مع الشعب الفلسطيني وتتمنى ان تساعد لكن المشكلة ان كل الدول العربية محكومة من قبل اشخاص غير ممثلين لشعبهم لو الامر ترك للشعوب وليس للحكومات لم تكن لتوجد اسراءيل من الاساس", "Hey Corey, are you still doing Ethnicity in Israel? I would love to see more", "No Muslims are not one nation. It's just the oxymoron made by the old caliphs to collect donations and talent from Non-middle eastern Muslims.", "When I watch these programs, what seems striking is the state of the infrastructure, the stores, the fashionable, well kept individuals, the cars in the street and the general well being of the individual.  Not saying that there are no problems, but put in context, the West Bank seems to be a lot happier place than Jordan, Egypt, Syria and even Lebanon today.", "Muslims are not one nation ! It's a religious entity but not geopolitical one , it's like saying Romano-Greek nation or Christian nation ...it's no sense !", "Because we're tired of helping Palestine in this fight that has been lasting since forever. 20 arab countries can't defeat one israel and you ask us turks to do it instead.", "The answer is money. All religions and beliefs are superseded by money.", "99% of countries look after themselves, as human beings we are intrinsically self serving. That’s not too say we don’t care… we are proving this by watching Corey Gil Shuster… top question today", "* Between 1922 and 1948, it was control under British Mandate, called Palestine - That is the name of this land when it was given to you by the British. * Before between 16th and 20th century it was under Ottoman Rule, it was called Kudus I-Sherif (Jerusalem), Nablus and Akka (Acre).* Between 13th and 16th century During the Mamluk Rule, it was called Falastin, as part of Bilad al-Sham (Syria-Palestine). * During the Crusade, it was referred to as the Kingdom of Jerusalem by the Western Christendom (the princes in communion with the a Roman Catholic Church). * During the Ummayad and Abbasid Rule between 7th and 12th century, the land was called Jund Filastin, with Gherussalaim (Jerusalem) as capital. Hence the Masjid Al Aqsa * 400 AD to 700 AD; During the Byzantine Rule; it was divided in three districts: Palaestina Prima, Palaestina Secunda, and Palaestina Salutaris. * During the Roman Rule, 70 AD - 400 AD, it was called Syria-Palaestina, with the capital in Antiochia. * During Herodian Rule, between 40 BC to 70 AD; It was a Tetrarchy of Judea, a client state of the Roman Empire.* During the Hasmonean’s rule (160 BC to 40 BC), it was called Judea & Samaria. * During the Greek Ptolemy and Seleucids Era (350 BC to 200 BC), it belonged to the Hellenistic Egypt and the Seleucid Persian interchangeably, the entire land was called Palaestina (it is a Greek name).* During the Assyrian, Babylonian and Achaemenid Persian rule (8th - 5th Century BC) - it was called Yehud Medinata.* After the myth of Exodus, and before Assyrian and Babylonian rules: It was called Kingdom of Judah and the (North) Kingdom of Israel in Samaria (hence the Samaritans Jews). The tribes of Israel were not yet Monotheistic; So nobody can claim Jewishness, or a Jewish Identity from this era. * Before 1000 BC; Canaan, belong to the Canaanites. Canaanites were the people whom Yahweh, the God of the Israelites, have asked to murder and pillage. Its capital was Jericho. * NOTE: Only for about less than 230 years the Jews could call this region as their country WITH Jewish Identity. As an Independent State during the Hasmonean rule, and as a Client State of the Roman Empire during Herodian Rule; Between 160 BC to 70 AD. The Roman and the Ashkenazi Jews were the only people who tried to expel the native of this land, in 70 AD and 1948, respectively. By contrast, upon conquering this region, the Achaemenid Persian (Iran), not only gave back this land to the Jews but also sponsoring the building of the Second Temple in 514 BC; because the Persian wants to built a “buffer zone” on the border with the advancing Greek.", "Both the PNC Charter and the Palestinian Declaration of Indepenence say that the Palestinians are integral to the Arab Nation. Contradiction!", "The answer is very simple, when you have good living conditions you care less or don't ask your leaders that steals your money! They are the perfect exemple haha funny how they are not even mentioning it too brainwashed I guess", "every soul trembles for palestine.", "Well, @coreygill, you cannot say that muslims do not care about Palestinians. We really do care, I am from european country and here everybody talk about them. We care and they are constantly in our prayers, but thats political thing and also the media. I mean, who would not feel abandoned with circumstances like that? But yes, politicians abandoned them, not the people. Palestinians, we care about you and think of you. While waiting for better days, Corey should interview people outside if he is able to. Peace to everyone ✌", "Sees the first girl. Alright I'm headin' to Palestine. Love not war.. <_<edit: So in short, they're just people who are busy and stressed out. Everyone's busy worrying about Covid, and the mainstream news sucks. They aint wrong.", "We have a channel dedicated to this topic. Corey - you are invited to join our discussions.", "One answer that I didn't here  from people interviewed  is  also that \" Muslim Nation\" ( If that came to actually exist one day) is not suppose  to be Palestine, Saudi Arabia, Turkey  or any Muslim country.! The  nationality of different people from different countries in the world and  the faith they have in a certain religion you could say are two complete different things sometimes.  As for the Israeli-Palestine  thing, me as a muslim from far a way land  could definitely say that  it is  much much more a political issue that \" happened\" to be : Jews vs.Muslims ... but, in it self, especially now days it has nothing \" holy \" in it as an issue  and I hope soon one day you will come to live as good neighbors with love and  respect for each other. :)", "This question is quite off", "The Ummah is more then aware. Politicians and governments are another story. Case closed.", "Amar ❤️", "Urud Ramallah you are awesome 👏👏👏", "الشعوب في الربيع العربي حاولت بجد إزاحة الحكام الفاشلين. الدول الديموقراطية هي التي تدافع عن مصالح الشعوب. اما الديكتاتور فلا يهتم.", "6:00 هسه الخليجيين رح يستلمونا بتويتر 😂😂", "I am someone that looks like an Arab, despite the fact that my father was Israeli Jewish. It's not that the Muslim countries are indifferent to Palestinians. They're just bigger at hating Israel or Jews. Overall that's been my experience with many exceptions of course.", "Its so boring when people all the time blame media for everything. It’s a way to not take responsibility and just blame on the others.", "#6:00 يا ربي يا دول الخليج اللي حيل منرفزه البعض 😂المصيبة تتفلسف و هي ما تدري عن شيء ولا عمرها أصلًا شافت مناهجنا و تسولف! أنا معلمة لغة عربية للمرحلة المتوسطة و تخيلي عندنا أكثر من درس يخص فلسطين بهالمادة!! حرفيًا بس بمادتي درسين غير طبعًا النصوص الخارجية لتعميق و تذكير الطالبات بأهمية القضية و بيت المقدس و متأكدة باقي دول الخليج و بالذات المملكة نفس حالتنا ماني فاهمه شنو مشكلة ( بعض ) الفلسطينيين مع دول الخليج!", "First girl is most beautiful ❤️ and Inshallah I will marry her", "They are not only indifferent to Palestinians but also to Muslims who are persecuted in China", "They did care in the past,but israel smacked them lol😂!", "If Muslims are one Nation whyvdonthey not absorb the descendants of refugees from 1948?  Why do they use Palestinians as pawns ?", "Best Answer------- > The Prophet (peace_be_upon_him) said: 𝐀𝐥 𝐔𝐦𝐦𝐚𝐦 (𝐍𝐨𝐧 𝐦𝐮𝐬𝐥𝐢𝐦 𝐧𝐚𝐭𝐢𝐨𝐧𝐬)\r will soon summon one another to attack 𝐲𝐨𝐮 (𝐦𝐮𝐬𝐥𝐢𝐦𝐬)\r as people when eating invite others to share their dish. Someone asked: Will that be because of our small numbers at that time? He replied: No, you (muslims) will be numerous at that time: but you will be (𝐬 𝐜   𝐮  𝐦) 𝐚𝐧𝐝 (𝐫𝐮  𝐛𝐛  𝐢𝐬𝐡\r) like that carried down by a torrent, and Allah will take fear of you from the hearts of your enemy and last enervation into your hearts. Someone asked: What is wahn (enervation). Apostle of Allah (peace_be_upon_him): He replied: Love of the world and dislike of death.", "OMG..the wigs on those mannequins!!! LOL!", "Muslims have not been one nation since when the last Khalifa was removed and the nation states were born so this question is silly.  Since there's no one Muslim nation anymore", "It doesn't matter to the people who throw stones. 😂", "دخل العرب اكثر من ٥ حروب مع اسرائيل بدون فائدة والمشكلة تكمن في الفلسطينيين أنفسهم ، أكثر من خيانة عملوها للعرب واضف الى ذلك نكران الجميل.ياليت يتعلمون من أفغانستان و فيتنام والبوسنة شعوب حررت وقاتلت من اجل حريتها ولم تلقي باللوم على غيرها.وشتان بين البذخ المعيشي في فلسطين من لبس وجوالات حديثة وسيارات و الفقر الذي تعيش فيه أكثر الدول.أخيرا لو هناك تعاطف لكان أهل سوريا وأفغانستان والأحواز والإيغور أولا به فهم في فقر وعوز أكثر من بعض الشعوب الراقصة.", "I have a question for the jews: \"Do you believe that jews have a genetic bound? If so, do you think that people with no genetic traces should have their israel citizenship questioned? Would you like to have your DNA examined? \"", "This question makes no sense at all...of course Muslim countries care, is that most of those Muslim countries can not do anything about it.They can only protest and speak out on the situation!!!", "Fact not FictionIt's the will of GodSimply", "She’s twisting the words", "Pakistan always stand with our Palestine brothers", "I’m the second comment and no religion can be certain they’re the truth so we should respect each other.", "The way to solve the Israeli and Palestinian crisis is to follow the teachings of Husayn ibn Ali ibn Abi Talib. Have compassion to one another.", "In the replies I detect more consumerist \"choice language\" than I would have expected half a century ago. If this clip is any indication, Palestinians are no less affected by neoliberal ideas and values than are most other urban dwellers around the world.", "If muslims are one nation, why are they indifferent to the Kurdish Genocide?", "If Muslims would be \"one nation\" then your question needed to be asked a century ago. Arabs including Palestinians have collaborated with Lawrence of Arabia (British) to throw their Muslim \"brothers\" ...the Ottoman Empire out of Arabia and Palestine.The price they had to pay after that and the situation they are in today is nothing I am able to emphasize with .It is the result of their own choices.Further I regret all the \"support\" of the modern Turkey for the Palestinians.", "I think Muslims still care a lot about the Palestinian cause. Vast majority I speak with in the Gulf deem Israel an illegitimate state, almost struggling to acknowledge it’s a country. I think what’s changed is that we have more problems regionally, and the media is not perpetually spewing propaganda and aggravating people’s emotions with the conflict. You have job and economic issues, large unemployment, going into a world where oil/gas can no longer pay for all the nations bills, and security issue with Iran and its proxies in the region. Arab spring, Lebanon melt down, Syria civil war aftermath, Libya is still a mess, Iraq is very fragile, Yemen war is ongoing, rifts between the Gulf states, Egypt’s economy is perpetually on life support, Morocco and Algeria are fighting, Tunisia is having domestic protests. I do think that Hamas being patronised by Iran, and past PA intransigence and betrayals has further pushed Palestine off the priority list for Arab governments as well. For the governments of the Arab world, I think they’ve come to accept Israel’s existence for decades now. That does NOT mean they are friends. It’s more resigning to the reality, it’s not going anywhere. But as all nations do, at points of shared interests I think they surreptitiously work together.", "tbh it’s mostly because every single muslim majority country has many political and civil conflicts in their own country that it’s hard to engage in a whole other problem. but they still donate and help where they can! sometimes it’s just not enough", "Muslims are not one nation, they are people from different nations that share the same religion. You can ask that with \"arabs\" instead of \"muslims\".", "No Muslim on this planet is indifferent to our beloved Palestinians brothers and sisters suffering neither are we indifferent to our Uigur brothers and sisters suffering in Uyghuristan. There are geopolitics involved therefore ORDINARY Muslims are unable to help the Palestinian people liberate themselves from the occupation! Muslim majority lands since 1924 have been carved into ethno state and have been fed nationalism,ON top of that these lands are ruled by puppets of the Anglo-American/Euro empire.", "In my opinion is Not the Muslims who don’t care .. as Muslims all over the world we empathize and feel the pain of our brothers and sisters in Palestine  but we are just people with No power to help except with our Dua.  The ones who don’t care are the ones with political power in Muslim countries..And  Allah  is The All-seeing , The All-knowing & The All- aware .", "yet another loaded question...", "I sent you a message on Facebook about a question: would the Zionist state support Native American rising against the USA to reclaim their land, in the spirit of nativity, as is the driving force for their (children of Israel) justification ?", "Nation, religion and ethnicity are 3 different things.", "So to sum up - • Strong faith• Continuous finance• Persistence in the fight (Official Cost US$ 800 billion)• The words of the book have to be fulfilled.Is not there among the Muslims for the the Palestinians.", "Muslim countries around respect POWER. Israel showed they had strength.", "Muslims are one nation of course", "If muslims really want to play politics, there should be only one muslim rule from Rabat to Jakarta. But people chose nationalism, which is not necessarily a bad thing. The funny thing is, The West supported all sort of nationalism movements in middle east in the early 20th century just to break apart the Ottoman Empire. Yet, when a small group of Palestinian want an independence, US, France, and UK became silent to this day.", "The quran was written in 7th century Arabic. The Quran is the meaning and it is not confined to one language. The purpose is to understand and it can be in any language including anyone's mother tongue.Al hayat” (life), 145 times; “al mawt” (death), 145 times“al-dunya” (mundane life), 115 times; “al akhira” (the afterlife), 115 times“malaika” (angels), 88 times; “shayatin” (demons), 88 times“ar rajul (man), 24 times; “al mar’a (woman), 24 times“as salihat (good deeds), 167 times; “as sayya’at” (wrong doings), 167 times“qul” (say), 332 times; “qalu” (said), 332 times“an nas” (people), 50 times; “an nabiya” (prophets), 50 times“al muslimat” (Muslim women), 41 times; “al muslimin” (Muslim men), 41 times\"yawma-izhin\" (That day), 70 times; \"qiyama\" (Judgment day), 70 times\"dunya\" (near), 115 times; \"akhira\" (far), 115 times\"shitaa\" (winter), 1 time; \"sayf\" (summer), 1 time\"Isa\" (Yahushua), 25 times; \"Adam\", 25 timesIblis the devil is mentioned 11 times and seek refuge from iblis the devil is mentioned 11 times.Belief and disbelief 17 timesClay (teen and sperm (nutufa112 times (how ALLAH says he made us) Charity (zakat and blessings (baraka same amount of times.The words \"Sea\" and \"Land\" are used 32 and 13 times respectively in the Quran. 32 plus 13 equals 45, and the two words make up 71.1 and 28.9 percent respectively of those 45. These percentages roughly correspond to what we today know the proportion of the Earth's surface made up of water and land to be.\"Human being\" is used 65 times: the sum of the number of references to the stages of man's creation is the same:al-Fatihah in itself has 7 verses, 3.5 dedicated towards our praise of the Omnipotent, and the next 3.5 dedicated towards our prayers to the Omnipotent.The words “salawat” (prayers) and \"aqimis-salah\" (establish prayer) are mentioned 5 times in the Quran, the same as the number of mandatory daily prayers.The word \"alwan\" (colors) is written 7 times, the same as the number of colors of the rainbow.The words \"samawat\" + \"sab\" (heavens + seven) are written together 7 times, the same as the number of heavens described in the Quran.There are 365 days in a year. The word \"yawm\" (day in singular) is written exactly 365 times.Muslims circumambulate around the Qibla, seven times during pilgrimage. The word ‘Qibla’ is used in the whole Quran exactly seven times: 2:142:8, 2:143:15, 2:144:8, 2:145:10, 2:145:14, 2:145:18, and 10:87:12\" https://https://youtu.be/Fb92bx1kYYUwww.google.com/url?sa=t&source=web&rct=j&url=https://en.m.wikipedia.org/wiki/Symmetry_in_the_Quran&ved=2ahUKEwjC8KWIgbjxAhULQEEAHThcBFwQFjAAegQIAxAC&usg=AOvVaw0fvhfLuAaW4M9JHqnXti5h&cshid=1624803774708...", "We are not one nation, the only thing we have in common is religion, but our religious lifestyle is very different. As a Turk, I wouldnt want to be a single nation!!", "muslims arnt one nation simple as that. Dumb question", "*God promised me a Car in bible so now I am gonna steal it*", "Because unfortunately we are not United we are so devided.  They obviously feel sorry for us and show sympathy while on the other hand they can be living their own life and dealing with their own problems.  Good question.", "To those western minded commenters who point out that Islam is a religion:You are right to define it as so. But you failed to learn that those who strictly follow Islam refer to themselves as the \"Ummah\". Just listen to how muslims themselves speak worldwide, and notice how none of the interviewees felt the need to correct the question.The ideal of all Muslims worldwide is to come together under the nation of Islam as they call it.Corey's question was spot on. If you're unfamiliar with the Arab/Islamic world please refrain from commenting on such issues.", "One nation that kills each other constantly, endless conflicts...", "Is that an Aloe Vera plant the young man is carrying in the last clip? Sorry just a bit of levity to a serious problem. I suspect that the rest of the Arabs are a bit tired of the whole \"I'm a victim\" bull. No one in the middle east has had an easy path... If Palestinians would have simply dispersed and gone on like every other displaced tribe in the middle east they could be happily living and raising kids and l having good lives by now! Sometimes you just lose! I know I am part Native American!", "First girl is soo hot would marry", "Ask the Uygurs.", "With all respect Israelis are naive to be a westerner tool instead they can be the heart of this area just imagine an Israeli chocolate factory selling chocolate to 500 millions people while now barley selling it to 7 millions .. but this peace and cooperation need real prove to erase a bad history of Israeli agression embedded in the collectif mind of arabs.. and if it happens this area can lead the world and be a great example for others to learn.", "كلنا ندعم القضية الفلسطينية. وتُدرس في كل المناهج الدراسية لجميع الدول العربية والاسلامية. فهو امر متعلق بالدين وسلامة العقيدة… فيكفي الفلسطينيين فخراً انهم مرتبطون بقضية ذات ابعاد عميقة في قلب كل مسلم. هذا السؤال هو لايقاع الوهن في قلوب الفلسطينيين والمسلمين عامةً. السؤال المطروح هو ماذا أعد الاسرائيلين اليهود ليوم نهضة المسلمين. عندما سيقتلون كل يهودي. ولن تخفيهم شجرة ولا حائط؟", "The lady who said, ask any Arab living in the golf about Palestinian history and they won’t know anything, is because there isn’t one! There’s even a video in this series asking Palestinians about their own history and THEY don’t know.", "Being Muslim means belonging to a certain religion and not being one nation! Atleast ask reasonable question!", "Muslims are not indifferent to the Palestinian struggle, I don't know you concluded this as the premise of your question. Palestine is in the hearts of almost every Muslim, you saw that with the protests and response to the killings in Gaza earlier this year. The difference is that the large majority of leaders of Muslim countries are either puppets or are powerless against America and the West who unconditionally support Israel.", "After watching a couple of these videos I got to say that the way it looks like Palestinians live it’s much nicer conditions than they give credit for, like their clothes, cars, shops, etc.", "This a very pointed question. Too bad the answers are so wishy-washy", "\"We want to live in peace\" i assume that \"peace\" will be at the expense of israels existence.", "That is quite a loaded question, Corey. The only sober answer is that Palestine is not a Muslim issue.", "The PERFECT question!", "If Muslims are not one nation?", "🤔🤔", "4:10 I know the guy on the left… interesting…", "If Muslims are one nation, why can’t they all agree on the same hadiths & other matters? Lol 1400 years you’ve had to fix your narrative but no. You can’t.", "Truth is so-called one muslim nation never hardly existed and is a fantasy created by dreamers to satisfy themselves", "Wth to you mean we don’t care The government don’t talk for me", "Iran should stop all support for these ungrateful people", "Malaysia always support Palestine. A month ago, the national air security spotted an Israel airplane breached our air space because we raise our voices about Gaza/sheik jarrah. They were threatening us. The only channel i heard about what happen in sheikh jarrah is from VICE News channel.", "Proceeding from a faulty premise- Islam is a religion, not a nation.", "If Muslims are one nation than why they are not taking Rohingya into their country?", "Where is the occubation?", "Ask this question to arab leaders maybe you and we will get a reasonnable answer. Maybe 😑", "Great question and good answers. It’s because the Arab world has mostly moved on.", "Even their arab countries don't help they are the allies of Israel  and Us  arab countries have ties with israel so why would other countries want to help?", "The answer is Muslims aren’t one nation.", "i m french from algeria and i m very interrested about the condion of PALESTINIANS"]}, "jrSrB1JRCx0": {"title": "Palestinians: Is your beard for religious or fashion reasons?", "top_level_comments": ["I love the guy \" I'm a bald guy\" ❤️", "I like how the translator is passionate and stood up for her people, not wanting them be seen as silly posers, but actual trend-setters. Bless you all, on this crew.", "This video shows the wide range of 'phenotypes' of Palestinians - similar to Jews, some looks very Semitic and others looks practically European.", "So nice to see a video with a more light approach than the usual!Please Cory, have more like this type 😊", "they all look so flattered when asked about their beirds, it's almost like watching women to be complimented about their dress or something. It's cute!", "Seems that the more religious Muslims shave the mustache..although the actual writing about it says only to keep it trimmed and NOT shaved. Seems the no mustache gives it away most times.", "the salon in that old stone housing from Nablus is absolutely stunning, I've been repeating these first 20 seconds now for 5 minutes straight, this is so amazing!", "Guy fails being a hipster, but translator definitely must be.", "\"There are no hipsters in Palestine\"\"There is no war in Ba Sing Se\"", "I found all these men to be very good looking and likable!", "While I appreciate the hard hitting questions this channel excels at, I really enjoyed the change in pace. Of course, I gotta luv my beardy boyz", "\"we don't have hipsters in Palestine\" reminds me of \"we don't have homosexuals in Chechnya\"", "“na…I’m a bald guy” lmao I died", "The transition from the guy in Ramallah to the guy in Nablus was classic", "0:28 damn she really defended him even tho he agreed that he was a hipster lol", "Finally changing the topic ❤️", "A beard is a man's make-up 😍", "When I have a beard it is because I am too lazy to shave.", "That’sfunny. I live in Berlin /Germany and just noticed the other day that the majority of Arabs and also many Turks in the city have the same beard and hair style.Not that they shouldn‘t but why is there so much uniformity? (P.s. the majority of Arabs in Berlin have Lebanese, Palestinian and Syrian backgrounds)", "In Some Amish and Mennonite community men will grow beard after marriage. Expect elders to have longest beards lol 🧙🏽‍♂️", "interesting to see how palestinians use the word  \" moda \" that is from latin ( modus ) and used in Portugal, Italy, Spain , Brazil, etc ( in other latin origin languages ). Moda means fashion in these countries-", "Well it is really easy to see religious beard, because the moustache is way shorter than beardand also explanations of that are in mohammed hadiths (he sees people from Persia without beards but with long mustaches and he decided to look totally different while creating muslim society)", "it would suck if they aren't able to grow a beard", "Definitely there are hipsters in Palestine - translator is being ignorant or weird being a hipster is not evil or bad so her weird denial is strange", "0:26 Hipster means non-traditional person who is an independent thinker , believes in progressive politics and dresses in a trendy fashion, and she said No he is not a hipster, and she said there's no hipsters in Palestine .. she just decided for him and for everybody here in Palestine .. I'm really impressed :(", "Next Video please : Is banging head on the wall religious or just getting back on the senses ?", "Leviticus tells man to grow beard. Quran tells us to follow the prophet and prophet said to grow beard.", "In short Muslims grow beards because its Sunnah, Sunnah means Characteristic, actions, the way he was in fashion and behavior, and advice of Muhammed(SAV=Sallalalahu Aleyhi Vesselam,,=Peace Be UPON Him in Arabic). In Quran Allah says if you want to copy, mimic a human and win my love then copy Muhammed. This is the reason Muslims have beards, Like I said before all the Prophets, like David, Solomon, Moses and Muhammed(SAV)had beards. In Short I leave a beard to impress Allah not to be a hipster.", "IMO it's very obvious who has a beard for religious reason and who for fashion.", "The difference between a mundane task and Ibaadah/worship is the 1) intention in the heart (for Allah's pleasure) and 2) according to sharia guidelines (in this case, to follow the sunnah/habits of the Prophets)", "Judging by the dude’s accent at 1:00, I’m pretty sure he’s an Indian Muslim just visiting Palestine.", "jaja second guy was so relax and adorable, may allah protect him", "Is it me or are Palestinian guys in this video really handsome?", "And you guys wonder why you are in trouble. If you seek God's help, obey his commandments, and follow your Prophet, peace be upon him.", "Good clip.", "Guy #2 needs to come to me!", "I am glad I do not have to have a beard, I tried to grow one but it made my face itch and it had to be washed almost after every meal. I don't know how they can stand it. As far as fashion. I noticed most people look better after they shave their beard or mustach off. they look younger.", "Cory ! Serving Humanity", "\"We don't have hipsters in Palestine!\" Next person definatly a hipster... XDXDXD", "Dude.... religion IS basically people subconsciously following fashion/a way to dress/look!  People perfect the \"look\" way before they gather any knowledge....", "If they cut mustache, it’s for religious reasons.", "Fashion of religion.", "This is what I look like 3 months ago, now my beard is twice as long. My purpose for growing my beard is for Sunnah, Meaning laws of the Quran.(sunnah means, what Muhammed did and we (Muslims) follow and copy him(Muhammed) to impress Allah. Allah loves beardn and wants humanity to have a beard, by the way and all prophets had beards.", "Were there no interesting questions in the vault this week", "In the name of Allah the benefactor, the most merciful,He is Allah is One, the Sustainer, Independent and Most high. Allah has no gender Allah is unique. Allah is the greatest. And there is none comparable to Allah. I invite u to the true religion. The clear path our creator has shown us. Allah sent al the prophets with the same clear message \"worship Allah alone and don't associate partners with Allah and follow us (the messengers) (peace be upon them)\"  The Truth has come and falsehood has vanished. Falsehood is surely bound to vanish. When they are in a sinking boat in de middle of the ocean the disbelievers call upon Allah, and when Allah brings them back safe to land there are people that associate partners with Allah. Peace be upon the souls that follow the guidance of their Creator, Allah.  [Interpetation of the meaning of the verses]Quran 91:8/10and inspired it [to know] its own rebellion and piety!The one who purifies his/her soul succeedsand the one who corrupts it fails.{And I did not create the jinn and mankind except to worship Me.} [Quran 51:56]• {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taaghoot.} [Quran 16:36]• {And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.} [Quran 21:25]InterpetationWww.quran.nl", "That guy was definitely a hipster but she was so agressive about no hipsters in Palestine 😂", "It sounds like israelis need to know what % of Palestinians are religious, because this will consequently determine the time left for them in Palestine.", "Lol i didn't expect this kind of a question 😅", "Corey, Please do a segment asking Arab Israelis if they are equals in law and public policy compared to Jews. If they say no, ask them to specify why not. Thx.", "I don't know, I think the guy looked like a hipster... I don't know what the translator's standard is.", "its really a bummer - there are always tons of race scientists in the comments.", "\"There is no hipsters in Palestine\"", "She’s twisting the words", "what a silly one", "0:32 We have no hipsters on PalestineHmmm...", "2:45 what’s the “ass project”?", "Most bearded people here don't have it because of religion", "Questions for Muslims. What percentage of you do not drink alcohol?", "lots of muslims that i know have beard with shaved mustache.", "لما لحاكو تصير تدين ساعتها فلسطين بترجعلحيتي موداا وفخورين قال 🤣😂", "Hadith from Ibn Umar RA:The Prophet PBUH said:“Do the opposite of what the pagans do. Keep the beards and cut the moustaches short.”Sahih al-Bukhari (10/349)Hadith from Abu Hurairah RAThe Prophet PBUH states:“Trim closely the moustache, and grow beard, and thus act against the fire-worshippers.”Sahih Muslim (1/222)Hadith from ‘Aisyah RAThe Prophet PBUH states the ten acts of fitrah (natural) of humans and one of it is:“…letting the beard grow,”Sahih Muslim (1/223)", "Ask young Israelis the same question", "Protip: Mustache = fashion. No mustache = religious", "that bald guy💀💀💀💀💀💀💀💀💀", "A Blessed Shabbat Shalom🌺 and Joyful Tu'Be Av 💖 To All Am Yisroel", "⭐⭐⭐ JESUS IS COMING VERY VERY VERY SOON!🎺🎺🎺🎺🎺 \rThe return of Jesus is at hand!\r JESUS IS THE ONLY WAY TO HEAVEN!\r\r📖 John 14:6 says,\r \" Jesus says,  'I AM THE WAY THE TRUTH AND THE LIFE. NO ONE COMES UNTO THE FATHER (in Heaven) BUT BY ME'.\r\r JESUS CHRIST is the only, true way to Salvation! It’s the free gift of GOD to all those who believe and trust Him! \r\rSALVATION! is the redemption of one’s soul from eternal destruction after death of man, on this earth, by the cleansing of the blood, and by the death and power of resurrection of Jesus Christ\r\r📖Acts.4:12 says.\rSalvation is found in no one else (except Jesus Christ), for there is no other name under heaven given to mankind by which we must be saved.\"\r\rHow is SALVATION gifted to man?\rFor by grace are ye saved through faith; and that not of yourselves: it is the gift of God.\r\r📖John 3:3 says,\rJesus answered and said to him, Truly, truly, I say to you, Except a man be Born Again, he cannot see the kingdom of God.\r\rHow can a man be BORN-AGAIN?\r\rTo be Born-Again in spiritual sense, is to die to our old sinful nature and be born-again in the spirit, to be holy, righteous with a new nature in Christ Jesus. \r\r👉To be born-again, we need to repent & confess our sinful past for a holy future.\r\rWhat is repentance?\r👉 REPENTANCE! Everyone born into this world is a Born-sinner. Human nature is a sinful nature. Sin in us has defiled us and has separated us from the Holy God! \rWe have to repent for all the unholy, lawless transgressions of God’s commandments done willfully or unknowingly, in order to obtain mercy and grace so that we might not be judged and fall into condemnation, the condemnation of eternal hell.\r\r📖 Acts.3:19 says,..✔️Repent, then, and turn to GOD, so that your sins may be wiped out, that times of refreshing may come from the LORD\r\rWhat is confession of sins?\r\r👉 CONFESSION! The guilt of sin and it’s condemnation is rolled away if one truly regrets his sinful past and confesses them in the presence of Jesus Christ.\r📖Romans.10:9 &10\r✔️That if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved; for with the heart a person believes, resulting in righteousness, and with the mouth he confesses, resulting in salvation.\r\r 📖  1 John, 1st chapter & verse 9 says..\r✔️If we confess our sins, He (Jesus Christ) is faithful and just to forgive us our sins(every sin)...\r\rThe sole purpose of sending Jesus Christ into this world more than 2020 ago is this👇\r 📖John.3:16-17 says \"\r 👉 GOD so loved the world (us) that He  (Father GOD) gave His only begotten Son to die for us ( our redemption ), that whosoever believes in Him (Jesus) should not perish (in hell) but have everlasting life.\r👉 GOD has not sent His Son to condemn the world (us), but the world (we) through Him (Jesus Christ) might be saved.\r⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩⏩\r\rDear Bro/Sis.🙏🏼, You may be of any race, religion or creed. Rich or poor. White or black or brown. You may be the least sinner or the worst sinner on earth. You may leading the worst of immoral life against the principles of the Almighty GOD. God is concerned about your future and not your past. All He asks you is to repent and confess your sins to obtain mercy and have a secured and a blessed hope!\r\r📖 Hebrews.10:17\rAnd their sins and iniquities will I remember no more.\r➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖\r\rIf you say this small prayer with faith. 👇\r\r“ LORD JESUS, I am a sinner, I have committed so many sins knowingly and unknowingly. Have mercy on me. Please forgive my every sin with your precious, Holy blood shed on the cross to save me. I believe you died on the cross, you were buried and rose again the third day for my justification. I believe you are the Almighty GOD!\r\rAccept me as your child. Help me to lead a holy life. Fill my heart with joy, give me heart to seek you.\r\rIn Jesus precious name, I ask and believe. Amen!🙏🏼\r➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖\r👆\rIf you have said this prayer, I can assuredly tell you that you are a new creation. You are Born-Again in the spirit through the righteousness of Jesus Christ.\r\r📖  2 Corinthians 5:17\r“Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.”\r\r 👉  Be Holy as the LORD your GOD is Holy!\r\r⏩FORSAKE SIN!\r📖Proverbs.28:13 says..✔️He that covereth his sins shall not prosper: but whoso confesseth and forsaketh them shall have mercy.\r👉📖Mark.16:16\rHe that believeth and is baptized shall be saved; but he that believeth not 📌shall be condemned \r\r ⏩Read the Bible 📖⏩Know the Truth⏩Go to a Christ centered Church⏩Be Baptized⏩Be Blessed!\r\r⏩May the Holy Spirit GOD lead you & guide you!🙏🏼\r\r👉 Be prepared for the RAPTURE! ( Return of Jesus Christ. THE JUDGE )\r\r May the Lord richly bless you,🙏\r\r📢 Please SHARE & SPREAD this GOSPEL 📖 to the WORLD 🌏\rThe Gospel Tract Download Link! 👇\rhttps://drive.google.com/file/d/1sl0XBfueEM5iTtWvIBezl9--lktlP4Xf/view?usp=drivesdk", "The thumbnail looks like. Mohammed Salah distant brother.", "Some young people when i was in high school don't shave their beards or actually their ridiculous hair in their faces  just because it's a hard work or they are little girl dont know how to shave lol", "So grateful Palestinians are so into fashion. They looks so cute!!!", "00:35 \"we don't have hipsters in Palestine\".Reminds me of Ahmedinejad's brilliant quote \"we don't have gays in Iran\".Sure.", "Another irrelevant question 😴", "ask them:  what is the relationship between money and god?", "Very interesting to see how they want to be modern.", "Are you bald for nazi reasons ?", "My beard is for religion, sunnah, 3 inches long, never trimmed it, half is black, the bottom half is grey", "Why are Palestinians in the Middle East so weird coming from a Palestinian american", "We don't have gays in Iran!", "Ask the jews why they hate Muslims so much", "Can you ask Druze whether they want Golan heights to return to Syria or stay in Israel.", "Probably religious or Mason.", "I'm beginning to understand, at a really deep level, just what was meant when someone said \"Gradually, I began to hate them'. I'm not thrilled about it, of course, but it makes sense. Keeping it real. You guys go pillaging,criticizing, and hating upon any host nation you enter, throughout history, yet don't understand the fundamental question \"Why?\", as in, \"Why do people keep growing impatient, distrustful, tired, and eventually fed right up with us?\" It would be sooooo simple to just ONCE, ask of yourselves, \"Have I possibly acted in a way that made people feel a certain way about me?\"pffft...Nah, of course not! That would just be silly and stupid. Self reflection is for losers and cattle. The only logical answer would be that everyone else on the planet is dumb, as we are OBVIOUSLY INCAPABLE of doing anything wrong! The volcano demon shat each of you from his golden bumgape, in pristine and perfect condition. He chose you, and knows mistakes are something that only your \"cattle\" neighbors make, as they are inbred, retarded, and not jewish! IN other words, not perfect. pffft.", "It’s very simple. Islam teaches us to trim the mustaches and grow the beards.", "they are cunning because wearing a beard is associated with Islam and with theirs there are some prescriptions", "i am indonesian. i am jealous with their beard. but why they said it just a fashion? its make me a bit sad", "It may be for both. Also religious Jewish men have beards. Like Haredims,  but of course not all religious people are like that. Personally I don't like beard.", "1:30   Good looking guys, but I always look behind the well dressed, well fed people with shops bursting with merchandise to find the suffering of these people living under an \"abhorrent occupation\".   1:52 a prime example of the starvation and unemployment with the shop of clothing with no room to squeeze another pair of socks.  Bethlehem man certainly does not look hungry.  2:19 - ditto - shoes piled up to the roof and a \"healthy\" well dressed Palestinian.2:49 - ditto  - modern cars, well dressed pedestrians, shops and buildings, a guy on a not to shabby motor cycle and smoking cigarettes - could be anywhere in the world - this is not a refugee camp, these people are not suffering, unless under the Palestinian Authority.  and could this \"occupation' and apartheid thingy be a farce and propaganda?", "LORD JESUS ❤️ YESHUA ❤️ IS MESSIAH (Isaiah 53) .", "the Arabic translator is the worst ever, she really miss-translate what an authenticity!", "Why are they only asking men with beards?", "A man without facial hair is feminized and not a man. It is obligatory for men to grew their beards in all 3 world religions. Feelings of others do not matter. The prophet pbuh commanded Muslims to grow the beards and trim or shave the mustache. If one is able to grow a beard it is a must to grow it at least fist length and to trim the mustache over the upper lip or shave it off.", "For those people that don't know,the reason for beards is protection of the soul from demons and blackmajick.The longer rge beard the stronger protection and more wisdom.Is very spiritual", "They saying Its not for religion just for fashion ya then Israel teach u better religion. Now i must say they getting punish not by israil but due to their hypocrisy for ISLAM no more sympathy for these hypocrite nation .", "Isn't the beard annoying in the summer? I dont think it's hygienic.", "Really terrible is when some Muslims dye their beard in ginger colour, especially Pakistanis. It looks awful!", "Good channel. I wish you could interview more christians in the area though. The few there are. Considering especially since Jesus and repentance of sin is the only way to everlasting life after this world.", "Most men nowadays grow their beard for a fashion reason. However some men grow their beard without a mustache for a religious reason. Everyone should feel free and comfortable with their looks.", "Man, they look European...remnants of the Turkish occupation>", "I sense a lot of people not actually telling the truth. They distrust the people asking the questions but don't want to seem \"unfriendly\" as their eyes shift, they tilt their heads, and force a really big smile when responding, even the \"honest\" respondents apprehensively tailor their responses.", "Living in this city must be real hell. Soooooo noisy, terrible place to live.", "Palestinians?"]}, "MS8HBlRnqKM": {"title": "Palestinians: Which conflicts are worse than Palestine?", "top_level_comments": ["Palestinians: we have it the worst.North Koreans: hold my Kim", "We've sunk so low that we're arguing who's the worst 😔", "Does Al-Jazeera not show the starving children in Yemen?  What about the oppression of all Burmese and specifically the horrendous genocidal crimes committed to the Royhinga in Burma?  Can Palestinians get satellite TV like Al-Jazeera?  Are the people of the West Bank hindered in what they can watch and read?", "lmao they have for sure not the worst", "Can you make a video regarding Circassian Community in Northern Israel?", "Ask the Lebanese today if their financial plight is less painful.", "Tibet Cyprus Ukraine Armenia Taiwan etc. This happens all over the world and has been continual throughout time. Victim mentality among Palestinians always keep them from ever advancing in life", "For all those who resolutely claimed that the conflict in Palestine is the worst in the world, the immediate follow-up question I'd have is: \"So if this is the worst conflict in the world, then you'd trade places with a Yemeni, or a Syrian, or a Chinese Uyghur, right?\"", "I would say that Iraq and Syria became the worst since the wars there started, but now I think Uighurs are facing the worst atm. Not to forget to mention Yemen war and the genocide on the Rohingya's in Burma.If we take a look at non-war conflicts I would say that countries like Venezuela are facing worse that Palestine.", "Mali, Lybia,  Afghanistan,  Syria, Iraq,   All conflicts which make Palestine to a paradise, as shown on the streets and the shops.   It is not exactly a battlefield.", "You can do a study in psychology from this video about how one can see only his/her problems and think that s/he is the only one who have these problem and that these are the worst problems there are", "“Tragedy is when I cut my finger. Comedy is when you fall into an open sewer and die.”—Mel Brooks", "Haiti: Cries in mud cookie", "Muslims: Free PalestineKurdistan,Belochistan,Western Sahara Kurdistan,South Yemen:Me to?Muslims: N O", "I wonder that, Kurds are muslim, but palestinians do nor care about them. Uyghur Turks are muslim, and they are now being tortured(I listened some of them), but palestinians do not care about them. These are just \"2\" cases. Says it all", "Nobody is thinking about the Uyghurs…", "And that my friends is called brainwash and ignorance ,I mean Idk each one's conditions, but they all look like they have normal lives ,they have clothes and food homes and kids....there r many places where the war is alot worse ,we're places r bombed all over, ever seen pictures or videos of Yemen or Iran....and that's by there own ppl ,I'm not even arguing on whether there is an occupation or not ,just notice how brainwashed they r ,", "Those u wanna know / see real life conditions of Palestinians. U can open ur Snapchat app n use the map tab go to Israel map n chrck out the snaps that being posted from Gaza N westbank. I would say, the arabs in westbank has pretty good life (often they flex their luxurious thing n blast songs while driving in their jeeps).. Playing go-cart, n hookah.. & on other side at gaza.. U can see they having shopping complex. Having lots of foods n they also like to blast song from their cars. But the westbankers have better luxury compare to gazans.But obviously, can't see the poor part, Arabs living in tents without house, that 'open prison' narrative without food n gonna die \"victim narrative\".Life in Syria, Yemen, Iraq, Libya, Sudan is way more worse. Getting very skeptical nowdays to trust their victim narrative anymore 😕", "Can anyone name a singer/activist/writer/poet/social leader who identified themselves as a \"Palestinian\", or as a member of a \"Palestinian nation\", before the 20th century?", "Well played Corey...well played...👏👏👏...", "Its easy to say opinions when your too emotional intact to the situation and don't see all the facts and only see your own view and pain as the main part.", "5 million people crying over occupation and how Jews treat them with a quite big ignorance a human being can ever have. Me and my Kurdish heart cry here to watch a 60 million people living without any recognition and state, divided into four fascist countries, mostly Muslim countries, supposedly our Muslim brothers. Even Kurdistan doesn't come to the category such as a conflict, shows really, that Kurdistan is occupied by the Western and their supposedly Muslim allied fascist countries Turkey, Syria, Irak, Irak and Causation areas", "I am palestinian and i acknowledge struggle of other nations such as khasmir syria nigria iraq sudan north korea etc", "\"we have it worse\" says the woman wearing designer glasses, lipstick and waxed eyebrows while  5 new Mercedes an BMW pass her by on the street.", "Why doesn’t anyone bring up Yemen?", "Looks nice , I might go on holiday", "The problem is that conflict is conflict , you can\"t just say you have it worse because this or that , living in a segragation country or under occupation or even in a civil war is enough to call it worst . You can live in the USA in a gang war territory or under chinese occupation in tibet it is the same. Our role as humans is to protect civilians , give them rights and freedoms , decent life and security , any area that doesn t have that is \"the worst\" , if it s a frontline battlefield or an occupied village is the same if you ask me.", "The Kurds have it worst , they have been decided between 4 different countries and every country is trying to assimilate and oppress them. Their language has been forbidden and no basic human rights; since 1991 the Kurds in Iraq have autonomy and more rights. The Kurds deserve a state in Kurdistan.", "By objective metrics, it wouldn't even be on the top 10 among  US cities.", "this is a good one!", "Fantastic question.", "I expected repetitive answers as most videos show sadly, and yet there were opposing views. although minor, still worthy of praise.", "« Western Sahara » As far as I know Morocco is not under occupation", "6:18 This woman thinks she lives in the worst place on Earth.", "If you are interested to hear more about this subject we discuss it all the time. Corey - you are invited.", "Uyghurs under occupation of China seems a lot worse to me.", "Such a great timing to see this video after the taliban took over all of Afghanistan", "With Palestine, Nagorno-Karabakh, Donbass and Syria are the worst occupied territory war. I think each  territories need to belong to the countries which the ethnic majority is the same.", "Victimhood taken to just another level.", "I think they are exaggerating. Try to ask Ughurs or kurds they can't even answer!...", "That Dr is a joke talking about Israeli tyranny and answering Corey in a chill interview in the street that Yemen isn't the worse conflict in the world while 500 k people have been murdered where are the dead bodies on the Palestinians streets? There aren't any the dead bodies are in PA prisons 😂", "In my opinion All wars and conflicts equally deserve peace freedom. There is no good in comparing who is worse, however it does show the flawed perspectives and education.", "\"They treat us badly, it's unbearable how they treat us\"Kurds: Yezidis:Syrians:", "Facepalm 🤦‍♀️ how delusional can one be?", "currently Yemen war is the worst", "This is one of the saddest videos I've seen on the conflict. Even the few that recognize that there are other countries that have it worse can only name other arab countries.", "Omg they are so uneducated, they think they are the center of the world", "Love this guy 👌🏽👌🏽 1:00", "They don't know about other conflicts too much but their conflict is well covered and propaganised so they have the excuse to say theirs is the worst and no other is suffering like they do, which is counter productive, they just blame their oppressor without any real self reflection and change", "Venezuela alone is probably worse that palestine", "What an insensitive question! Are people in conflict zones supposed to feel grateful that there are others who have it worse than they do?", "It's incredible. And we are meant to welcome them into our ancestral homelands and think they won't violently displace us when they think their entire world is where ever their feet are.", "Do they have no clue about the rest of the world, or are they so self centered and self related that they actually believe they have the worst conflict?", "Its a bizarre sight to see how these interviewees condemn the Palestinian conflict as the worst in the world when late model SUVs and Mercedes cruise the streets behind them looking for for a parking space.", "6:08 I got this woman wrong. At first, she appeared naive to the world’s conflicts as she smiled in her designer shades and said that it was “the worst” in Palestine. But she isn’t naive. Her answer was the most informed, actually (even more so than that supposed professor at the end). I’m sure that there are many Palestinians who wish to normalize relations with Israel, but cannot due to the oppression they face from their own corrupt government. This is barely non-existent in reporting for several reasons, but probably most important is due to the fact that you’d be risking your life to speak against the government in Palestine.", "im 44 years old i did the blasphemie when i was 8 years old and perfection when i was 18", "North Korea, Tibet, Uyghurs, Yemen, Syria.", "Investing in crypto now should be in every wise individuals list, in some months time you'll be ecstatic with the decision you made today.", "6:27 love the glasses and outfit!!!!!!", "Walking around with stylish clothes and make up.But yeeeees our situation is the worst in the world.", "What I understood from this videoPalestinians don’t care about anyone but themselves.", "Please.... u guys must read. dont only think bout ur conflict. Kashmir, Xinjiang (China), Tibet, to name a few........", "Don't think that this is only palestinians that think this is the worst conflict everMany people from all over the world think that, because so many countries have interest to focus the media on Israel instead of the conflicts in them", "8:48 looks like that kid just learned his/her first cuss word lol.", "Why was the kid screaming \" f u \"? 🤣", "I think there are worse conflicts. I think palestinians should learn about other conflicts more before saying they have it the worst.", "No one said IRAN ! Iranian have worse situation under occupation of Islamic regime.", "Western Sahara is not under occupation. It's Moroccan land.", "The Liberian Civil War", "That kid screaming “fuck you” though 😂 🤣", "and we didn't even mentioned the high fertility and the population growth rate of them", "عجرفة و جهل الفلسطينببن لا مثيل له.. إلا من رحم ربك", "A lot of them live in bubble , wich was manufactured by their leaders. Not all of them. .", "just FYI list of countries with the baddest conflicts in the world;ethiopia, sudan, Morocco, Algeria, Tunis, Libya, egypt, chad, mongolia, Eritrea, russia, N. Korea, china, india, Iran, brazil, haiti, D. republic, Pakistan, Nigeria, Saudi Arabia, Turkey n so on..basically, the whole world is in conflict.", "When you're loving the attention you get,you'd love to victimize yourself.", "It's difficult to ask someone who goes a week without food if their hunger is worse than someone else who is also starving. As a Palestinian, I would say ours is most unique but not worse than Yemen or Syria currently", "how do you meauser conflicts  in the first place in order to compare them with each other?", "Great question!!Typical Answers from our \"cousins\" for the most part 🙄", "comparing it to northern Cyprus is just ridiculous", "A bunch of crap..these people live a good life.", "Damn no love for afghans or Afghanistan", "Corey love ur videos and respect but thing's you say you must research. I know you research it but full  knowledge of it. Cyprus wasn't occupied  Greece and turkey were l living together for 100s of year's. If u argue back saying well isrealies before 1948 were here, No problem the issue is the once came after. Any Greece or turkish that are non Cypriot and takes over cyprus today then they see indeed in same page as Isrealies. 🙂", "Not active at the moment, but Ex Yugoslavia conflict is by far the worst in my opinion.", "Idc if they get their own unified country, as long as both will stop firing at each other", "if its the worst occupation in the world why don't they move to Syria or Yemen or even Lebanon?", "“If i don’t steal it someone else will steal it” Yakob 2021.", "*FIRST EVER ORTHODOX VS. MESSIANIC THE GREAT DEBATE IN HEBREW! with ENGLISH SUBTITLES (Rabbi Chaim Shitrit, Head of Kollel! VS. Dr. Eitan Bar, Dallas Theological Seminary)*הדיבייט הגדול = הרב חיים שטרית (ראש כולל!) מול יהודי משיחי ד\"ר איתן בר - על סמכותה ומקורה של התורה שבעל-פה של הרבנים", "What is the point of this comparison between 'conflicts'(read ethnic cleansing).is it to minimise the aggression and violence on the Palestinians? There is ethnic cleansing happening in China, Syria, Yemen rohingya and Palestine they are all bleeding and it is not helpful to place a comparison on the pain a life is a life at the end of the day.", "Ask them about khmer rogue n China culture revolution", "U  r doing good work keep it upBut please convey my message to the jew people", "Typical.... move to Yemen for a month... decades of believing the lies you are fed.", "All of the middle east,Afghanistan,some parts in Africa (boko haram) and idk about others...", "Please always ask them in arabic", "No one mentioned the Uyghurs ?... I guess that's not surprising since both Palestinian governments supported the Chinese position on the uighur concentration camps...", "What a useless question. Why compare. Each disaster has its own consequences and impact on the people impacted.", "Moroccan Sahara 🇲🇦 , moroccan Sahara is our land 🇲🇦 and belong to morocco centuries ago forever , algerian  occupation is the worst they treat humans in tindouf with hardest conditions ever", "why did you cut at 2:04 ? wanted to hear what he was going to say", "Biggest attention seekers on earth, that's for sure.", "Google : \"obesity rate by country\" 🤡", "Nobody mentions kashmir 😓😓And here we people die for you"]}, "_tVldbntLug": {"title": "Palestinians: Do you have any doubts about the Quran?", "top_level_comments": ["I'll classify this video under \"Corey's Got Guts\".", "1. Do not be rude in speech (3:159)2. Restrain Anger (3:134)3. Be good to others (4:36)4. Do not be arrogant (7:13)5. Forgive others for their mistakes (7:199)6. Speak to people mildly (20:44)7. Lower your voice (31:19)8. Do not ridicule others (49:11)9. Be dutiful to parents(17:23)10. Do not say a word of disrespect to parents (17:23)11. Do not enter parents’ private room without asking permission (24:58)12. Write down the debt (2:282)13. Do not follow anyone blindly (2:170)14. Grant more time to repay if the debtor is in hard time (2:280)15. Don’t consume interest (2:275)16. Do not engage in bribery (2:188)17. Do not break the promise (2:177)18. Keep the trust (2:283)19. Do not mix the truth with falsehood (2:42)20. Judge with justice between people (4:58)21. Stand out firmly for justice (4:135)22. Wealth of the dead should be distributed among his family members (4:7)23. Women also have the right for inheritance (4:7)24. Do not devour the property of orphans (4:10)25. Protect orphans (2:220)26. Do not consume one another’s wealth unjustly (4:29)27. Try for settlement between people (49:9)28. Avoid suspicion (49:12)29. Do not spy and backbite (2:283)30. Do not spy or backbite (49:12)31. Spend wealth in charity (57:7)32. Encourage feeding poor (107:3)33. Help those in need by finding them (2:273)34. Do not spend money extravagantly (17:29)35. Do not invalidate charity with reminders (2:264)36. Honor guests (51:26)37. Order righteousness to people only after practicing it yourself(2:44)38. Do not commit abuse on the earth (2:60)39. Do not prevent people from mosques (2:114)40. Fight only with those who fight you (2:190)41. Keep the etiquettes of war (2:191)42. Do not turn back in battle (8:15)43. No compulsion in religion (2:256)44. Believe in all prophets (2:285)45. Do not have sexual intercourse during menstrual period (2:222)46. Breast feed your children for two complete years (2:233)47. Do not even approach unlawful sexual intercourse (17:32)48. Choose rulers by their merit (2:247)49. Do not burden a person beyond his scope (2:286)50. Do not become divided (3:103)51. Think deeply about the wonders and creation of this universe (3:191)52. Men and Women have equal rewards for their deeds (3:195)53. Do not marry those in your blood relation (4:23)54. Family should be led by men (4:34)55. Do not be miserly (4:37)56.Do not keep envy (4:54)57. Do not kill each other (4:92)58. Do not be an advocate for deceit (4:105)59. Do not cooperate in sin and aggression (5:2)60. Cooperate in righteousness (5:2)61. ’Having majority’ is not a criterion of truth (6:116)62. Be just (5:8)63. Punish for crimes in an exemplary way (5:38)64. Strive against sinful and unlawful acts (5:63)65. Dead animals, blood, the flesh of swine are prohibited (5:3)66. Avoid intoxicants and alcohol (5:90)67. Do not gamble (5:90)68. Do not insult others’ deities (6:108)69. Don’t reduce weight or measure to cheat people (6:152)70. Eat and Drink, But Be Not Excessive (7:31)71. Wear good cloths during prayer times (7:31)72. protect and help those who seek protection (9:6)73. Keep Purity (9:108)74. Never give up hope of Allah’s Mercy (12:87)75. Allah will forgive those who have done wrong out of ignorance (16:119)76. Invitation to God should be with wisdom and good instruction (16:125)77. No one will bear others’ sins (17:15)78. Do not kill your children for fear of poverty (17:31)79. Do not pursue that of which you have no knowledge (17:36)80. Keep aloof from what is vain (23:3)81. Do not enter others’ houses without seeking permission (24:27)82. Allah will provide security for those who believe only in Allah (24:55)83. Walk on earth in humility (25:63)84. Do not neglect your portion of this world (28:77)85. Invoke not any other god along with Allah (28:88)86. Do not engage in homosexuality (29:29)87. Enjoin right, forbid wrong (31:17)88. Do not walk in insolence through the earth (31:18)89. Women should not display their finery (33:33)90. Allah forgives all sins (39:53)91. Do not despair of the mercy of Allah (39:53)92. Repel evil by good (41:34)93. Decide on affairs by consultation (42:38)94. Most noble of you is the most righteous (49:13)95. No Monasticism in religion (57:27)96. Those who have knowledge will be given a higher degree by Allah (58:11)97. Treat non-Muslims in a kind and fair manner (60:8)98. Save yourself from covetousness (64:16)99. Seek forgiveness of Allah. He is Forgiving and Merciful (73:20)100. Do not repel one who asks (93:10)", "Its as if asking somethis that you have doubts about communism in the former Soviet Union in the 1950s", "The last lady is very courageous, respect! And kudos to Corey and his translator for daring to ask such a question so openly!", "I have my doubts about the super sweet weird 80s Buick that dude had", "Hey Corey, your work is excellent.", "@2:00 the man mentions that the Quran is a successful case but its lawyers are not ....@2:30 the woman in the video is a perfect example of this here is the proof of what I am saying from the Quran itself:10:94 Translation (Sahih International): So if you are in doubt, about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.(16:43) (O Muhammad), whenever We raised any Messengers before you, they were no other than human beings;(except that) to them We sent revelation. So ask those who possess knowledge if you do not know.", "Just let everyone be.I am a proud Muslim, obviously you can doubt whatever you want.Just don’t pressure people that disagree whether It would be a Muslim or Jew etc…..Remember you were born alone and yes you will die alone.At the end of your life just make sure to have fulfilled that what you were seeking peace and love human brother and sisters💪", "i just hope one of them brought \"al fiqh\" that muslims have which is the sciene of interpretation , not blind following. it's a huge science in islam.", "There's no way anyone would answer this honestly being filmed and all. They would run a high risk of getting assaulted potentially killed.", "Cory..ask the Hasidim if the believe Kabbalah amulets really ward off demons or not.!", "If you are a book reader who expect many many \"me too\" or \"aha moments\", embrace yourself for an adrenalin of surprises that Quran just might be a Thing for you. Happy enjoy Quran.It is very OK to be doubtful. The doubtful Muslims are very nice as they build curiosity to test the Quran by asking all sort of questions, and to learn from all kind of conflicting sources as much as possible. Luckily, we are in an information age that provide all sort of nice information including from our beloved brother Corey who granted Quran its \"15 minutes of Fame\". For that I am forever grateful to brother Corey. Alhamdulillah.Just pray to your own The Most Merciful, The Most Merciful of all mercifuls, The One that is more Merciful to you than your own beloved mother, to guide us, as mention in the first chapter Al Fatihah verse no. 6: \"Show us the straight way\"Only The Creator who can easily understand the behavior of Its creations, that they might have doubts, by putting in the beginning of Quran, a SHORT and CLEAR statement, Chapter no. 2 Al Baqarah verse no. 2: \"This is the Book; in it is guidance sure, without doubt, to those who fear Allah\". This is after in the previous first chapter, The Creator introduced Itself as The Most Merciful.", "5:36 Excellent translation! Good job, Mon Amie! 🤣", "Science goes along with the qu’RAAAN 🌚🌚🌚🌚🌚🌚🌚🌚🌚🌚🌚", "It has actually been known that the Earth was round since the time of the ancient Greeks. I believe that it was Pythagoras who first proposed that the Earth was round sometime around 500 B.C.The Quran is so innovative:)", "Ask Jewish Israelis about the book of Jasher, which is mentioned in the Hebrew Bible, but is no longer existed.", "Hello, could You please Ask Jewish Isrealites about by some called \"collaboration with the occupant of Poland\" and what is general consensus in Izrael on that matter.", "It seems that KoolAide sales are through the roof!!!!...but it was also nice to see that not everyone had purple or red lips.", "Wow, they're all petrified about telling the truth of what they are really feeling", "Yes please ask muslims if they believe in the Quran in public with their friends", "As a Mizrahi Jew myself, I very much doubt religous Mizrachim would give you an honest answer to this question, Corey, given the implications.", "4:25 She is so gorgeous and seem's to be an intelligent and cultured woman, as someone who is between agnosticism and islam, it would be nice to meet someone like her, actually i have also a lot of theological doubts about this faith.", "This is a completely pointless question. If you don't believe in the Quran, you're not a Muslim. If you believe in the Quran, you're a a Muslim. If you ask a Muslim if they believe in the Quran, of course they will say yes.Edit: I think if the question was \"Is there something you don't understand in the Quran?\" or \"Are there any commandments in the Quran that you don't understand the purpose of?\" you'd get much more interesting responses. This type of questioning is allowed for Muslims because the Quran says it's impossible to understand everything in the Quran. If you ask questions like \"Are you skeptical?\", \"Do you have doubts?\", etc. then you're questioning if they believe in Islam.", "FYI, we knew the earth was round before the Quran was written", "lol the great science developments thanks to the quran. How can you integrate these people in the modern world?", "Quran is written in a poetic language so it needs interpreting and deep understanding", "\"Everything about the soul\" agrees with modern science? What?", "I love how one Muslim says that the Quran is very clear, and then the very next Muslim interviewed says the Quran isn't always very clear. It's funny how all religions supposedly comes from a perfect and omniscient god yet this god has such trouble getting his precise word out that is easily understood by all without causing multiple sects of each religion.", "nice", "Please watch Light for all nations channel and Christian Prince channel to see how islamic doctrines holds scrutiny😌👍🙏", "\"Hey butcher.  Is eating meat a bad thing?\"  Having doubts about the quran makes a Muslim an apostate.  Admitting it openly  can make him or her to an apostate in danger.", "When he asked questions to palestinian he how to make it controversial and then he asked israeli super comfortable to them and successfully answered", "I sometimes have doubts about whether people answer because of courtesy or they just need to feel they fit in.", "Loved the buick! And beautifull balsamLolIf they said yes they would dissapear in seconds :)))The religion of peace", "100% yess words of Allah", "The question should be \"can you read the Quran in its original Arabic?\"", "Hey Corey, can you interview Messianic Jews? If you can find some", "*Totally thought it was Borat in the thumbnail*", "4:45 she is beautiful", "How about do you have any doubts about Torah and talmud", "Great replies, shows the power of their conviction ❤️", "Nope, the Quran is the only untampered divine scripture there is for all humanity to seek guidance from. Hadith on the other hand are the handiworks of satan and his minions.", "Did somebody really expected a honest response?", "Wow! This was made just 3 hours ago. Of course they can't say they have doubts on camera.", "Fanatics", "I think if you look at most religions you can find some kind of scientific truth and then some poetic way of speaking about the universe so by that alone I don't think you could really make the statement that it was from God simply based off that. My question would be for the muslim or for anyone's faith/religion is God by definition must be perfect in every way, because if God were not perfect then that faith wouldn't be the true religion since if their God or gods were not perfect then an imperfect God or gods doesn't make any sense since God by definition must be perfect lest there by a flawed God or gods. So how is the muslim God/Allah perfect in every way? Speaking of God's perfect righteous justice towards sin/evil. All sin throughout their who lives whether it being in the mind, or what they have said, or what they have done. So how does the muslim God deal with all the debt of sin/evil for the believer since God's justice must be perfect, it therefore has to be paid in full somehow, lest God's justice be flawed making it unrighteous/imperfect therefore an imperfect God. On the other hand, how is the muslim God perfect in love? How does the muslim God demonstrate love to us? A question that atheists ask monotheists is, \"what was God doing before He created the universe?\" In other words, if the muslim God is perfect, but only 1 God, then who could God talk to, or love, or have love shown back to Him \"a loving relationship\". So basically for all eternity, God would be alone to have no one to have a loving relationship with, so therefore, God would have to create another being who is capable of love in order that God would be able to finally share and have love shown back to him. If this is the case, then since God had to create in order to experience a loving relationship, then that would mean that this God would be lacking, and dependent upon another being in order to experience this most beautiful thing called love. If God is lacking and dependent upon another being in order to experience the most beautiful thing called love, then that would be an imperfect God and therefore not the true God. So how does the muslim faith answer these questions. I haven't gotten an actual answer from a muslim on these questions yet if you could possibly answer them for me. Thank you for your answers.Again the questions are:God's perfect justice?God's perfect love shown?God lacking/dependent upon another?", "Meshumed  you already know they are scared to answer, so why even ask?", "They either fail to understand the question or answering straight. I'd hasten to add their minds are full of political fodder that messes their thought process. There's always political rhetoric lurking in the background.", "Allah almighty said in Quran : that we can challenge the Quran to prove it is wrong,and one of many example in Quran : is Surah Al-Isra - Verse 88 : سورة الإسراء - الآية 88قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَىٰ أَنْ يَأْتُوا بِمِثْلِ هَٰذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًاSurah Al-Isra - Verse 88 :Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\"", "4:30إِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَـٰتُنَا قَالَ أَسَـٰطِيرُ ٱلۡأَوَّلِينَ", "Quran 2:26: Indeed, Allah is not timid to present an example - that of a mosquito or what is smaller than it. And those who have believed know that it is the truth from their Lord. But as for those who disbelieve, they say, \"What did Allah intend by this as an example?\" He misleads many thereby and guides many thereby. And He misleads not except the defiantly disobedient,", "I think admitting that the Quran has flaws would be on the verge of apostasy.", "The earth is a sphere—a fact noted nearly two thousand years ago by the Jerusalem Talmud.1 The objective of life is to move this \"ball\" into the shaar haMelech--the gate of the King.2 By fulfilling the mitzvot of the Torah, we move the world toward the goal of its creation.", "I feel like the woman from Hebron you have interviewed before.", "Please ask jew, according to them what is the relation between God (hashem) and masiha (mesiah)?", "Some of the replies are perfect examples for cult mentality that you normally find in sects such as \"Jehovah's witnesses\" or the \"Church of Scientology\". You are either so brainwashed that you do not dare  to question the scriptures/words of your dear leader/prophet. This is the classic thought stopping process described in George Orwell's 1984. Or you are so afraid of the backlash from your fellow disciples so you do not dare to voice criticism or doubt.", "Roundness of earth is a small thing. Allah speaks in the Quran about the expansion of the universe, 1300 years before Hubble telescope found universe was expanding; \"We built the skies with great might, and we are certainly expanding it.\" - Chapter 51, verse 47.science and the Quran are not opposites; in fact, Allah talks about His creation in the Quran, and the Quran is confirmed day by day as science progresses further in it's study of Allah's creation.", "Someone who don't believe in devil then read all comments after all they come from devil 😆😆😆", "Freedom:  Can't answer freely about the Quran.Man smokes a cigarette (haram) and says the Quran is never wrong.Etc ad infinitumLet's go to Dubai and see the wealthy Saudis, Qataris, Emiratis etc... drinking alcohol, holding Ukrainian hookers in each arm.", "JEWZ: Do you have any doubts about the Tora?", "The Qur'an relates the words by which Moses ordered the Israelites to conquer the Land:\r\r\"And [remember] when Moses said to his people: 'O my people, call in remembrance the favour of God unto you, when he produced prophets among you, made you kings, and gave to you what He had not given to any other among the peoples. O my people, enter the Holy Land which God has assigned unto you, and turn not back ignominiously, for then will ye be overthrown, to your own ruin.'\" [Qur'an 5:20-21] the Holy Qur'an explicitly refers to the return of the Jews to the Land of Israel before the Last Judgment - where it says: \"And thereafter We [Allah] said to the Children of Israel: 'Dwell securely in the Promised Land. And when the last warning will come to pass, we will gather you together in a mingled crowd.'\" [Qur'an 17:104]", "Now ask them what they know about specific stuff written in the Quran.  That will be enlightening.", "The question lacks some depth. It doesn't cite any passages that the Muslim Palestinians might disagree with, nor does it make a distinction between the core of the Quran (Muhammad's life and teachings) and the supplementary aḥādīth (sayings attributed to Muhammad, reported by other people).", "5:00 The woman wanted to say the ocean of remembrance i think", "what will be the  result of this survey Corey...u can report to your master that now it is the time..or what....", "It's interesting how their responses are just like the religious jews and christians I know. \"of course it's true.. god wrote it!\" \"there are scientific secrets in our text\", etc.", "Honestly this is a question for Hamas. They need to make sure that firing rockets at innocent Israelis is sanctioned by the Quran.", "about speaking on doubts openly , we always go to the scholars if we have any doubts and its public , so yeahand + , if you don't believe in all the quran its a statement of disbelief, God/Allah is mad from the sons of israel for this specific thing,Chapter 2 83. And ˹remember˺ when We took a covenant from the children of Israel ˹stating˺, “Worship none but Allah; be kind to parents, relatives, orphans and the needy; speak kindly to people; establish prayer; and pay alms-tax.” But you ˹Israelites˺ turned away—except for a few of you—and were indifferent.84. And ˹remember˺ when We took your covenant that you would neither shed each other’s blood nor expel each other from their homes, you gave your pledge and bore witness.85. But here you are, killing each other and expelling some of your people from their homes, aiding one another in sin and aggression; and when those ˹expelled˺ come to you as captives, you still ransom them—though expelling them was unlawful for you.1 Do you believe in some of the Scripture and reject the rest? Is there any reward for those who do so among you other than disgrace in this worldly life and being subjected to the harshest punishment on the Day of Judgment? For Allah is never unaware of what you do.", "وَقُلِ الْحَقُّ مِن رَّبِّكُمْ ۖ فَمَن شَاءَ فَلْيُؤْمِن وَمَن شَاءَ فَلْيَكْفُرْ😂♥️🥀", "In the name of Allah The Most Gracious, The Most Merciful to the believers,All praise and gratitude is for Allah,Peace be upon the one who follows the clear path. I invite to the true religion of our creator the creator of the heavens and the earth. Allah is One. The only one who is independent, all-powerful and Unique. Allah has no sons and no daughters our creator is the most high. Nothing and no one is worshiped in truth except Allah. Allah is eternal and in need of no one, we (the creation) are dependent on Allah The one who sent the prophets with the message: Only worship Allah, and do not worship any false gods/goddesses. The prophet Muhammed peace be upon him is the last prophet of Allah.Interpretation of the meaning of the Original Quran91:9/10Surely the one who purifies it (the soul) (from sins) will prosper.And surely the one who corrupts her (by sins) will lose.2:256There is no compulsion in religionThere are those who tell lies about Allah. The Truth has come and falsehood has vanished. Falsehood is surely bound to vanish. The truth is found in the Quran and the authentic hadith (in Unique Arabic). Allah preserved his messages. There is only 1 Quran and not a letter has changed,  And the sayings of the prophet (pbuh) are also preserved.Www.Quran.nl", "Public expressions of doubt about the koran will result in execution in the name of Allah by one of the faithful", "Does this include the violent parts?", "00:37 the christian woman, respect. That's what no one wants to hear of those (you know)", "You should go to an Orthodox Jewish community and ask the same exact question but about the Torah. I'll bet you'll get some very similar answers.", "As a half Arab/Persian muslim, Corey sometimes plays with fire", "Why ask these kind questions 😡", "4:37 brave woman,pretty too.", "Sheeps lol", "3:20 Definitely.The Quran needs to be respected, read and put into practice with it's whole entirety, along with the Sunnah of the Prophet Muhammad peace be upon him.If you do some thing based on one part or a section only and reject the others, that will be the reason for injustice to occur.That's why it's v important for muslims to learn their religion. Without knowledge and understanding of the Quran and Sunnah, then you get where the Muslims are today. The Quran has become something forgotten,", "You should ask palestinians what is zionism", ">science goes with our religionHahahahahahahahhahahahahahahahahahahahahahahahhahahahahahahahahahahahahgahahahahahahahahahaggahagahahahgagagagaga", "this is probably the worst video you’ve made yet😂poor translations, and some of the people didn’t even understand the question properly and just went on and on about irrelevant shit", "4:04 Eratosthenes not only proved the earth was a sphere centuries before Islam or Christianity was founded, but he measured the circumference in the second century BCE. The earth's shape was common knowledge long before the Quran was written. https://en.wikipedia.org/wiki/Eratostheneshttps://imagine.gsfc.nasa.gov/features/cosmic/earth_info.html", "4:24 massallah, the best Answer given by the best English speaking  Person and probably most educated in the Video. JazakAllah Sister", "3:41 Shouldve pressed those guys who said the quran is clear and there is no room for interpretation. They would have to justify terrorism like the taliban bombing a school, killing like 60 (muslim) children just this may.", "What a loaded question.....how did you convince your translater to go ask this question?", "If anybody disagree bring it on !!!!Quran is 100 pure bcs it's been memorised by thousands", "Quran is true 100%", "I have doubts that you even care about COVID , not wearing masks in public is rude and irresponsible", "If they have any doubts about the Koran, they dare not say so.", "This is perhaps the dumbest question that I've encountered on Ask.", "04:31How dare she ThinkIndependently!!", "Why some people are surprised in the comments, there is absolutely no problem if you have doubts about Islam a lot of people have little to no knowledge about it even if they are Muslims because they just happen to be Muslims because their parents are and they only don't eat pork lol", "Which one is true, the lady that openly visually does dont follow but says you can't openly say u have doubts or the one that visually looks to be following and openly implies has doubts without giving any actual details", "Quran doesn't contradict Science it is 100% accurate, read Maurice Bucaille's Book THE QUR’AN AND MODERN SCIENCE", "If the media and everyone that's against Islam would find any contradiction in the Qur'an they will be showing it to us everyday. But they couldn't that,s why they try to call us ter ror ists and all kind of names. *The Qur'an challenges you to find a contradiction in it *", "The question doesn't make senseIf you're Muslim of course you won't have doubts about Quran.Im surprised some people expected otherwise", "the last woman are giving two answers yes and no hhhhactually her answer is completely wrong and i dont know why the hell she's wearing hijab if its douting quraan quraan is a book of terms and instructions for the life and also the stories that mentioned in the quraan its for lesson not for fun though she have to read about her religion", "5:05 😍😍😍 אני מת", "A lot of Muslims in the Arab world especially, the youth and the very old have  doubts with Islam only that they keep it themselves and never talk about it."]}, "1VZTd_UEr3w": {"title": "Palestinians: Are people answering my questions honestly?", "top_level_comments": ["Very interesting woman. She understands the issue is internal and the hate to Israel is used as an excuse. I wish more Palestinians would focus on building their lives instead of dreaming of destroying another people’s lives. It will be win for everyone and this will bring peace to all", "the second lady, wow, kinda speechless, I hope she can find her flower in this lifetime", "When you want to help people, you tell them the truth. When you want to help yourself, you tell them what they want to hear", "The second person interviewed, was savageI adore and completely agree with her wisdom", "That first guy is like many Americans. He just wants to play it safe and not offend anyone. He's a afraid and doesn't want any repercussions.", "I think when there is a camera in your face anybody is going to tone down their response.", "Oh no, the questions are getting self-aware. Next step: Skynet.", "Woah, great vid! Loved the diversity of ideas brought up in the answers. The first guy should have been asked in Arabic or had his footage cut, as he didn't understand the questions and you guys didn't understand the answers. Love the work. Minor complaint to a brilliant project.", "Why do Palestinians and Israelis look alike , you actually can’t tell them from each other , both people are diverse in color and they don’t have a specific look , which is beautiful in my opinion", "Hi Corey! I love watching your videos, I think your doing amazing work! Also, this may be a random question to ask people, but could you ask how common are inter-faith relationships, among Israelis, Palestinians, and Druze?Thank you so much.", "If someone says \"absolutely no\", then it's paradoxical. _insert \"infinite looping\" GIF_", "The sister starting @ 2:18 spoke the truth.  Not to dismiss anyone else's wrongdoing, but she's 100% right about how on an individual level, people won't do right on the basic level.  May Allah grant her baraka for her honesty.", "I think you got your answer this week (Nizar Banat). My guess (don't think this is paranoid even though it sounds a bit crazy!): the PA know about your project. So do most of your respondents. The unspoken dictate is to toe the line.", "I think when someone is asked and  recorded by camera , then he will show the best about himself through answers and opinions and this goes for everyone not particularly Palestinians or Israeli?!!", "\"i'm rational\" proceeds to talk about we are in war until judgment day", "Corey, people will never answer political questions as the West Bank is listed as non free by Freedom House. They fear West Bank authorities will persecute them.", "I think some people will be reserved to answer so that they don’t get in trouble, and that applies to one group", "Brooker T. Washington said:A lie does not become the truthA wrong does not become rightEvil does not become good.... just because it is accepted by a majority.", "@2:16 what a courageous, honest lady. I look forward to the day when there will be millions speaking like her in the Islamic world.", "That second lady makes a very good point", "Love this channel, you doing a great job. I Hope one day to become like you!!", "To be honest , in corey's vids i always see both kinds of people on palestinian and israeli side. Some people are nice and peaceful and reasonable, others are mean and vengeful and unreasonable. This is the real division in the confict, not between Israel or Palestine, not between Left or Right. Its soft versus hard, empathic versus apathic, Loving versus Hating.", "You should have started by giving clear examples of your questions, you don't meet the same people every time, right?Political persecution exists in west bank or in the inland (1948), whether it was from PA or IDF.Every person is a potential suspect, every person has a file and is continuously monitored. one mistake or expression of \"wrong\" thought could shed light on you and restrict your life, employment and could classify you as a potential \"terrorist\".you may be falsely charged and go to prison or called for investigation, or you could find your name on top of the list of potential criminals of your area in case any riot occurs.", "Now that was a good question of the video!", "This channel is such a gem", "1:24 My respect to that lovely woman!", "\" I will bring you to the land( Eretz Yisroel), concerning which I have raised my hand to give to Avraham,to Isaac,and to Jacob,and I will give it to you( Am Yisroel) as a heritage.I am the Lord\" Exodus 6:8", "Damn! Second person is top!", "Corey i have a question for you and i want you to be honest and courageous. After years and years of videos, Do you prefer Palestinians or Israelis people humanly, culturally and welcome?", "The second person you interview in this video looks like my mom and it’s freaking me out.", "The second lady was very honest.", "They obviously have little to no political freedom at all", "What a load of codswallop, this channel is extremely equitable and the opinions shared vary", "The second woman gave one of the best response in these videos and third women I thought was an Israeli of European descent. You never really know.", "Research studies will be done on these interviews on day. So it's important to do it right. Good work.", "More emotional than rational is true and people also speak without knowledge of the things that they speak of", "That lady gave an answer of reality 1:15", "Wow the second woman- amazing", "\"Are you honest about being honest....?\"Respect to the first 2 guys. I hope their culture grows up .", "Love the second lady !", "6:12 Nadine is beautiful!", "6:08 😍😍😍😍 she’s so pretty", "this channel is gold.", "This question is a bit of a waste of time because that would require them to watch all your videos, I feel people are Very honest with you at all sides, and those who aren't we can tell", "Its clearly because they are at the midest of oppression. If they comment something aginst the ruling organisations or dominating community, they know they could get sewed", "The last girl is beautiful and smart", "I think the first and last ladies really nailed it. Powerful women and intelligent honest answers.", "The first lady I was SO SURE she was Haredi Jewish when I saw her on the thumbnail and before they started speaking to her in Arabic translation. She dresses just like Orthodox Jewish moms.", "0:20 Very meta", "Most of the Jews went into captivity in Babylon and some but not all  returned to Israel during the reign of Cyrus the Great of Persian who conquered the Babylonians. Over the centuries, this land was conquered by many peoples and was known by many different names.", "wijdan , please be my wife", "With so many people there asking to hide their identity (voice and face), I think it's a huge clue about whether they fear to talk or not.Wish next time they will get hummus instead of Hamas.", "Here are some questions for the content creator/interviewer : Are you neutral? Do you ask questions innocently without taking side? Do you  cherry pick the answers that you show in your videos based on political and religious biais? How about this: why don’t you answer yourself the questions you are asking at the beginning or end of the videos so we can see what you as an interviewer think? Why don’t you present yourself and your project at the beginning of each video, short introduction of your background like many content creators do, so at least someone who just accidentally sees the videos while browsing YouTube knows what it is about.", "Sounds like the woman talking about LGBT+ rights is probably okay with it. That's really refreshing to see as it seems not many are there.", "MESHUMED DON'T THINK I FORGOT ABOUT YOU", "The lady at 2:02 is amazing. She's strong. I have a feeling being related to her is fun. She's probably a rock for the family. I like her. She's very practical.", "Asking people if they answer questions honestly is pretty weird...", "Ask North Koreans if they can tell you the truth..", "\"l, g, b, t and the entire alphabet\" ooh oh no 🤨", "ازعاج السيارات يشوش على محتوى الفيديو", "Corey have you ever thought of given written anonymous surveys that they can put into a box that you carry around?", "People in Palestine are scared to be involved in politics because politics usually brings themselves and their family greater risk. Personally, many Palestinians told me not to talk about politics and not because of social pressure or the PA or whatever. It is completely natural for people to be wary of being open about their opinions with strangers and especially strangers with cameras if there is a general fear of oppression (whether it is justified or not) from the Israeli occupation. For example , the interviewer asked why don't prisoners explain their crimes... one obvious reason is that prisoners dont want to go over things they did in the past because they are afraid of inadvertently getting themselves in trouble again. You were already accused of a political crime and went to jail so why explain then go over it again in detail in front of a foreign interviewer? Do you want to go to jail again?Stop trying to force a narrative about Palestinians. It is natural that this form of interrogation won't produce reliable answers. This is the case with any population.", "Trés drole. It has been also said that Israelis tell the pollsters the truth and lie at the polls. And don’t think many of my fellow Americans are any better", "\"The Palestinians have nothing to lie about\" theres a lie right there. And then he goes on to say he cant talk politics out of fear. Yes the whole world does know...", "They are liars for the most part", "The blonde girl answered in a very PC, western American style. As in, she said a lot without really saying anything and avoiding the subject. Of course everyone has their own opinions. That's the most stupid truism constantly repeated.", "ah yes...the IDF is definitely watching YouTube videos to see who they should \"target\" for saying \"Free Balestine\" lol", "0:55 Very smart", "People have different opinions as a result of circumstances and what is true for them. Does it really matter if they answer truthfully or not ? Sometimes a truthful answer maybe not something you like, Corey for instance when you asked Palestinians whether Jews are indigenous to Israel ?", "They are afraid of palestinian Authority", "Awesome woman, 0:55", "As an Israeli, you have to realise that saying something pro Israeli will backlash when you are an Arab.The fact that the second lady hinted that their leadership is at fault for their conditions might backlash badly, i pray for her.", "كبروا حروف الترجمة العربية . الحروف صغيرة لانستطيع قرائتها اذا نشاهد الفيديو بالجوال", "Isaiah 53 , Psalms 22 , Zechariah 12 : 10 ! THANK YOU YESHUA ❤️ .", "The translation is wrong in the second woman's speech ,  she said exactly that some Palestinians who live on that side  act as if the occupation is a beautiful thing and they try to adorn it and that they are integrated with society and there is nothing negative and they don’t give the true picture in front of the camera ! And then she talked about life in general and touched on the side of each one who must reform himself before criticizing other things as well .......!", "Are people answering my questions honestly?\rThis is not a question obviously The answers depend on the person and everyone is different and has a different opinionWhether they answer honestly or not, no one caresIn fact, no one can knowOpinions are not fixed, a person can change his point of view anytimeI love your channel, but this is a strange illogical question", "The guy at 2:43 tells it as it is.", "I have fallen in love with that Palestinian women 4:25", "is Judea a Myth?This text from the sixth century BCE : . Herodotus a Greek historian 6th century BCE \" Between Persia and Phoenicia lies a broad and ample tract of country, after which the region I am describing skirts our sea, stretching from Phoenicia along the coast of Palestine-Syria till it comes to Egypt\" '' My own conjectures were founded, first, on the fact that they are black-skinned and have woolly hair, which certainly amounts to but little, since several other nations are so too; but further and more especially, on the circumstance that the Colchians, the Egyptians, and the Ethiopians, are the only nations who have practised circumcision from the earliest times. The Phoenicians and the Syrians of Palestine themselves confess that they learnt the custom of the Egyptians; and the Syrians who dwell about the rivers Thermodon and Parthenius, as well as their neighbours the Macronians, say that they have recently adopted it from the Colchians''", "The title \" are they using taqquiya to answer questions in a way that appears truthful ?\" Would also be appropriate..  Cause those who are in doubt didn't listen to enough Zakir naik. 🤣🎉", "6:00 this woman is beautiful.", "Here we go ...corey found the excuse to ask the same questions all again until they are sincere ...", "People are answering honestly as you can.", "I wanted to believe ur respondents' opinion but some slight things made me doubt. Plus there were comments that claim some of the respondents being paid to be in favor of one side.  Idk idc", "Because telling the truth nowadays may cost us our life", "ask them what they think about the ramallah lynch 20 years ago.", "the guarded and non-committing answers are enough to show that they have to practice self censorship... or else, maybe someone may come knocking at 3.30 am to \"ask a few more questions\"", "Goooood question!", "Since only Arabs have to have their face blocked out that tells us everything we need to know.", "How come the 'occupation' or the army has anything to do with them being HONEST in their answers", "Any person in The World would not be comfortable Answering random questions about subjects like personal believes , social Views , political opinions in front a stranger holding a camera in the Street .", "Hi how to ask a question? I would this followong question to be asked to Israelis\" why do you think palestinians hates Israelis?\" Thanks", "How is it that a innocent people who were brutalised by Nazi ideology during WW2 came to implement a Holocaust against the non Jewish locals of Palestine.,", "Nizar Banat’s murder by the PA is proof Palestinians know better then to speak honestly to the camera. Plus, it’s funny you ask if they’re honest about speaking on camera, while asking them on camera.", "At the end they are afraid from the occupation and the armys", "Yes. However, they don’t have the knowledge to answer these questions.", "Pilpul is the answer.", "The woman at 1.00m in understands it properly.", "0:54 This lady is so smart and wise; if only Palestinians would listen to her and not Hamas. But it's the same the world over - most people would prefer to live with a comfortable lie (that 'coincidentally' suits/favours them) than the uncomfortable truth.", "they fear from their government. what a stupid question?"]}}